{"title":"AH-64DJP","pageid":10637,"wikitext":{"*":"{{About\n| about = Japanese attack helicopter '''{{PAGENAME}}'''\n| usage = other versions\n| link = AH-64 (Family)\n}}\n{{Specs-Card\n|code=ah_64d_japan\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the helicopter, as well as its key features. In the second part, tell the reader about the helicopter in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Japanese attack helicopter {{Battle-rating}}. It was introduced in [[Update \"Starfighters\"]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Heli-Flight}}\n<!-- ''Describe how the helicopter behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nThe AH-64DJP sports a great manoeuvrability, an incredible acceleration and overall provides a great speed of up to 320 km/h in arcade and 295 km/h in realistic and simulator game modes. As fast as the [[AH-64D|United States Army, AH-64D Longbow]] and slower than the [[AH_Mk.1|British Army, AH Mk.1]] variants of the Apache, the AH-64DJP is still able to perform manoeuvres other helicopters can only dream about, from barrel rolls, flips to loops which allow it to evade enemy missiles with ease.\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 1,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n|-\n! AB !! RB\n|-\n! Stock\n| 269 || 249 || rowspan=\"2\" | {{Specs|ceiling}}\n|-\n! Upgraded\n| 320 || 295\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Heli-Armour}}\n<!-- ''Examine the survivability of the helicopter. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical systems.'' -->\nThe AH-64D Apache longbow, has only limited armour protection installed with bullet proof glass only being installed on the pilot windscreen. The helicopter uses Kevlar boron carbide, composite martial which is limited only to instrument, floor and side panels around the cockpit. It does not provide the same level of protection as seen on other helicopters such as the [[Mi-28N]].\n\n* Bullet proof glass installed only for the pilot - 22 mm thick.\n* Installation of Kevlar boron carbide, composite martial only on the: Seats, cockpit side panels, Gunner floor panels and pilot instrument panel - 20 mm thick.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Heli-Armaments}}\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | [[Ballistic Computer]]\n|-\n! CCIP (Guns) !! CCIP (Rockets) !! CCIP (Bombs)\n|-\n| {{Tick}} || {{Tick}} || {{Cross}}\n|-\n|}\n=== Offensive armament ===\n{{Specs-Heli-Offensive}}\n<!-- ''Describe the offensive armament of the helicopter, if any. Describe how effective the cannons and machine guns are in battle, also what ammunition belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M230E-1 (30 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* A choice between two presets:\n** 1 x 30 mm M230E-1 cannon (1,200 rpg)\n** 1 x 30 mm M230E-1 cannon (1,200 rpg) + 30 x Countermeasures\n\n=== Suspended armament ===\n{{Specs-Heli-Suspended}}\n<!-- ''Describe the helicopter's suspended armament: additional cannons under the winglets, any bombs, and rockets. Since any helicopter is essentially only a platform for suspended weaponry, this section is significant and deserves your special attention. If there is no suspended weaponry remove this subsection.'' -->\n{{main|AGM-114K Hellfire II|ATAS (AIM-92)|Hydra-70 M247}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 76 x Hydra-70 M247 rockets\n* 8 x AGM-114K Hellfire II missiles\n* 4 x AGM-114K Hellfire II missiles + 38 x Hydra-70 M247 rockets\n* 8 x AGM-114K Hellfire II missiles + 38 x Hydra-70 M247 rockets\n* 16 x AGM-114K Hellfire II missiles\n* 4 x ATAS (AIM-92) missiles + 76 x Hydra-70 M247 rockets\n* 4 x ATAS (AIM-92) missiles + 8 x AGM-114K Hellfire II missiles\n* 4 x ATAS (AIM-92) missiles + 4 x AGM-114K Hellfire II missiles + 38 x Hydra-70 M247 rockets\n* 4 x ATAS (AIM-92) missiles + 8 x AGM-114K Hellfire II missiles + 38 x Hydra-70 M247 rockets\n* 4 x ATAS (AIM-92) missiles + 16 x AGM-114K Hellfire II missiles\n\n=== Defensive systems ===\n<!--''Defensive armament with turret machine guns or cannons, crewed by gunners. Examine the number of gunners and what belts or drums are better to use. If defensive weaponry is not available, remove this subsection.''-->\nThe '''''{{PAGENAME}}''''' only has the following Defensive systems installed:\n\n* '''Flares''' - Up to 30 flares can be installed.\n* '''AIM-92/ICM''' - AIM-92 Stingers and Infrared Counter Measures.\n\nWhen unlocked, flares are not installed - this requires the Flares module (tier I) to be researched and installed, this provides up to 30 flares. The last module called AIM-92/ICM (tier III) allows for the installation of a maximum of four AIM-92 Stinger missiles, which two are mounted on each wing tip, 30 flares & IRCM module.\n\nImportant note: unlike the American and British brothers, the AH-64DJP lacks a MAW (missile approach warning) system. This means that the AH-64JDP player should keep an extra eye on SPAAs and incoming SAMs by himself, as without MAW missiles must be spotted and flares deployed manually.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in a helicopter, the features of using the helicopter in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\n'''Overview:'''\n\nThe AH-64DJP is very similar to the AH-64D Apache. The only difference is the lack of an ability to carry an advanced MAW (a system that alerts the pilot to incoming missiles, Missile Alert Warning). The Apache is an excellent helicopter for attacking ground targets, and can also hold its own against many enemy aircraft. Through adequate use of cover, teamwork, and game sense, the Apache can easily dismantle enemy teams. An Apache pilot must understand all of the tools at their disposal.\n\nThe Apache has an arsenal of weapons. The most effective anti-tank weapon in the Apache's arsenal is the AGM-114 Hellfire, which uses a top attack trajectory to destroy ground vehicles. There is functionally very little difference between the AGM-114B and K variants, used on early and late Apaches respectively.\n\n'''Staying Alive:'''\n\nFlying the Apache effectively can be more difficult than most players would imagine, processing information from optical sights, radar displays, and the radar warning receiver all at once can lead to information overload. If distracted by irrelevant information, a pilot can quickly lose situational awareness. Being successful in the Apache requires situational awareness above all else. Due to the fragility of the helicopter, any blindspot can lead to a quick and sudden death. Additionally, the mobility of the Apache is adequate but not impressive, so evasive manoeuvres are not always effective.\n\nUsing cover is a very important part of staying alive in the Apache. Always stay behind a hill or building in ground battles. When exposing yourself in order to fire on the enemy, be mindful to not gain too much altitude. Most importantly, Always listen to your RWR and MAW. If you hear an alarm, take evasive action immediately.\n\nThe biggest improvement of the later Apache variants is the ability to mount the Longbow radar system. This system, if used properly, will help maintain situational awareness.\n\nAdditionally, it is important to know when to use flares. Flares are extremely effective against heat-seeking missiles, but useless against any other missiles. It is the responsibility of the Apache pilot to recognize the threat and decide whether to use flares or not. For Apaches with MAW (missile approach warning), there is an option for flares to be dispensed automatically.\n\n'''Using the Longbow Radar:'''\n\nThe radar of the Apache should be used as a secondary tool when engaging ground targets. As of update 1.99.1.45, the radar is not effective in obtaining target lock for ground vehicles. The AGM-114L radar guided Hellfire is not in the game, so guidance of Hellfires should be done by using the FLIR thermal imaging camera to lase targets. However, the radar is still useful in detecting enemy aircraft. By using the multi-function menu to switch radar mode, the radar will begin to search for air rather than ground targets. Keeping track of enemy aircraft is vital to survival in the Apache, as any plane can make quick work of the Apache if the helicopter is unprepared.\n\n'''Air-to-Air (Stinger and Gun):'''\n\nThe Apache is surprisingly potent in air-to-air combat. Engagements should be conducted primarily through the use of the Stinger missile. The Stinger is a simple but effective air-to-air missile. It has an excellent seeker head and can obtain all aspect lock on almost any air target within 3-5 km (even propeller aircraft with a low heat signature). However, the Stinger can be easily fooled by flares or outmanoeuvred by a fast enemy aircraft. The best way to use the Stinger against enemy aircraft is when they are heading directly towards you. If fired at the right second, most enemies will struggle to dodge a Stinger.\n\nIf the enemy gets close, the 30 mm autocannon can be extremely effective. The gun will automatically aim with optical lock, so Apache pilots can aim accurately while taking evasive manoeuvres.\n\n'''Close Range Air-to-Ground (Gun and Rockets):'''\n\nAt close range, the Apache has excellent offensive capability. The 30 mm autocannon is incredibly accurate even at surprisingly far distances. This cannon uses a High Explosive Dual Purpose round that can engage lightly armoured targets. Rocket pods can also be used, with the CCIP computer helping maintain accuracy even at further distances. Be careful when trying to use the Hellfire missile at close range. It can do a direct attack at closer ranges (rather than its usual top attack) but if fired at an odd angle, it may not have time to manoeuvre onto the target if fired at closer ranges.\n\nThe problem with trying to engage at close range is that doing so will put the Apache in huge amounts of danger. Enemy tanks will be able to quickly destroy the Apache with their main guns or anti-aircraft machine guns.\n\n[[File:HellfireTrajectory.png|thumb]]\n'''Long Range Air-to-Ground (Hellfire): '''\n\nAt longer ranges, the Hellfire missile can be used to full effect. The Hellfire will guide on its target as shown in the attached diagram. This is known as top attack. Being that it takes this path to the enemy target, the Hellfire can take upward of 30 seconds to reach its target at longer ranges. Do not fire at enemies that are about to move to cover, and make sure to fire multiple missiles at once in order to deal maximum damage. Because the Hellfire is laser guided, multiple missiles can be fired at once. They should be fired at intervals of 5-10 seconds, where between missiles the Apache can switch to a new ground target. This will allow for the quick destruction of multiple enemies. This tactic can be incredibly effective. Although the time to target for the most recently fired Hellfire is available on the HUD, pilots will have to keep track of all the missiles they have fired by memory and quick calculations.\n[[File:HellfireSequenceDemonstration.mp4|left]]\n\nCombatting enemy anti-aircraft vehicles can be a challenge. Always remain in cover and move unpredictably in combat. Use the radar warning receiver to obtain the general direction of enemy AA, and then attack with a Hellfire. An effective strategy is to fire a Hellfire, break optical lock to gain cover and avoid counterfire, and then pop back up and get lock again several seconds before the Hellfire hits. This strategy if applied correctly will result in a hit, as the Hellfire is smart enough to begin following the laser designator again once the Apache re-obtains its lock.\n{{Clear}}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Attack capabilities:\n** Rockets\n** Long-range Hellfire II ATGMs\n*** Timer to show you when they will hit the target, giving you the exact time to return to cover\n*** Range of approximately 9 km\n*** Can launch and guide several ATGMs at the same time\n** Flexible 30 mm cannon\n*** Has 51 mm pen tops in a mono-type belt\n* Anti-air capabilities:\n** 4 AIM-92 Stinger AAMs\n** Flexible 30 mm cannon\n*** Rounds in mono-type belt are {{Annotation|HEDP|High Explosive Dual Purpose}}\n* Spotting capabilities:\n** Longbow radar, both air and ground units\n** Thermal sights\n* Amazing speed, acceleration, climb and roll - very manoeuvrable helicopter\n* Very survivable (Compared to other helis) with 2 crew members, and a beefy air frame\n\n'''Cons:'''\n\n* Long-range Hellfire II ATGMs\n** Slow, utilizing their long range is hard due to very long flight times\n** While they can in theory hit air targets, they're too slow to reliably hit air targets\n* Lacks {{Annotation|MAW|Missile Approach Warning}} which is a very important system for top helicopters\n* Has only 30 flares\n* 30 mm cannon has high dispersion at longer range, making it inaccurate beyond 500 m\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the helicopter in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nThe AH-64D was selected by the Japanese Ground Self-Defense Force (JGSDF) in 2001, with a requirement for about 50 helicopters. 50 were ordered, and they were built by the Japanese Fuji Heavy Industries as the '''AH-64DJP''' (JP standing for Japan). The first AH-64DJP was delivered in 2006, but the order was cancelled after the delivery of only 13 helicopters. The AH-64DJP has the possibility of equipping AIM-92 Stinger air-to-air missiles (AAMs).\n\nIn 2017, it was announced that the AH-64DJP helicopters were to have their targeting systems upgraded by the American Lockheed Martin defense firm. According to a press briefing from April 26 of 2017, the upgrade was to the Modernized Target Acquisition Designation Sight/Pilot Night Vision Sensor (M‑TADS/PNVS). The M-TADS is the laser designator that allows the targeting of the AGM-114 Hellfire missiles, while the PNVS assists with safe flight in day, night, and adverse weather missions. The contract was for the delivery of 14 Modernized Day Sensor Assembly (M-DSA) laser designator kits. The M-DSA increases the reliability of the laser designator and also increases the precision of the system. Additionally, Lockheed Martin's Apache sustainment team was to provide performance-based logistics support to the JGSDF under a separate three-year contract. Japan was the first Apache operator to receive the M-DSA upgrade.\n\nAs of 2017, the JGSDF operated one squadron of ten AH-64DJP helicopters, with the other three acting as training helicopters. One AH-64DJP was destroyed in a crash in February 2018, resulting in the deaths of both crew members; this left a total of 12 AH-64DJP helicopters.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=ah_64d_japan Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n{{Skin-gallery |market|ugcitem_1000607|AH-64DJP JG-4557.png|Camo \"AH-64DJP, Bicolor winter\"}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the helicopter;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Rotorcraft of comparable role, configuration and era\n\n* [[Mi-35M]]\n* [[Ka-50]]\n* [[EC-665 Tiger HAP]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wikipedia:Boeing_AH-64_Apache|[Wikipedia] Boeing AH-64]]\n* [https://www.helis.com/database/model/AH-64DJP-Apache/ <nowiki>[Helis.com]</nowiki> Fuji AH-64DJP Apache]\n* [https://www.milavia.net/news/2006/first-ah-64djp-delivered-to-the-jgsdf.html <nowiki>[MILAVIA]</nowiki> First AH-64DJP Delivered to the JGSDF]\n\n{{AirManufacturer Fuji}}\n{{Japan helicopters}}"}}