{"title":"BO 105 PAH-1","pageid":3368,"wikitext":{"*":"{{About\n| about = German utility helicopter '''{{PAGENAME}}'''\n| usage = other versions\n| link = BO 105 (Family)\n}}\n{{Specs-Card\n|code=bo_105pah1\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the helicopter, as well as its key features. In the second part, tell the reader about the helicopter in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} German utility helicopter {{Battle-rating}}. It was introduced in [[Update 1.83 \"Masters of the Sea\"]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Heli-Flight}}\n<!-- ''Describe how the helicopter behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 0 m - at sea level)\n! rowspan=\"2\" | Max altitude<br>(metres)\n|-\n! AB !! RB\n|-\n! Stock\n| 215 || 197 || rowspan=\"2\" | {{Specs|ceiling}}\n|-\n! Upgraded\n| 257 || 242\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Heli-Armour}}\n<!-- ''Examine the survivability of the helicopter. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical systems.'' -->\n\nThe BO 105 PAH-1 does not have any armour plates. The three self-sealing fuel tanks are located under the floor on the cabin of the helicopter. Both engines are located next to each other, a single hit with an air to air missile or a high penetrating shot will be able to destroy both engines.\n\nThe BO 105 PAH-1 has one gunner and one pilot they are located next to each other. If the gunner is knocked out, the none of the weapon systems can be fired. Additionally, BO 105 PAH-1, is one of the most agile helicopters in game since it is not weighed down by heavy armour plating and offers a great speed.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Heli-Armaments}}\n=== Suspended armament ===\n{{Specs-Heli-Suspended}}\n<!-- ''Describe the helicopter's suspended armament: additional cannons under the winglets, any bombs, and rockets. Since any helicopter is essentially only a platform for suspended weaponry, this section is significant and deserves your special attention. If there is no suspended weaponry remove this subsection.'' -->\n{{main|HOT-1|HOT-2 TOW|FFAR Mighty Mouse|FN M3P (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* 6 x HOT-1 missiles\n* 2 x 12.7 mm FN M3P machine guns (500 rpg = 1,000 total) + 60 x Flares\n* 2 x 12.7 mm FN M3P machine guns + 60 x Flares + 6 x FFAR Mighty Mouse rockets\n* 1 x 12.7 mm FN M3P machine gun + 3 x HOT-2 TOW missiles + 30 x Flares\n* 1 x 12.7 mm FN M3P machine gun + 3 x HOT-2 TOW missiles + 30 x Flares + 3 x FFAR Mighty Mouse rockets\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in a helicopter, the features of using the helicopter in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe BO 105 family can be used at any time of the battle. You can try to quick cap in an inexpensive scout vehicle and gain enough spawn points for the loadout with 6 ATGM and then pick off unsuspecting tanks.\n\n'''Positioning:''' Stay at maximum range (3.5 to 3.9 km) to be able to react to incoming fire. This means you need to cancel the forward speed. Do this by pulling back sharply on the cyclic (S key) until your nose points upwards, then activate the hover mode. Use the rudder to orient the nose towards the enemy. This step is important and most pilots fail to stay at range and get shot down by small caliber, main gun or SPAAG fire. Check the battle rating and stay low if you face SAM, otherwise you can safely gain altitude to prevent targets from driving behind cover.\n\n'''Target selection:''' From the moment you take off from the helipad, scan the enemy spawn points first, as previoulsy knocked out enemies are almost guaranteed to respawn in a SPAAG. Your primary targets should be anti air vehicles, followed by lightly armoured vehicles, as they present almost guaranteed single-shot knock-outs. MBT can easily be engaged from any angle if you can aim the missile precisely. Consider aiming at closest vehicles first, as this reduces missile flight time and increases your hits per minute.\n\nIf you get shot by ground vehicles, you should switch the target by going to the third person perspective and trying to locate the threat. Then point the helicopter nose to the target in order to be able to fire the missile\n\n'''Aiming:''' Aiming is easy in hover mode, however, the BO has a very small launch window, i.e. the nose needs to be pointed quite directly towards the target. If you are high, you might need to quickly lower the nose (short nick axis input) to be able to fire the missile. If you loose the lock when the nose is brought back up by the instructor, you should descend or go back to pilots view and orient the nose towards the enemy. Unless a tank presents you his front, you should aim for the turret. Frontally, aim for the drivers hatch.\n\n'''Evasion:'''\n\n* Avoiding incoming fire: Key to survival is staying at range in order to increase the available reaction time. If you get closer than 2km, turn around and you will dramatically increase survivability. To avoid incoming fire you need to be able to see it, i.e. you should not zoom fully into the target from the very first second from the launch. Since the missile travels 12-16 seconds, you can safely stay zoomed out for 10 seconds and you will be able to see incoming SPAAG fire. Enemy SPAAG will aim for the projected point where you will be after the flight time of the bullet so your goal is to change your flight path constantly but not predictable. You could fly a roll by keeping A or D pressed or you could fly a box shaped pattern. The missile will still track during such a manoeuvre and only shortly before the impact you need to be in an upright position for a good aim.\n* Avoiding enemy planes: Enemy planes will usually detect you visually. You can be seen from far away when the dark helicopter is before a bright blue sky, i.e. if you are above an enemy plane. I.e. you should constantly keep an eye on the enemy plane spawn and listen for the sound of propeller or jet engines. If you detect an enemy plane, you should go low (below the tree line, into a valley) and you should try to hover. A helicopter hovering below the treeline in a forest is nearly invisible. On a map without trees you can try to take cover behind buildings taking advantage of the impressive manoeuvrabilty of the BO 105, but you need to be very close to the building and very close to the ground. The hangar on the helipad is very well suited for this, but skilled pilots will notice that and try to attack directly from above, in which case you should try to fly directly under the plane so that he either needs to pull up or crash.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent manoeuvrability\n* Highly agile, able to perform rolls that can evade planes, incoming ground or air to air missiles and long range APFSDS shots\n* ATGM can be effectively used against tanks\n\n'''Cons:'''\n\n* Small guidance window for missile launches and tracking\n* Cannot really defend itself against enemy helicopters and/or enemy planes\n* No armour protection, a well placed hit will knock it out\n* No Machine guns or cannons mounted, directly on the aircraft like [[Ka-52]], [[AH-64D]]\n* Machine guns can only be installed on the wing mount which reduces the ATGM loadout options\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the helicopter in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nThe BO 105 was a helicopter developed in Germany in the 1960's and 1970's for both civil and military markets. The BO 105 PAH-1 (PAH standing for Panzerabwehrhubschrauber; tank-defense helicopter) is a military variant of the BO 105 helicopter. It is in service with the German Army.\n\nThe German Army made the decision to procure a specialist anti-tank version of the BO 105 in 1975, which could carry up to six Euromissile HOT missiles. 212 were delivered in total between 1979 and 1984, and they were designated as the BO 105 PAH-1.\n\nThe BO 105 PAH-1 had been developed as a temporary, stop-gap measure until a more capable anti-tank helicopter entered service. The German Army found its lack of self-protection capabilities and lack of night combat capability to be great issues.\n\nAs such, the Eurocopter Tiger was developed and entered service in the early 2000's. When the Eurocopter Tiger entered service, some BO 105 PAH-1s were retired while others were disarmed and modified to the VBH standard (Verbindungshubschrauber; liaison chopper) transport and surveillance helicopter. The converted PAH-1s replaced the BO 105M in that role.\n\nThe BO 105 PAH-1 featured a completely hingeless rotor arrangement, an uncommon feature for helicopters; the main rotor had four blades and the tail rotor had two. The power came from two Allison 250-C20B engines, rated at 420 SHP each. Internal fuel provisions were for 570 litres, but external tanks could be carried to increase the range. The BO 105 series was known for their reliability, almost never breaking down. They were designed so that if one engine was lost the helicopter could continue to fly, albeit with less speed and range. The BO-105 PAH-1 was flown by a crew of two.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=bo_105pah1 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed\" heights=200>\nFile:BO 105 all WTWallpaper 001.jpg\nFile:BO 105 PAH-1 WTWallpaper 001.jpg\n</gallery>\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the helicopter;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/5824-development-bo-105-attack-helicopters-en|[Devblog] BO 105 Attack Helicopters]]\n\n{{AirManufacturer MBB}}\n{{Germany helicopters}}"}}