{"title":"Ka-52","pageid":9649,"wikitext":{"*":"{{Specs-Card\n|code=ka_52\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|Ka-52 WebsiteImage 1.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the helicopter, as well as its key features. In the second part, tell the reader about the helicopter in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Russian attack helicopter {{Battle-rating}}. It was introduced in [[Update 1.97 \"Viking Fury\"]].\n\n== General info ==\n=== Flight performance ===\n[[File:Ka-52 3.png|thumb|350px|Ka-52 in flight]]\n{{Specs-Heli-Flight}}\n<!-- ''Describe how the helicopter behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 1,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n|-\n! AB !! RB\n|-\n! Stock\n| 315 || 289 || rowspan=\"2\" | {{Specs|ceiling}}\n|-\n! Upgraded\n| 320 || 310\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Heli-Armour}}\n<!-- ''Examine the survivability of the helicopter. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical systems.'' -->\n\n* 44 mm Bulletproof glass - front windscreen of the helicopter\n* 20 mm Aluminium alloy - Sides of the cockpit\n* 20 mm Aluminium alloy - Bottom of the self-sealing fuel tanks\n\nThe helicopter has four separate fuel tanks: three at the rear of the fuselage, and one just behind the cockpit. Engines are placed above the autocannon with the fuel tanks spaced out around it.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Heli-Armaments}}\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | [[Ballistic Computer]]\n|-\n! CCIP (Guns) !! CCIP (Rockets) !! CCIP (Bombs)\n|-\n| {{Tick}} || {{Tick}} || {{Tick}}\n|-\n|}\n=== Offensive armament ===\n{{Specs-Heli-Offensive}}\n<!-- ''Describe the offensive armament of the helicopter, if any. Describe how effective the cannons and machine guns are in battle, also what ammunition belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|2A42 (30 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 1 x 30 mm 2A42 cannon, right fuselage-mounted (460 rpg)\n\nThe 30 mm 2A42 cannon can be equipped with a mixed (default) belt, an air targets belt, or a ground targets belt.\n\n* Default belt: ''{{Annotation|AP-T|Armour-Piercing Tracer}}{{-}}{{Annotation|HEF-I|High-Explosive Fragmentation - Incendiary (self-destroying)}}{{-}}{{Annotation|HEF-I|High-Explosive Fragmentation - Incendiary (self-destroying)}}{{-}}{{Annotation|AP-T|Armour-Piercing Tracer}}{{-}}{{Annotation|AP-T|Armour-Piercing Tracer}}'' - max penetration: 62 mm at 100 m.\n* Ground targets belt: ''{{Annotation|AP-T|Armour-Piercing Tracer}}{{-}}{{Annotation|APDS|Armour-Piercing Discarding Sabot}}{{-}}{{Annotation|APDS|Armour-Piercing Discarding Sabot}}{{-}}{{Annotation|APDS|Armour-Piercing Discarding Sabot}}{{-}}{{Annotation|APDS|Armour-Piercing Discarding Sabot}}'' - max penetration: 81 mm at 100 m.\n* Air targets belt:  ''{{Annotation|HEF-T|High-Explosive Fragmentation - Tracer (self-destroying)}}{{-}}{{Annotation|HEF-I|High-Explosive Fragmentation - Incendiary (self-destroying)}}{{-}}{{Annotation|HEF-I|High-Explosive Fragmentation - Incendiary (self-destroying)}}{{-}}{{Annotation|HEF-I|High-Explosive Fragmentation - Incendiary (self-destroying)}}{{-}}{{Annotation|HEF-I|High-Explosive Fragmentation - Incendiary (self-destroying)}}'' - max penetration: 3 mm at any distance.\n\n=== Suspended armament ===\n{{Specs-Heli-Suspended}}\n<!-- ''Describe the helicopter's suspended armament: additional cannons under the winglets, any bombs, and rockets. Since any helicopter is essentially only a platform for suspended weaponry, this section is significant and deserves your special attention. If there is no suspended weaponry remove this subsection.'' -->\n{{main|OFAB-250sv (250 kg)|FAB-500M-54 (500 kg)|GSh-23L (23 mm)}}\n{{main|9K127 Vikhr|9M39 Igla|9M120-1 Ataka|S-8KO|S-13OF}}\n[[File:Ka-52 Armament.png|thumb|350px|Ka-52 armed with S-8KO unguided rockets]]\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 80 x S-8KO rockets\n* 40 x S-8KO rockets + 4 x 9M120-1 Ataka missiles\n* 20 x S-13OF rockets\n* 4 x 250 kg OFAB-250sv bombs (1,000 kg total)\n* 2 x 500 kg FAB-500M-54 bombs (1,000 kg total)\n* 4 x 23 mm GSh-23L cannons (250 rpg = 1,000 total)\n* 4 x 9M39 Igla missiles + 80 x S-8KO rockets\n* 4 x 9M39 Igla missiles + 20 x S-13OF rockets\n* 4 x 9M39 Igla missiles + 12 x 9M120-1 Ataka missiles\n* 4 x 9M39 Igla missiles + 12 x 9K127 Vikhr missiles\n* 4 x 9M39 Igla missiles + 4 x 250 kg OFAB-250sv bombs (1,000 kg total)\n* 4 x 9M39 Igla missiles + 2 x 500 kg FAB-500M-54 bombs (1,000 kg total)\n* 4 x 9M39 Igla missiles + 4 x 23 mm GSh-23L cannons\n* 12 x 9M120-1 Ataka missiles + 40 x S-8KO rockets\n* 12 x 9M120-1 Ataka missiles + 40 x S-8KO rockets + 4 x 9M39 Igla missiles\n* 12 x 9M120-1 Ataka missiles + 10 x S-13OF rockets\n* 12 x 9M120-1 Ataka missiles + 10 x S-13OF rockets + 4 x 9M39 Igla missiles\n* 12 x 9M120-1 Ataka missiles + 2 x 23 mm GSh-23L cannons\n* 12 x 9M120-1 Ataka missiles + 2 x 23 mm GSh-23L cannons + 4 x 9M39 Igla missiles\n* 12 x 9K127 Vikhr missiles + 40 x S-8KO rockets\n* 12 x 9K127 Vikhr missiles + 40 x S-8KO rockets + 4 x 9M39 Igla missiles\n* 12 x 9K127 Vikhr missiles + 2 x 23 mm GSh-23L cannons\n* 12 x 9K127 Vikhr missiles + 2 x 23 mm GSh-23L cannons + 4 x 9M39 Igla missiles\n* 12 x 9K127 Vikhr missiles + 10 x S-13OF rockets\n* 12 x 9K127 Vikhr missiles + 10 x S-13OF rockets + 4 x 9M39 Igla missiles\n\n=== Defensive systems ===\n<!--''Defensive armament with turret machine guns or cannons, crewed by gunners. Examine the number of gunners and what belts or drums are better to use. If defensive weaponry is not available, remove this subsection.''-->\nThe Ka-52 can be outfitted with HIRSS (Hover Infrared Suppressor Subsystem), MAW (Missile Approach Warning) system, and 128 flares.\n\n* 128 Flares are installed on the wingtips in two pods.\n* HIRSS is a shield mounted on the exhaust that dissipates heat escaping from the exhaust, reducing the possibility of a successful enemy lock-on with a heat-seeking missile.\n* The Missile Approach Warning (MAW) detects any incoming missile and notifies you about it, as well deploying the flares automatically.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in a helicopter, the features of using the helicopter in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe Ka-52 is a true gladiator of the sky. It excels in any type of combat scenario, mainly air-to-ground operations. It can be equipped with a wide selection of armaments. From rockets and bombs to missiles, it has 24 different armament loadouts. Its two almighty Klimov TV3-117VMA turboshaft engines provide 2,350 BHP and 2,10 kgf of thrust each, making this 10,400 kg beast dance in the sky, like a ballerina dancing on a cloud. The Ka-52 has a total of six wing hard points, with three hard points on each wing.\n\n===Air to Air===\n====Ka-52 vs. Helicopters====\n\nThe Ka-52 in helicopter engagements requires some tactics and understanding of the other enemy helicopters that will be encountered in battle.\n\n'''Using the 30 mm autocannon'''\n\nThe Ka-52 is equipped with its [[2A42 (30_mm)|30 mm 2A42]] autocannon, the same cannon installed on the [[Ka-50]] and [[BMP-2]], able to destroy pillboxes, tanks, helicopters and jets with ease.\n[[File:Ka-52 2A42.png|thumb|350px|Ka-52 firing the 30 mm 2A42 autocannon]]\nIt's important to keep your speed high, which in turn which increase your agility. The Ka-52 can achieve this easily by just pointing the noise of the helicopter towards the enemy units. However, make sure to adjust for the location of the autocannon, as it is not mounted below or on the wings, but instead on the right side of the fuselage. The 2A42 only has a limited traverse of 30 degrees instead of full traverse as seen on the [[Mi-28 (Family)]] helicopters.\n\nSince the Ka-52 only has 460 rounds of ammunition, it is important to always aim for critical elements of the enemy helicopter which are:\n\n* The engine(s)\n* The transmission\n* The tail\n\nThis is important because it allows ammunition to be conserved.\n\n'''Using the ATGM & air-to-air missiles to destroy enemy helicopters'''\n\nBefore unlocking the iconic, lethal & legendary [[9K127 Vikhr|9K121 Vikhr]] missiles, which have made the [[Ka-50]] a prominent & terrifying experience to be fighting against, [[9M120-1 Ataka]] missiles are to used before. These are the same missiles used on the  [[Mi-35M]] and Mi-28 helicopters, and they offer up to 950 mm of penetration.\n\nTo achieve the best chance of scoring a hit, it is important to position the Ka-52 well. Keep enough space in the gunner's field of view rectangle for any adjustments that may have to be made. Unlike the Ka-50, the Ka-52 has a smaller rectangle which makes tracking a target more difficult if it is moving. This will require the Ka-52 to be adjusted in flight, which can cause the missile to overshoot or miss due to corrective actions.\n\n'''Using the Ataka missiles''' \n\nThe [[9M120-1 Ataka]] missiles travel at 550 m/s; they are not as fast nor do they have a proximity fuse as seen on the Vikhr missiles. The Atakas require a direct hit on the enemy; it is best to manoeuvre the Ka-52 into a position where the enemy helicopter is fully exposed and as close as possible, around 5 to 8 km. Make sure the missile is in the middle of the gunner's field of view rectangle for the tracking to follow it when it has been fired.\n[[File:Ka-52 Atakas.png|thumb|350px|Ka-52 armed with Ataka missiles and S-8KO unguided rockets]]\nA main challenge of using the Atakas is that if the helicopter has been engaged head-on at distance, the enemy player only has to dodge it, unlike the Vikhrs which feature a proximity fuse. This exposes your position and allows the enemy to fire back at you, possibly knocking you out of the match.\n\n\n'''Using the Vikhr missiles'''\n\nThe lethal [[9K127 Vikhr|9K121 Vikhr]] missiles only needs to be in a close proximity of an enemy helicopter or aircraft to destroy it. When using the Vikhrs, it is possible to lock an enemy and manually guide the missile, adjusting it for any correction or evasion tactics which are in play, to hit the target. More often, automatically locking the target with the Vikhr missile will suffice.\n\nUnlike the Atakas, the Vikhrs are able to knock out enemy helicopters and jets from the front even if they try to evade, as long as it is close to them. It will explode, either destroying them or scoring a critical hit.\n\n\n'''Using the Igla missiles'''\n\nThe Ka-52 carries up to four [[9M39 Igla]] missiles on top of its 12 Ataka or Vikhr loadouts. Each Igla is able to destroy an enemy helicopter with ease. With a top speed of Mach 1.7 and a max range of 5 km, with ECCM, the Iglas are a deadly weapon. It is able to down any enemy helicopter encountered. However, if the enemy is equipped with MAW or spots the missile and deploys flares, it could miss. The best position to launch an Igla is when they have either exposed their broadside or their rear. It is possible to fire it head-on, but if they deploy flares, it will reduce the chances of a missile hit.\n\n====Ka-52 vs. Fighters====\n\nA Ka-52 can be equipped with up to four Iglas. Whether the enemies fly fixed-wing aircraft or rotary-wing aircraft, the Igla will be effective. The ideal firing position for fixed-wing aircraft is to have the enemy aircraft approaching you head-on. This allows the Ka-52 to quickly lock the target and fire the missile; once fired it is possible to see that aircraft on fire, spiraling down towards the ground. \n\nIf the enemy has fired, the enemy missile can be evaded easily thanks to the MAW systems and IRCM on-board the helicopter, but you must also descend rapidly to the deck in an effort to stress the missile's pull. Once you have evaded the missile, lock on to the enemy aircraft and fire. In the event that the enemy aircraft evades the missile, they will most likely come back around and engage you again, so employ the same tactics as before. Remember, you have up to four Iglas at the ready.\n\n===Air to Ground===\n\n====Ka-52 vs. SPAA====\n\n=====Engaging at long range:=====\nThe first target which should be always prioritised and knocked out is the enemy SPAA. Switch to thermals if unlocked and profile the battlefield for any SPAA. When located, fire one of your ATGMs and glide it on target until it hits and destroys it.\n\n=====Defeating and evading an enemy missile:=====\nIn the event that an enemy SPAA has spotted and fired on you, deploy flares and drop to low altitude. Fly just under 20 m above the ground; the enemy missile's proximity fuse will not activate at this altitude.\n\n=====Engaging at close range:=====\n[[File:Ka-52 Rockets.png|thumb||350px|Ka-52 firing S-8KO unguided rockets]]\nUsing the autocannon, a few shots in the turret of an SPAA will destroy it. Using the rockets from the rocket pods, a well-placed shot will knock it out.\n\n====Ka-52 vs. Tanks====\nWhen engaging tanks from the front, it is best to fire two ATGMs to knock it out, as the ERA plates and armour will reduce the explosive energy of your missiles. However, if the enemy tank is being engaged from the side, a single well-placed shot just in front of the engine and behind the turret will see it exploding like a magical firework on the legendary St. Petersburg victory day celebration.\n\nAdditionally, the autocannon is able to destroy the enemy tanks too! The best way to do this is to approach from the rear, line up with the engine deck of the tank, and set it on fire, that will stop them in their tracks. However, do not leave them there or stop firing just yet. Keep firing and fly around them in a circle while aiming for the roof of the turret, the rounds will be able to penetrate them and knock out their crew.\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n[[File:Ka-52 Landing.png|thumb|350px|Ka-52 on the grass]]\n'''Pros:'''\n\n* Highly versatile: a true multi-role helicopter\n* Good level of armour protection around the flight deck\n* Very fast - up to 320 km/h\n* Effective anti-tank capabilities with the Vikhr missiles\n* Six hard points\n* Features the 30 mm 2A42  autocannon seen on the BMP-2s\n* The 30 mm cannon with an AP belt can penetrate up to 82 mm of armour, it can go through the roofs of most vehicles\n\n'''Cons:'''\n\n* Small area for locking on with Igla air-to-air missiles\n* Small area for the gunner field of view\n* Autocannon is mounted on the right-hand side of the helicopter\n* Limited auto cannon firing arcs\n* High angles of attack can result in fuel starvation to the engine\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the helicopter in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n''Design Basis:'' [[Ka-50#History|Ka-50]]\n\n'''Development'''\n\nWhile the V-80 prototype (which would later become the Ka-50 \"Black Shark\") and Mi-28 attack helicopters were going through comparative tests, an idea for a dedicated battlefield reconnaissance and target designation helicopter was raised by the Kamov design team. Because of the Soviet economic downturn of the 1980s, it was decided to base the new helicopter on the Ka-50 attack helicopter. The new reconnaissance and target designation equipment required the addition of a second crew member, who would operate the new systems. A side-by-side seating arrangement was chosen in order to facilitate co-operation of the two crew members. This new helicopter was designated as the Ka-52 and it was given the name \"Alligator\".\n\n'''Design'''\n\nThe Ka-52 features two radar antennas, rather than one as seen on the Ka-50. One is mounted in the nose for ground targets, and one is mounted on a mast for aerial targets. It also features two TV sighting systems; one under the nose, and one above the cockpit. The Ka-52 has the same side-mounted cannons as on the Ka-50. It has six wing hardpoints, two more than the Ka-50. To reduce weight, the Ka-52's armour and cannon ammunition was reduced. Because of this, some performance was lost. To rectify this issue, the VK-2500 powerplant was fitted. The Ka-52 is approved for day, night, and adverse weather conditions.\n\n'''Production and Testing'''\n\nConstruction of the first Ka-52 airframe began in 1996. Phase 1 of the testing was completed in December 2008, and phase 2 was authorized soon after. By the end of 2008, serial production had begun at the Progress Arsenyev Aviation Company plant in Arsenyev, Primorsky Krai. In 2010, eight Ka-52 helicopters were operated by the 696th Instructor and Research Helicopter Regiment, based at Torzhok Air Base. The eight helicopters were in varying states of capability and were used for testing purposes. Four more Ka-52 helicopters were delivered to the 44th Centre for Combat Training and Aircrew Conversion in December of 2010.\n\nThe Ka-52 entered service in May 2011 after completing all of the state trials; the first operational units received their Ka-52s in the same month. The first production contract was for 2 experimental Ka-52s and 24 serial Ka-52s by 2012. In 2011 the second contract was signed, worth 120 million rubles, for 146 Ka-52 helicopters by 2020. In February 2018, the Russian Defense Ministry expressed its desire to purchase 114 new Ka-52s for the State Armament Program for the years 2018–2027.\n\n'''Service'''\n\nThe first major operational usage of the Ka-52 ''Alligator'' was during the Russian military intervention in the Syrian Civil War (2015). They were claimed to be used in the defense of the Russian base in Latakia. They were also used to escort search and rescue helicopters and to support Russian special forces. They were spotted for the first time near the town of Al-Qaryatayn, which had been recaptured from ISIS in April 2016. They were also used in the 2017 Palmyra offensive. Ka-52s took part in a Syrian paratrooper reconnaissance-strike mission on 12 August 2017.\n\nAccording to some sources, a Ka-52 crashed near Mayadin due to a technical failure on 5 May 2018.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=ka_52 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|M9zfP6ndAUA|'''KA-52 - Above All Else''' - ''JustinPlaysYT''|_mhSXtNN9Ko|'''The Shooting Range #200''' - ''Metal Beasts'' section at 01:04 discusses the Ka-52.}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the helicopter;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Rotorcraft of comparable role, configuration and era\n\n* [[AH-64D]]\n* [[EC-665 Tiger UHT]]\n* [[Ka-50]]\n* [[AH Mk.1]]\n* [[EC-665 Tiger HAD]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wikipedia:Kamov_Ka-50#Ka-52_%22Alligator%22|[Wikipedia] Ka-52 \"Alligator\"]]\n* [https://www.airforce-technology.com/projects/ka52-alligator-attack-helicopter-russia/ <nowiki>[Air Force Technology]</nowiki> Ka-52 Alligator Attack Helicopter]\n* [https://www.naval-technology.com/projects/kamovka52alligatorhe/ <nowiki>[Naval Technology]</nowiki> Kamov Ka-52 Alligator Helicopter]\n* [http://www.military-today.com/helicopters/ka52_hokum_b.htm <nowiki>[Military-Today]</nowiki> Kamov Ka-52]\n* [https://www.militaryfactory.com/aircraft/detail.asp?aircraft_id=1333 <nowiki>[MilitaryFactory]</nowiki> Kamov Ka-52 Alligator (Hokum-B)]\n\n{{AirManufacturer Kamov}}\n{{USSR helicopters}}"}}