{"title":"Mi-24P (Germany)","pageid":3367,"wikitext":{"*":"{{About\n| about = attack helicopter '''{{PAGENAME}}'''\n| usage = other versions\n| link = Mi-24 (Family)\n}}\n{{Specs-Card\n|code=mi_24p_german\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the helicopter, as well as its key features. In the second part, tell the reader about the helicopter in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} German attack helicopter {{Battle-rating}}. It was introduced in [[Update 1.83 \"Masters of the Sea\"]].\n\nBeing the only Warsaw pact helicopter available to German pilots, the ▀Mi-24P shows a radical shift of doctrine when compared to NATO helicopters. Big, heavily armoured yet fast, and armed with lethal payload when compared to its West German contemporaries, one can see why Hinds were nicknamed \"Devil's Chariots\" during their deployment in Afghanistan.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Heli-Flight}}\n<!-- ''Describe how the helicopter behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nWith its large size and heavy armour for a helicopter, Hind can at times feel sluggish and slow to turn when compared to [[BO 105 (Family)|BO 105]] helicopters. That being said, it can also fly incredibly fast, being the fastest helicopter in the German tech tree.\n\nThe ▀Mi-24P can achieve a whooping speed of 335 km/h when flying at 50 m altitude, without any problems. Be aware that at this speed, Hind behaves more like a plane rather than helicopter; sharp turns using only mouse control can take ages and helping yourself with keyboard controls can cause loss of lift, leading to crash.\n\nBe aware that while you can exceed the ▀Mi-24P's listed maximal speed by as much as 30 km/h without problems, once you hit 370 km/h and above, your helicopter '''WILL''' flop to the right side. This is especially dangerous during low altitude flight as you won't have time to recover, even with experienced crew.\n\nAlso be aware that when hovering, the ▀Mi-24P is prone to '''vortex ring state''', a dangerous condition leading to loss of lift and eventually, crash. It is of utmost importance to start moving in any direction, thus gaining lift, as soon as a warning pops up on your screen, otherwise you risk severely damaging if not losing your helicopter.\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 1,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n|-\n! AB !! RB\n|-\n! Stock\n| 310 || 292 || rowspan=\"2\" | {{Specs|ceiling}}\n|-\n! Upgraded\n| 359 || 335\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Heli-Armour}}\n<!-- ''Examine the survivability of the helicopter. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical systems.'' -->\nWhile lacking some defensive features like titanium rotor blades and titanium tub around its crew, the ▀Mi-24P is well protected for its rank.\n\nRule of thumb is to keep your distance, fly low, and break line of sight whenever possible.\n\n'''Armour'''\n\nGreater the distance, the more useful your armour will be.\n\nCritical components such as engines and transmission are protected by 4 mm steel plates.\n\nCrew sits in an armoured tub consisting of 4 mm steel plates on sides. Gunner position is upgraded to 8 mm plates while pilot gets 4 mm steel plates in his seat. Both crew members get access to 55 mm armoured glass in front of their position.\n\nArmour layout can protect you comfortably from low calibre machine guns and at distance, from [[M2HB (12.7 mm)|.50 cals]] as those commonly used by NATO tanks.\n\nLarger calibres, such as those found on IFVs, can chew right through your armour, especially at close range.\n\nDedicated SPAAGs such as [[ZSU-23-4|Shilkas]] or [[ZPRK 2S6|Tunguskas]] can get through your armour with piercing rounds, though they need to hit critical components or crew directly. You can withstand a few hits of their explosive rounds and shrapnel, but do not expect to hover over them and survive.\n\nSAMs will almost always destroy most of your critical components in one hit, though you can sometimes survive smaller ones and make it back to the base.\n\n'''Avionics'''\n\nThe ▀Mi-24P is equipped with a plethora of technologies which increase your survivability dramatically.\n\nFirst, you have the option to install '''HIRSS''', Hover Infrared Suppressor System that allows your helicopter to reduce or almost eliminate all infrared radiation emitted by exhaust gases of its engines to the surroundings.\n\nSecond, you can install '''IRCM''', non-coherent flashlamps and infrared signal emitters that direct its energy towards incoming missiles in an attempt to blind the missile's infrared sensors and confuse its tracking. In-game, it also causes radar lock to \"wiggle\" all around your helicopter when viewed through enemy scope, increasing probability of miss.\n\nThird, you are equipped with '''RWR''', a radar warning receiver, from the get go. This piece of tech alerts you of active radars on the battlefield, be it ground or air based, and gives you warning when you get radar locked. It also lets you know the position of active radars relative to your helicopter and highlights which radar has locked you.\n\nLastly, you can equip a '''countermeasure launcher''' with a capacity of 192 of either flares, chaff or combination of both. Those are mounted right behind your wing pylons on the side of Hind. Flares work against IR tracking missiles, chaff works against both searching and tracking radar. Since there are currently only two AA vehicles in game equipped with IR SAMs (Japanese [[Type 93]] and Chinese [[PGZ04A]]), it is preferable to prioritize chaff over flares. This becomes more important with growing distance, since IR SAMs can't reach your maximum engagement range when you are using Shturms.\n\nThere is not one downside to having all of the above mentioned countermeasures, so keep all of them equipped, always.\n\nSadly, the ▀Mi-24P is not equipped with MAW, missile approach warning, so you do not get alerted by missiles incoming in your direction.\n\n'''Staying alive'''\n\nDepending on the situation and payload, your approach to survival is radically different. Rule of thumb is that it is almost always better to stay low to the ground in order to break line of sight and to stay below altitude where proximity fuze on SAMs activates ( usually 25m above ground), but this will be covered more in '''Usage in battles''' section.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Heli-Armaments}}\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | [[Ballistic Computer]]\n|-\n! CCIP (Guns) !! CCIP (Rockets) !! CCIP (Bombs)\n|-\n| {{Tick}} || {{Tick}} || {{Cross}}\n|-\n|}\n=== Offensive armament ===\n{{Specs-Heli-Offensive}}\n<!-- ''Describe the offensive armament of the helicopter, if any. Describe how effective the cannons and machine guns are in battle, also what ammunition belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|GSh-30-2K (30 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* A choice between four presets:\n** 2 x 30 mm GSh-30-2K cannons, cheek-mounted (125 rpg = 250 total)\n** 2 x 30 mm GSh-30-2K cannons + HIRSS\n** 2 x 30 mm GSh-30-2K cannons + HIRSS + 192 x countermeasures\n** 2 x 30 mm GSh-30-2K cannons + HIRSS + 192 x countermeasures + IRCM\n\nThe ▀Mi-24P is armed with a 30 mm GSh-30-2K cannon. It can shred any air target unfortunate enough to get in its range. With ground belts, it can make short work of any light vehicle or SPAAG, though main battle tanks will shrug your fire without any serious damage.\n\nOperator must be aware that the cannon has a high rate of fire and only 250 rounds available, so trigger discipline is a must.\n\nLast thing to note is that the cannon is fixed to the ▀Mi-24P's right side and thus can be only aimed by turning the entire helicopter. This can sometimes be a problem at close range due to Hind's sluggish controls, and helicopters with cannons that can turn independently will have an edge over you.\n\n=== Suspended armament ===\n{{Specs-Heli-Suspended}}\n<!-- ''Describe the helicopter's suspended armament: additional cannons under the winglets, any bombs, and rockets. Since any helicopter is essentially only a platform for suspended weaponry, this section is significant and deserves your special attention. If there is no suspended weaponry remove this subsection.'' -->\n{{main|OFAB-250sv (250 kg)|FAB-500M-54 (500 kg)}}\n{{main|9M114 Shturm|R-60|R-60MK|S-8KO|GSh-23L (23 mm)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 80 x S-8KO rockets\n* 4 x 250 kg OFAB-250sv bombs (1,000 kg total)\n* 2 x 500 kg FAB-500M-54 bombs (1,000 kg total)\n* 4 x 9M114 Shturm missiles\n* 4 x 9M114 Shturm missiles + 80 x S-8KO rockets\n* 4 x 23 mm GSh-23L cannons (250 rpg = 1,000 total)\n* 4 x 9M114 Shturm missiles + 4 x 23 mm GSh-23L cannons\n* 4 x 9M114 Shturm missiles + 4 x 250 kg OFAB-250sv bombs (1,000 kg total)\n* 4 x 9M114 Shturm missiles + 2 x 500 kg FAB-500M-54 bombs (1,000 kg total)\n* 4 x 9M114 Shturm missiles + 40 x S-8KO rockets + 2 x 23 mm GSh-23L cannons\n* 40 x S-8KO rockets + 2 x R-60 missiles\n* 40 x S-8KO rockets + 2 x R-60 missiles + 4 x 9M114 Shturm missiles\n* 40 x S-8KO rockets + 4 x R-60 missiles\n* 40 x S-8KO rockets + 4 x R-60 missiles + 4 x 9M114 Shturm missiles\n* 40 x S-8KO rockets + 2 x R-60MK missiles\n* 40 x S-8KO rockets + 2 x R-60MK missiles + 4 x 9M114 Shturm missiles\n* 40 x S-8KO rockets + 4 x R-60MK missiles\n* 40 x S-8KO rockets + 4 x R-60MK missiles + 4 x 9M114 Shturm missiles\n* 8 x 9M114 Shturm missiles\n* 8 x 9M114 Shturm missiles + 40 x S-8KO rockets\n* 8 x 9M114 Shturm missiles + 2 x 250 kg OFAB-250sv bombs (500 kg total)\n* 8 x 9M114 Shturm missiles + 2 x 500 kg FAB-500M-54 bombs (1,000 kg total)\n* 8 x 9M114 Shturm missiles + 2 x 23 mm GSh-23L cannons\n\nCompared to NATO helicopters in the German tech tree, the ▀Mi-24P has the ability to perfectly tailor its payload to any battlefield scenario it can encounter.\n\n'''GSh-23L cannon''' - The ▀Mi-24P is also able to equip gun pods containing 23 mm GSh-23L cannons. It is the same cannon as the one mounted in [[MiG-21 (Family)|MiG-21s]]. The ▀Mi-24P can equip up to 4 containers, each one containing 500 rounds of ammo. Sadly, you can't choose which belts to use.\n\n'''S-8KO rockets''' - Another viable weapon, S-8KO rockets come in pods of 20, each missile is able to penetrate up to 400 mm. They are also very vast, with a speed of 610 m/s. Unfortunately, they contain only 1.32 kg equivalent of TNT, so scoring direct hits is a must. Hind can load up to 4 pods at once, giving you 80 missiles to launch at enemies.\n\n'''R-60 AAM''' - Another weapon found on Soviet MiG-21s, the R-60 is a powerful missile that is able to pull 30Gs, meaning they are very difficult to dodge without use of flares. They do not have as strong warheads as Sidewinders, but it is enough to severely cripple bigger planes and outright destroy smaller ones. Be aware as they can only achieve lock-on rear-aspect at maximum distance of 5 km, meaning you need to fire them at planes and helicopters from behind. Seeing that you also have the ability to equip upgraded version, there are not many scenarios where you would take these instead of upgraded ones. You can equip up to 4 of them.\n\n'''R-60MK AAM''' - Direct upgrade to R-60, these are almost identical to the base version, but with slightly bigger warhead and ability to lock onto enemy planes and helicopters from any aspect at a distance of 2 km (on top of 5 km range in rear-aspect). You can equip up to 4 of them.\n\n'''OFAB-250sv bombs''' - Another weapon more commonly found on planes, the ▀Mi-24P can equip up to 1,000 kg of OFAB-250 bombs. These are dropped individually, thus in theory allowing the pilot to score 4 kills at least. Sadly, reality is different - as your ballistic computer lacks computing power to understand the sheer madness of mounting bombs on a helicopter, it is thus unable to provide aiming reticle for your bombs (as modern planes do). Your only hope of precisely dropping these is to attack in a manner similar to [[Ju 87 B-2|Stuka]] planes. While the thought of the ▀Mi-24P dive bombing Abrams tanks certainly is funny, it is far from practical, given the setting in which helicopters operate.\n\n'''FAB-500M-54 bomb''' - Same story as above, except the ▀Mi-24P can only equip two of them. On the other hand, their explosive mass is higher, thus you do not need to be as precise as when dropping 250 kg bombs.\n\n'''9M114 Shturm missile''' - Your weapon of choice when engaging enemy armour. Precursor of the [[9M120 Ataka]] missile, Shturms are fast, capable of reaching speeds of 400 m/s (only slightly slower than Hellfires). They are able to penetrate only 560 mm of armour at max and are not equipped with tandem warheads, making them weaker against composite and reactive armour, which are common at its BR. That being said, you can load up to 8 of them, which is one of the highest numbers of ATGMs any German helicopter can carry. They have a range of 5 km, which is enough to comfortably sit outside of SPAAGs cannon range.\n\nThe ▀Mi-24P is armed only with a night vision device, severely limiting its ability to acquire targets at longer ranges. Night vision devices are only available to pilot and gunner when using 3rd person and cockpit view - your ATGM sight does not get any, thus crippling your effectiveness in long range engagements at night.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in a helicopter, the features of using the helicopter in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe ▀Mi-24P (and most helicopters for that matter) usually adopts tactics of either helicopter rush or sniping with ATGMs.\n\nThe longer match goes on, the higher the chances of enemy AA appearing. This means your chance to successfully employ helicopter rush tactic gets lower as the match drags on, thus making helicopter rush viable only in the early game.\n\nFrom mid to late game, you might want to go with tactic of sniping with Shturm ATGMs, picking off targets from maximum possible distance.\n\nUsing helicopter ATGMs is always a struggle between staying low, thus surviving longer, and climbing higher, thus getting a view on the battlefield unobstructed by buildings, hills, and trees.\n\n'''If you decided to go with helicopter rush:'''\n\n'''Recommended loadout: 80 x S-8KO rockets, ground belt for your cannon'''\n\nWhile you can equip 4 x 250kg of bombs instead of rockets, delivering those precisely is difficult due to lack of aiming reticle. Your ballistic computer is also unable to provide a firing solution, leaving you guessing more than aiming.\n\nS-8KO rockets present much more precise and overall better choice of armament for this strategy.\n\nSince your rockets are launched in pairs, aim for the roof armour on the back of the turret when approaching from side or slightly off the center if approaching from front or back. This will allow one of your rockets to score direct hit onto critical components of enemy tanks.\n\n'''Tactics:'''\n\nLet's get this out of the way first - helicopter rush tactic '''is a gamble''', since it can lead to either great success (destroying several tanks from the enemy team for the price of one helicopter) or catastrophic failure (getting slapped by [[ADATS]] halfway to the combat zone), depending on whenever the enemy team has active AA at the start of the match.\n\nThankfully, the ▀Mi-24P, thanks to its ballistic computer, speed, and armour can helicopter rush at the start of the round well. Be aware that it is more often than not a one way trip, since opponents will likely spawn dedicated AA after getting killed by rushing helicopter and '''will''' delete you from sky. Sometimes, you won't even get a chance to do that - some players anticipate helicopter rushes and start a game in AA vehicles, thus probably shutting down your helicopter even before it can do any damage.\n\nThat being said, when helicopter rushing at the start of the round, you need to approach the battlefield as low as possible, in order to avoid enemy radar and break line of sight by putting terrain, trees and structures between you and the enemy. Select heliport spawn closer to the battlefield, and start approaching either spawn or capture point; those have the highest chance of enemies being concentrated there.\n\nTry to gain as much speed as possible before reaching your destination.\n\nOnce nearing 1 km distance from your objective, pull up and convert speed into attitude. While this will put you in the killzone of most dedicated AA vehicles in game, chances of those being active at the start of the match are low. You will also position yourself outside of most weapons carried by main battle tanks and IFVs - tank guns and most machine guns can't elevate high enough to effectively target you, keeping you out of harm's way. This will also allow you to easily target roof armour of enemy vehicles, which is usually thin and not protected by ERA, allowing your unguided rockets to slice right through.\n\nAs you climb, use your RWR to determine whenever the enemy team has AA or not - if you get pings from RWR, try to find and dispatch enemy AA before it can fire at you - this will allow you to stay alive for a little longer. Only then should you switch your attention to enemy tanks.\n\nOne last thing to note is that you '''will be heard before seen''', as helicopters are usually very loud, and some skilled players can anticipate your direction from sound alone and can counter you as soon as you appear above horizon - tanks like [[M1A2 Abrams|M1A2]] are equipped with proximity fuze HEAT-FS shells designed to take down low-flying helicopters, and most IFVs can elevate their guns high enough to engage you when you first emerge from behind the horizon. Thus gaining altitude is vital to success when helicopter rushing.\n\n'''If you decided to go with sniping with Shturms:'''\n\n'''Recommended loadout:'''\n\nIf there are '''no enemy planes active''' on the battlefield, pick loadout with the maximum number of Shturms ATGMs possible - these are your best choice at dispatching armoured targets.\n\nIf there '''are enemy planes active''', pick loadout with R-60M missiles, those help you with clearing the airspace of any threats to your helicopter.\n\nYou can also pick secondary armament to go with your Shturms - either GSh-23L gun pods or S-8KO rocket pods.\n\n'''GSh-23L''' cannon pods help you defend yourself at close range from air targets.\n\n'''S-8KO''' rocket pods are not used in the conventional role of attacking ground targets in this loadout - instead, you use them defensively, to prematurely activate proximity fuze on enemy AA missiles. Simply fire a salvo in the way of an incoming missile and it should trigger. This is of utmost importance as skilled players will guide SAMs to your position manually, without use of radar, making traditional countermeasures useless.\n\n'''Tactics:'''\n\nApproach battlefield flying at low altitude, keep distance of 5 km (maximum range of your ATGMs). Bleed speed and start hovering. Finding any cover to hover behind and to break line of sight tremendously helps your survival - even trees can become your best friend.\n\nPop above the cover for a few seconds, launch a missile or two, then go back. Change position, rinse and repeat.\n\nCheck your RWR regularly in order to spot any active radars, be it airborne or ground based. Note that lack of active radar ping does not guarantee that the enemy team has no AA spawned - skilled players often turn off their radars in order to lure helicopters out of cover and guide their SAMs manually to you.\n\nStay around an altitude of 25 m when not engaging enemy tanks. You won't get detected by radar in most cases and proximity fuze of SAMs is disabled below 25 m. If you are higher and you detect incoming SAM, deploy countermeasures and try to duck below 25 m as fast as possible. Be aware that direct hit can and will obliterate you, but those are harder to pull off when dodging.\n\nStaying in one place not only helps the enemy team to locate you sooner, but some tanks with laser range finders might able to shoot you down with tank guns at a range of several kilometres, since you present almost static target.\n\nShturms have mediocre penetration when compared to some high-end missiles and may find themselves unable to defeat modern composite or reactive armour, which are getting common at the ▀Mi-24P's BR. While destroying light tanks and SPAAGs and many older main battle tanks frontally is doable, your ATGMs simply don't have enough penetration to go through [[Challenger 2]]'s turret cheeks or [[T-72B3]]'s Relikt reactive armour for example.\n\nThat being said, that does not mean you cannot destroy those enemies. You just need to be smart about deploying your Shturms.\n\nYou should avoid engaging enemy tanks from the frontal arc. More often than not, a tank's strongest armour is its turret face and frontal plate on the hull. For example, Leopard 2A5s turret front is able to resist chemical munitions with penetration of up to 1300 mm. On top of that, enemies can spot incoming missiles aimed at them when they are coming from the front, allowing them to take defensive measures, such as moving behind cover or deploying smoke grenades.\n\nInstead, exploit Hind's high speed to get on flanks and hit enemy tanks from the side. Even with reactive armour, a well aimed hit below the turret of T-90A can detonate its ammo carousel and destroy it in one hit. While most players do check their corners and flanks, they usually wont spot missile coming from an elevated position until it's too late.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Has R-60M all-aspect missiles that are very effective against most aircraft\n* Durable airframe against small calibre rounds\n* Competitive speed for a helicopter\n* Has AAMs and ATGMs together in a loadout\n* Ability to equip 8 x Shturm missiles at once\n* 30 mm can be deadly against air targets\n\n'''Cons:'''\n\n* ATGMs are have quite low penetration\n* Handles sluggishly at most speeds\n* Quite big and easy to spot\n* No thermal sights, only infrared night vision\n\n== History ==\n''Describe the history of the creation and combat usage of the helicopter in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).''\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=mi_24p_german Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|lTR8bhL4BUc|'''The Mi-24 Family''' discusses the {{PAGENAME}} at 5:56 - ''War Thunder Official Channel''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the helicopter;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Other Mi-24P variants\n* [[Mi-24P HFS 80 (Germany)]]\n* [[Mi-24P]]\n\n== External links ==\n''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''\n\n{{AirManufacturer Mil}}\n{{Germany helicopters}}"}}