{"title":"UH-1C XM-30","pageid":3371,"wikitext":{"*":"{{About\n| about = premium American utility helicopter '''{{PAGENAME}}'''\n| usage = other versions\n| link = UH-1 (Family)\n}}\n{{Specs-Card\n|code=uh_1c_xm_30\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the helicopter, as well as its key features. In the second part, tell the reader about the helicopter in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} American utility helicopter {{Battle-rating}}. It was introduced as a [[wt:en/news/5712-shop-pre-order-bundles-and-packs-for-major-update-1-81-en|premium pack]] in [[Update 1.81 \"The Valkyries\"]] and was removed from sale after the [[wt:en/news/6542-shop-the-new-year-sale-en|2019 New Year Sale]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Heli-Flight}}\n<!-- ''Describe how the helicopter behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 0 m - at sea level)\n! rowspan=\"2\" | Max altitude<br>(metres)\n|-\n! AB !! RB\n|-\n! Stock\n| 203 || 196 || rowspan=\"2\" | {{Specs|ceiling}}\n|-\n! Upgraded\n| 230 || 217\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Heli-Armour}}\n''Examine the survivability of the helicopter. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical systems.''\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Heli-Armaments}}\n=== Offensive armament ===\n{{Specs-Heli-Offensive}}\n<!-- ''Describe the offensive armament of the helicopter, if any. Describe how effective the cannons and machine guns are in battle, also what ammunition belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M129 (40 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* A choice between two presets:\n** Without offensive armament\n** 1 x 40 mm M129 cannon (150 rpg)\n\n=== Suspended armament ===\n{{Specs-Heli-Suspended}}\n<!-- ''Describe the helicopter's suspended armament: additional cannons under the winglets, any bombs, and rockets. Since any helicopter is essentially only a platform for suspended weaponry, this section is significant and deserves your special attention. If there is no suspended weaponry remove this subsection.'' -->\n{{main|BGM-71C Improved TOW|FFAR Mighty Mouse|XM140 (30 mm)|M134 Minigun (7.62 mm)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* 2 x 30 mm XM140 cannons (600 rpg = 1,200 total)\n* 38 x FFAR Mighty Mouse rockets\n* 6 x BGM-71C Improved TOW missiles\n* 2 x 7.62 mm M134 Minigun machine guns (1,500 rpg = 3,000 total)\n* 76 x FFAR Mighty Mouse rockets\n* 2 x 7.62 mm M134 Minigun machine guns (6,000 rpg = 12,000 total) + 38 x FFAR Mighty Mouse rockets\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in a helicopter, the features of using the helicopter in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\n====Air to Air====\nThe UH-1C XM-30 is a utility helicopter, therefore not built for speed, protection, and manoeuvrability. Using its AGM-22 or the BGM-71 TOW missiles, it excels at long & medium range engagements. Additionally the XM-30 has a 40 mm grenade launcher installed in its nose, the grenade launcher is a perfect weapon for knocking out enemy helicopters at close range.\n\nThe typical tactic of the AH-1G where the pilot doesn't have access to ATGMs leaves them no choice but to go directly near or behind the front line will prove hard for the UH-1, since the UH-1C XM-30 is not manoeuvrable and fast enough to do it, but if the pilot hasn't unlocked the ATGMs yet, the pilot doesn't have a choice but to temporarily bring back the AH-1G tactics until the ATGMs are unlocked.\n\n\n====Air to Ground====\n\nWhen using the ATGMs, it is better to be more than 1 kilometre away from the target to avoid machine gun fire, especially from tanks armed with 12.7 mm guns, and also try to be hidden in a place where you can look, shoot-through then hide again as modern MBTs are capable of helicopter engagements such as the Soviet/Russian tanks that are armed with ATGMs that are designed to shoot down helicopters of all kinds efficiently and with precision. Keep in mind that the UH-1Cs AGMs have very limited range yet 3 km is an already decent range, but below average.\n\nThe faster and powerful BGM-71 I-TOW takes less than 7 seconds to destroy a target 3 km away. SPAAGs that are only armed with 20 to 40 mm automatic cannons and target-tracking modules will also have a hard time targeting you from 2 to 3 km.\nWhen performing evasive manoeuvres, most SPAAGs are also hull breakable from the turret and can be targeted safely from 2.5 to 3 km away if it hasn't detected you on radar or visual range.\n\nHowever, dealing with air to surface missile SPAA vehicles will lock onto you, the {{PAGENAME}} has no countermeasures, no flares. In-order to evade a missile, nose over, and use surface objects to your advantage.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Relatively fast and nimble (not heavy to handle)\n* XM-30 version has decent zoomed-in optics\n* Powerful 30 mm cannons useful in air combat\n\n'''Cons:'''\n\n* No armour protection\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the helicopter in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe United States Army identified in 1952 a need for a new general utility helicopter which could also serve as medical evacuation (MEDEVAC) and instrument training helicopter too.  The current inventory of helicopters had several flaws which the Army wanted to overcome including being too large, underpowered or extremely complex to maintain.  The Army wanted a workhorse that was easy to maintain and have a fairly small profile. Twenty companies participated in the bidding process and in 1955, Bell Helicopter was selected to build three copies of the Model 204 for evaluation, and this version was designated XH-40 (Experimental Helicopter-40).\n\nThe XH-40 was built with the Lycoming YT52-L-1 (LTC1B-1) turbo engine helicopter, the first non-piston helicopter tested by the military and first flew in 1956.  Even before the prototype had flown, the Army put in an order for six YH-40 service test aircraft in which they could field test to determine how it would work under military unit operations. Proving successful, Bell was awarded a contract to build another 100 helicopters which were designated HU-1A (Helicopter Utility-1A) and hence was officially named ''Iroquois''. Iroquois ended up being a mouthful for people to say, so a nickname developed from the HU-1 designation which ended up being pronounced as ''Huey'' and stuck.  In September 1962, the Department of Defense changed up the aircraft identification system to streamline between all of the different aircraft and their variations and changed the HU-1 to UH-1 (Utility Helicopter-1). Even with the change, the official Army name and the new DOD designation was rarely used as Huey was so well recognised as the name, that is what was to most people.\n\nUnfortunately, with all of the positive feedback received for the YH-40, service tests performed by the Army found the T53-L-1A engine was found to be underpowered and could not perform to the level that was needed.  Bell proposed to swap the T53-L-1A engine with the T53-L-5 engine, upping the shaft horsepower from 770 to 960 (570 kW to 720 kW) and extended the cabin to accommodate more people, up to 7 passengers or four stretchers and a medical attendant.  The first production of the new helicopter UH-1B was delivered for service in 1961.\n\nSeveral aerodynamic deficiencies of an armed UH-1B was explicitly identified not having enough engine power to lift the necessary weapons systems.  The UH-1C was developed to overcome these problems by upgrading the helicopter with the T53-L-11 engine which had 1,100 shaft horsepower or 820 kW.  The UH-1B helicopters which were in the service of the Army at the time were also upgraded with the new engine.  Several adjustments were made to the UH-1C which included a new rotor-system, however, like many things which are upgraded, domino effect also requires other components and modules also to be updated.  A larger diameter rotor was installed to counter blade stall during dives which required the tail boom to be extended and larger synchronized elevators to be added. While operating in military operations, it was determined necessary to add a redundant hydraulic control system to allow for continued operation in the event of a failure in one system.  Larger fuel tanks allowed for further range with the total useful load capacity topping out at 4,673 lbs (2,120 kg). Mid-1966 saw the line production of the fully upgraded UH-1C helicopter.\n\nHuey model 204 helicopters were a huge success and were put to use in several different capacities. However, the Army wanted another version which facilitated the carrying of more troops which spawned the Model 205.  Bell adjusted by extending the UH-1B's fuselage by a total of 41 in (104 cm), boxed in the transmission and was able to add four more seats, two on each side of the transmission box facing out the side doors.  With the side doors being easily removable, options to fly without doors made for quick loading and unloading of the helicopter which could now accommodate 15 persons, including the crew and could now hold six stretchers and a medic. First flown in 1961, the 205 took on many of the same upgrades as the UH-1C including the T53-L-11 which enabled usage of multiple types of fuel.  Prototypes of this helicopter were designated YUH-1D, and the final assembly line aircraft was called the UH-1D.\n\nThis helicopter while still under evaluation the Army sent it to Vietnam in 1962 where it began operations.  Initially only required as a general utility, MEDEVAC, and an instrument trainer, this helicopters role also expanded to include but not limited to air assault, cargo transport, search and rescue, electronic warfare and eventually ground attack.\n\nDuring the Vietnam War, the UH-1 earned several other nicknames other than \"Huey\" which quickly identified to troops what role the helicopter had been outfitted for.  Gunship versions of the UH-1s were identified as ''Frogs'' or ''Hogs'' if they carried rockets while if they just carried guns, they were identified as ''Cobras''.  Troop transport versions were called ''Slicks'' due to weapon pods being absent on the external pylons while they did retain their door gunners.  Later in the war from 1967 to 1968, the gunship Huey's were replaced by the new [[AH-1G|AH-1]] attack helicopters.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=uh_1c_xm_30 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|6QZAY1EtkFU|'''The Shooting Range #110''' - ''Pages of History'' section at 01:01 discusses the UH-1 Huey.|AThOHUXhcsI|'''The Shooting Range #114''' - ''War Machines'' section at 04:11 discusses the UH-1C XM-30.}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the helicopter;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/5707-gamescom-combat-helicopters-in-war-thunder-en|[Gamescon Combat helicopters in War Thunder]]\n* [[wt:en/news/5708-development-uh-1-and-mi-4-early-birds-en|[Devblog UH-1 and Mi-4: Early Birds]]\n\n{{AirManufacturer Bell}}\n{{USA helicopters}}"}}