{"title":"A-26C-45DT","pageid":194,"wikitext":{"*":"{{About\n| about = American bomber '''{{PAGENAME}}'''\n| usage = other versions\n| link = A-26 (Family)\n}}\n{{Specs-Card\n|code=a-26c-45-dt\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} American bomber {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27. It is exclusively available on PS4 and can be obtained by purchasing a special pack.\n\nWith speed, manoeuvrability and large hitting power, the A-26 should not be taken lightly. Although players may find the battle rating too high, this isn't the case- in fact, it may be about right. The plane has a cruise speed which all the piston engine bombers dream of and is currently unmatched in the game. Reaching a maximum speed of 568.8 kph the Invader is faster than the comparable Tu-2 by a significant 202 kph. This speed allows the A-26 to strike targets deep in enemy territory and early on better than any other aircraft (excluding the jet aircraft). It also has a 4,000 lb payload with a variety of load-out options, making it very versatile in its role, allowing it to attack many different targets with great efficiency. To add to this, it has 8 x Browning M2 .50 cal machine guns to attack soft targets and the unfortunate jet if you have the chance. Unlike the Mosquito, the A-26 has defensive gunner turrets and decent ones at that. With two twin M2 machine gun remote turrets it allows for the very accurate and deadly fire.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,573 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 536 || 523 || rowspan=\"2\" | {{Specs|ceiling}} || 29.3 || 30.3 || 7.8 || 7.8 || rowspan=\"2\" | 700\n|-\n! Upgraded\n| 607 || 569 || 27.0 || 28.0 || 19.7 || 11.4\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 507 || 482 || 351 || ~7 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 390 || < 375 || < 460 || > 350\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 457 m || 4,000 hp || 4,740 hp\n|-\n! colspan=\"3\" | Setting 2\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 3,114 m || 3,200 hp || 3,792 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.''\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M2 Browning (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 12.7 mm M2 Browning machine guns, nose-mounted (400 rpg = 800 total)\n* 6 x 12.7 mm M2 Browning machine guns, wing-mounted (300 rpg = 1,800 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|AN-M30A1 (100 lb)|AN-M64A1 (500 lb)|AN-M65A1 (1,000 lb)|AN-M66A2 (2,000 lb)|HVAR}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* 14 x HVAR rockets\n* 20 x 100 lb AN-M30A1 bombs (2,000 lb total)\n* 10 x 500 lb AN-M64A1 bombs (5,000 lb total)\n* 4 x 1,000 lb AN-M65A1 bombs (4,000 lb total)\n* 2 x 2,000 lb AN-M66A2 bombs (4,000 lb total)\n\n=== Defensive armament ===\n{{Specs-Avia-Defensive}}\n<!-- ''Defensive armament with turret machine guns or cannons, crewed by gunners. Examine the number of gunners and what belts or drums are better to use. If defensive weaponry is not available, remove this subsection.'' -->\n{{main|M2 Browning (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is defended by:\n\n* 2 x 12.7 mm M2 Browning machine guns, dorsal turret (500 rpg = 1,000 total)\n* 2 x 12.7 mm M2 Browning machine guns, ventral turret (500 rpg = 1,000 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nUse the A-26 to deliver fast tactic based strikes. In the first minutes of the game plan your route and decide on your key targets, the basics you want to include are:\n\n* Focus on large amounts of heavy/ medium targets\n* Stay away from the main dogfights\n* Follow paths that don't cross the normal enemy climb routes\n* Utilize terrain as cover wherever possible\n\nThe best targets to choose are the \"heavy\" or \"medium\" targets at the far sides of the map or away from the main routes taken by the enemy. This is because they have a distinctive effect on the battle but also give large rewards post-game allowing for quick research/ progression with the advantage of you being to strike more targets before the fighters arrive. On your approach you want to the air spawn to gain speed in a dive then stay low. By staying low you take advantage of the spotting system at you become harder to spot and gain a marker (because if you do, your 60% dead). It also allows you to be masked by the terrain.\n\nThe payloads allow for attacks against many targets with great efficiency. Each bomb load has its preferred target type to create the most damage which is noted as follows:\n\n* 8 x 500 lb - Best for attacking medium to heavy ground targets, destroy the easier, stationary, pillboxes where possible over tanks\n* 4 x 1,000 lb - Best for anti-shipping, specifically cruisers and battleships (Carriers are too armoured* and destroyers or Cargo ships would be overkill, note this only applies to AI ships)\n* 2 x 2,000 lb - Best for carriers and bombing points. Overall best payload for Naval battles and PVP Air vs Ship kills\n\nThe stock payload is 20 x 100 lb bombs. To make use of these, drop 2-3 bombs at a time on a medium armoured target however move onto the higher payloads when possible. A tip for bombing in the A-26 is to release half a second before the crosshairs move over the target. This is to compensate for the bomb doors opening then the bombs being released. However, you can also use these to hit soft targets if you so want to.\n\nIn Naval battles, the A-26 is very adaptable to any situation that may arise and can perform low, medium, and high level bombing. With the 2,000 lb bombs, almost all large ships, except for a few battleships, will be destroy with the 2 x 2,000 lb bombs. \n\nCarriers can be knocked out however accuracy is needed. Firstly take note of there the island is (the tower) while from a safe distance. Then manoeuvre in to a path that will be adjacent to the carrier and with the island facing you. Release two 1,000 lb bombs into the island and it should destroy the carrier.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Auto control available || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent rate of climb for a plane its size\n* Wing mounted .50 cal machine guns allow for strafing of soft ground targets\n* Capable of outrunning some enemy aircraft at sea level\n* Decent at low, medium, and high level bombing\n* Exceptional performance in Naval battles with direct hits of 2000 lb bombs usually able to destroy almost all ships at BR level\n* Payload efficient (max 4,000 lbs) to deal with most objectives\n\n'''Cons:'''\n\n* Gunner vulnerable to getting knocked out\n* The wing mounted guns make it hard to hit anything outside your convergence zone\n* Difficult to manoeuvre at high speeds\n* Low service ceiling makes high altitude bombing discouraging\n* Weak rudder control\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nIn the mid 1930s, Douglas Aircraft analysed contemporaries like the Do 17 and Blenheim, making them gamble on a fast, versatile, and manoeuvrable bomber. The resulting world leading DB-7, A-20 attacker/bomber paid off in immediate orders from France and England if not initially from USA. A great start, the pace of aircraft innovation only accelerated and Douglas knew its world leading design would soon be outdated. Work began on a new design.\n\nMaster engineer Edward Heinemann reassembled a team of Robert Donovan and Ted R. Smith from the A-20 program. Most important was aerodynamicist Apollo M.O. Smith who chose the innovative NACA 65-215 laminar flow airfoil that promised better top speed. Laminar Flow was still a radical technology at the time, the yet unproven Mustang Mk 1 was the only production aircraft using the technology. To make this high speed wing also fly slowly for safe landing, a double-slotted flaps system was created, the first production aircraft to use what is now common in all modern jet liners. The wing also had a relatively high aspect ratio for long range performance.\n\nDesign features from the breakthrough A-20 design were carried into the A-26. It is easy to spot the family resemblance of the nose gear, high wing, straight fuselage, and dihedral wing and tail. The easily replaceable nose unit, either a solid nose unit or the glass bombardier's unit, was also carried over, the latter used a Norden M-9 bombsight. The engines were also upgraded to the much more powerful Pratt & Whitney R-2800-27 Double Wasp fourteen-cylinder, double-row, radial air-cooled engines. Armaments were now standardized as the Colt-Browning AN/M2 .50 cal machine guns offensively mounted in all versions' noses. All models had space in wing for ammo belts feeding up to four dual gun pods mounted underneath the wing. Versatility was a key point and many other armament options were made, including large cannons and wing-mounted bombs and rockets. A-26's could even carry two torpedoes, however there is no evidence it was ever used operationally. Another key feature was the General Electric remote control turret top and bottom of the attacker, both controlled by a single crewman using a periscope sighting system (a year ahead of a similar system created by the Germans).\n\nThe ХА-26 prototype made its first flight on July 10, 1942. Mass production began in September 1943. Parallel production lines started in Douglas, Long Beach (code DL) making the solid nose A-26B, and Douglas, Tulsa (code DT) making the bombardier nose A-26C (but both could be easily swapped in less than an hour). A total of 2,503 were built.\n\nWhile praised by the pilots at home, its first trial by fire in May 1944 over New Guinea was less enthusiastic mainly due to limited downward view and other issues soured the Pacific crews. Less than 4 months later, missions in Europe received a completely different response where as a low altitude level bomber it excelled at its operation and easily countered defending Luftwaffe with strong defences or high speed. Over this time, upgrades to the design came about, including a new canopy that improved pilot view with the А-26C-30-DT, and integrating six .50 machine guns into the wings starting with the А-26B-50-DL and А-26C-55-DT.\n\nAfter WW2 ended only the A-26 was kept in active service, its performance securing its usefulness, but the designation changed to B-26 (causing confusion with the name of the retired B-26 Marauder). When the Korean war started in 1950 the underappreciated attacker suddenly became vital again, heavily employed in day and night attacks against North Korean forces. Conflict did not end with Korea, so the B-26 was now needed elsewhere, but quirk of political nuance forced the name back to the original A-26 so they could be sold to Thailand.\n\nIn short, with continuing conflicts and numerous upgrades the A-26 was actively used decades after it first flew, with the last known military mission in 1977.\n\nIt was not done with \"combat\" missions then; however, being actively used to fight wildfires that ravaged parts of the US, Canada, and Australia, immortalized by the 1989 film \"Always\".\n\nThe camouflage and markings are similar to the one worn by the 17th Bomber Wing squadrons in 1953 (which was under other OrBat before then).  It is painted gloss black for night missions, with a large \"USAF\" and red striped roundel proclaim the independence of the USAF from the Army, which happened in 1947.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=a-26c-45-dt Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n; Video\n{{Youtube-gallery|E1IDVFUqzrI|'''The Shooting Range #83''' - ''Pages of History'' section at 10:27 discusses the Douglas A-26 Invader.}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n* Douglas [[A-20G-25|A-20]] Havoc\n\n;Aircraft of comparable role, configuration and era\n* Bristol [[Brigand B 1|Brigand]]\n* Junkers [[Ju 288 C|Ju 288]]\n* North American [[B-25 (Family)|B-25]] Mitchell\n* Tupolev [[Tu-2 (Family)|Tu-2]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/3230--en|[Vehicle Profile] Douglas A-26C]]\n* [https://forum.warthunder.com/index.php?/topic/303473-douglas-a-26c-45/ Official data sheet - more details about the performance]\n* [http://forum.warthunder.com/index.php?/topic/13672-a-26c-45-invader-official-thread/ [Forum<nowiki>]</nowiki> A-26C-45 Invader - Official Thread]\n\n{{AirManufacturer Douglas}}\n{{USA bombers}}\n{{USA premium aircraft}}"}}