{"title":"A29B","pageid":8980,"wikitext":{"*":"{{About\n| about = Swedish jet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = J29 (Family)\n}}\n{{Specs-Card\n|code=saab_j29b\n|images={{Specs-Card-Image|GarageImage_J_A29B.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Swedish jet fighter {{Battle-rating}}. It was introduced in [[Update 1.95 \"Northern Wind\"]].\n\nThe {{PAGENAME}} was fitted with internal deflatable fuel tanks that give this fighter more flexible fuel options when compared to the [[J29A]], this variant also gets suspended armament in the form of unguided rockets\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 0 m - sea level)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 993 || 962 || rowspan=\"2\" | {{Specs|ceiling}} || 30.4 || 31.2 || 19.5 || 18.3 || rowspan=\"2\" | 800\n|-\n! Upgraded\n| 1,027 || 1,015 || 28.8 || 29.0 || 31.1 || 25.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| ✓ || ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 800 || 575 || 350 || ~11 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 650 || < 640 || < 450 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"5\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | {{Annotation|Basic mass|Mass of the aircraft with pilot and engine oil, but no fuel or weapons load}} || colspan=\"3\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | Svenska Flygmotor RM2 || 1\n| colspan=\"2\" | 5,057 kg || colspan=\"3\" | 288 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"4\" | Mass with fuel (no weapons load) || rowspan=\"2\" | Max Takeoff<br>Weight\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 10m fuel || 20m fuel || 30m fuel || 33m fuel\n|-\n| 1,150 kg || colspan=\"2\" | Centrifugal-flow turbojet\n| 5,573 kg || 6,089 kg || 6,605 kg || 6,777 kg || 7,080 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB/SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"5\" | Thrust to weight ratio @ 0 m (100%)\n|-\n! Condition || 100% || WEP\n! 10m fuel || 20m fuel || 30m fuel || 33m fuel || MTOW\n|-\n| ''Stationary'' || 2,150 kgf || N/A\n| 0.39 || 0.35 || 0.33 || 0.32 || 0.30\n|-\n| ''Optimal'' || 2,150 kgf<br>(0 km/h) || N/A\n| 0.39 || 0.35 || 0.33 || 0.32 || 0.30\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->[[File:A29B armour.png|thumb|Armour layout for the A29B]]\n\n; Armour\n\n* 64 mm bulletproof canopy windscreen\n* 10 mm steel plate behind pilot's seat\n* 10 mm steel plate in the nose, in front of pilot\n\nThe stout little {{PAGENAME}} is a sneaky little fighter which might be underestimated during a head-on. A 64 mm bulletproof windscreen is in place, which, since it is sloped, provides 165 mm total protection, allowing the pilot to have a greater chance of survival in a head-on. However, unless highly experienced, pilots should avoid head-ons, especially against aircraft such as the [[Super Mystere B2]] and the [[G.91 YS]] which also feature 30 mm DEFA 552 cannons. Make sure to avoid the B2 as well, as the AA.20 air-to-air guided rockets will make the {{PAGENAME}} have a hard time standing up to this aircraft.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Akan m/47C (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 4 x 20 mm akan m/47C cannons, chin-mounted (180 rpg = 720 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|srak m/55 Frida|psrak m/49A|srak m/51|hprak m/49}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 24 x 7,5 cm srak m/55 Frida rockets\n* 14 x 14,5 cm psrak m/49A rockets\n* 14 x 15 cm srak m/51 rockets\n* 4 x 18 cm hprak m/49 rockets\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe {{PAGENAME}} is armed with 4 x 20 mm Akan m/47C cannons, but still lack a bit of a punch for a fighter. The {{PAGENAME}} has a good top speed but its acceleration is not the quickest. Once it has built up speed it can catch most enemy jets that it will face, but having an altitude advantage to dive on the target will help get that extra acceleration to hunt down targets.\n\nTurning with the {{PAGENAME}} is a bad idea since the plane bleeds speed when turning. Even though the {{PAGENAME}} is good at turning, it can only do so for a small amount of time, before losing enough speed to be easy target for incoming enemies. The {{PAGENAME}}'s strengths are the Hit & Run tactic also known as Boom & Run. Should the {{PAGENAME}} be uptiered against 8.7, it will struggle to keep up with the enemy jets but that will make the {{PAGENAME}} an excellent support fighter: when Allied jets are engaged in combat with the enemy and make that enemy bleed its speed, the {{PAGENAME}} can swoop in and help the teammate.\n\nWhen taking off with ordnance in RB and Sim modes you must be careful, the {{PAGENAME}} struggles to get off the runway; spooling, pressuring your front landing gear right before you engage flaps, and using flaps are all essential for a safe takeoff in this plane.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* High speed in a straight line.\n* Powerful cannons with decent ammunition pool and access to very good AA belts.\n* Good ordnance selection for ground attack.\n* Effective airbrake and flaps.\n* Great turning ability at speed.\n* Good roll rate.\n* High quantity of rockets which launch individually.\n\n'''Cons:'''\n\n* Slow acceleration.\n* Slow climb rate.\n* Relatively large target in Ground Battles for SPAA.\n* Struggles to get off the runway with some loads.\n* Extremely sluggish turning capability at low speed. Will dump speed when turning also.\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n=== Initial development ===\nDuring WWII, Sweden had effectively fallen behind in the development of military aircraft. This was largely due to a severely underdeveloped aircraft engine industry in Sweden which meant that there were no high-end engines available for aircraft production. Thus Sweden was still projecting propeller-driven fighter aircraft in 1945 equivalent to fighters projected by other nations 1-3 years prior. Since it was obvious by 1945 that jet aircraft was the future the Swedish Air Force decided to immediately scrap all propeller-driven fighter projects and instead make the jump to a jet fighter. Sweden's leading aeronautical firm SAAB, who was already actively working with the Swedish Air Force on the previously mentioned propeller fighters, was tasked with projecting this new jet fighter. Several designs were looked at but by mid-1945 it was decided that a mid-high wing aircraft with a central air intake would be the best option. Due to the mid-high wing it was not possible to house the landing gear in the wings. Instead, it was decided to house the landing gear in the fuselage of the aircraft. This concept got the project name R1001, R standing for \"reaktionsmotor\" (reaction engine), the Swedish military term for jet engines.\n\nThe original specifications for the R1001 called for a radar rangefinder, four Bofors 20 mm akan m/45 cannons mounted in the nose with 180 rounds per gun, external fuel tanks and a top speed of 1,000 km/h. The engine was originally supposed to be an indigenous design by the company STAL but by late 1945 Sweden had gotten the green light for acquiring the British \"in development\" de Havilland Ghost engine. There are several reasons why Sweden was allowed to buy this new powerful engine even before it was finished, but the two main factors were the economic state of Britain after the war and Sweden's good relations with the company de Havilland. The engine was however not the only thing which changed at an early stage. Originally the R1001 featured straight wings, as was common at the time. However, by pure luck Sweden was able to acquire some German WWII research papers from a Swiss source regarding swept wings on aircraft and their increased performance at high speeds. Thus it was decided to change the R1001 design to feature swept wings. The first blueprints of the R1001 featuring swept wings were finished by late 1945 and within 3 years a prototype had been constructed and was ready for flight testing. During these 3 years the design would change even further from the original concept. The radar rangefinder was dropped for unknown reasons, and the Bofors cannons were switched for Hispano designs due to delays at Bofors. By 1947 the aircraft had also received the designation J29.\n\n=== Testing and production ===\nThe J29 prototype flew for the first time on the 1st of September 1948 and immediately showed incredible performance. The pilot chosen for this flight was SAAB's test pilot at the time, an Englishmen by the name Robert A. \"Bob\" Moore. He was a British squadron leader with previous experience flying jets and was thus suitable for the tests. The test flight lasted for half an hour and after a successful landing, Moore stated that \"on the ground, it's an ugly duckling, but in the air it's a swift.\" Like many aircraft which pick up a nickname due to a specific feature or shape, the J29 would fairly quickly receive the nickname \"Flygande Tunnan\" (The Flying Barrel) or just \"Tunnan\" (The Barrel) for short. Initially thought of as degrading, the nickname Tunnan would not only become the official name for the aircraft but would also start the SAAB tradition of naming their combat aircraft, a tradition which persists to this day.\n\nAfter correcting a few production errors the prototype would not only achieve the specified top speed of 1,000 km/h but it would even surpass it, achieving a sustainable speed of 1,060 km/h at one point. The design of the J29 showed a lot of promise for the future and talk of future variants would begin even before production had started. In fact, just a month after the prototype had taken to the air, there was talk of implementing attack-rockets and deflatable internal fuel tanks.\n\nProduction of the first J29 variant, the J29A, would commence in 1950 and deliveries to the air force would start in early 1951. It was quickly realized that the internal fuel capacity of the J29A was too limited and work began on implementing the previously discussed internal deflatable fuel tanks. This would be realized in a new version of the J29, designated J29B, which entered production and service in 1953. The J29B's new internal fuel tanks gave it a 50% increase in fuel capacity compared to the J29A. The J29B would be followed by an unarmed reconnaissance version called the S29C which had been planned at an early stage. The S29C was to be followed by the [[J29D]], featuring increased armament and an afterburner, but due to a variety of reasons the J29D never entered production. Instead, a modified version of the J29B, called the J29E, would enter service. The E-variant featured a new dog toothed wing which increased maneuverability at high speeds. The J29E was soon followed by the [[J29F]] which was an upgrade-program for 210 J29B and E aircraft, increasing their performance and allowing them to serve throughout the 1960s.\n\nAll in all, 661 J29s would be produced for the Swedish Air Force, the largest production run by SAAB ever. The last of these would serve until the late 1970s.\n\n=== Legacy ===\nThe J29 was a truly historical wonder for its time. After being stranded for the duration of the war, Sweden managed to not only catch up with modern aircraft development in a short amount of time but it was also able to lead jet fighter development in Europe for the time and arguably even into modern times. The J29 was the first swept-wing jet fighter to be mass-produced in Europe and together with the Soviet [[MiG-15]] and American [[F-86A-5|F-86]] it set the bar for how the next generation of fighter aircraft should be. It was extremely fast for its time and actually managed to take home two closed-circuit world speed records during the mid 1950s.\n\nBesides its international legacy, the J29 was the first Swedish-designed aircraft to see combat. In September 1961, as part of the Congo-crisis, five J29Bs were stationed in the Republic of Congo to contribute to a UN peacekeeping mission (ONUC) in the region. This led to the formation of the air wing F 22 which exclusively served in Congo. F 22 was later reinforced by four more J29Bs and two S29C reconnaissance planes in 1962. F 22 would quickly take air superiority in the area which in turn lead to them primarily performing attack-missions during the conflict. No aircraft were lost during the ONUC despite large amounts of ground fire. When the ONUC was terminated in 1964, the aircraft-type had been decommissioned in Sweden and thus it was decided to only send home a select few J29s to Sweden. The majority of the F 22 J29s were blown up on the spot in Congo when the Swedish left the area.\n\n=== A29B ===\nBetween 1953 and 1955, SAAB would produce and deliver 361 J29Bs to the Swedish air force. These would come to serve in the Swedish air force up until the early 1960s.\n\nAs mentioned previously the J29B was fitted with new internal deflatable fuel tanks and these were located in the inner wings. This gave the J29Bs ~50% more fuel than its older brother the J29A. The J29B could also equip two under wing drop tanks weighing up to 600 kg each, which increased the range even further. Interestingly the drop tanks could also be armed as incendiary bombs via a switch box in the cockpit. Beyond drop tanks the aircraft were also capable of carrying a wide variety of rockets for different missions.\n\nDue to delays with the [[A32A]]-development, the J29B would initially serve as an attack aircraft, being designated as the A29B. While rockets were available for the [[J29A]] it was decided to use the J29B as an attack aircraft due to it being a new aircraft type which could be sent directly to the attack wings. There they would stay until 1957 when the A32A finally entered service. Afterwards, they served as regular fighters under the designation J29B.\n\nIn Sweden, the J29B would be used until 1963 when the type was ultimately decommissioned due to being obsolete. However a large sum of J29Bs had by this time been upgraded to J29F standards, and these would serve until 1978.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=saab_j29b Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|cA2trc70PHw|'''Is this the WORST JET in WT? J/A29B - Sweden''' - ''Jengar''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n'''Comparable aircraft'''\n\n* [[F-84 (Family)]]\n* [[Me 262 A-1a]]\n* [[Attacker FB 1]] / [[Attacker FB.2]]\n* [[J28B]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wikipedia:Saab_29_Tunnan|[Wikipedia] Saab 29 Tunnan]]\n\n{{AirManufacturer Saab}}\n{{Sweden jet aircraft}}"}}