{"title":"A2D-1","pageid":6727,"wikitext":{"*":"{{Specs-Card\n|code=a2d\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_a2d.jpg\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium rank {{Specs|rank}} American strike aircraft {{Battle-rating}}. It was introduced in [[Update 1.89 \"Imperial Navy\"]].\n\nThe {{PAGENAME}} was outfitted with the Allison XT40A turboprop engine, effectively doubling the horsepower over the [[AD-2|AD-2 ''Skyraider'']], however, installation of contra-rotating propellers was needed to harness all of that power. To accommodate this new thrust, the wing roots were decreased in their thickness while the tail section became larger and taller in order to stabilize the aircraft when under power. With the new engine situated, it was time to focus on the armament of the aircraft. Basic offensive 20 mm cannons were implemented, placing two in each wing with each gun being loaded with 400 rounds of ammunition, twice the firepower as on the Skyraider.\n\nThe Douglas {{PAGENAME}} did not have the same legacy as the A-1 Skyraider, however here in War Thunder new life has been given to this hybrid turbo-prop fighter allowing it to find a niche as a strike aircraft turned fighter and/or bomber, all depending on the ordnance outfitted by the pilot. Not to be underestimated, though having a bulky airframe, the {{PAGENAME}} has the speed and ordnance which can help in turning the tide of a battle. Often this aircraft will come up against jet aircraft, but its lack of speed can be made up in manoeuvrability and skill of the pilot in command.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nWith each engine reaching 2,517 horsepower, the A2D's top speed rivals early jets. The rate of climb is phenomenal and the short take off run speaks for a great acceleration. Every characteristic tells the tale of a great [[energy fighting]] machine. This strike aircraft is very much unlike its older cousin the [[AD-2]].\n\nBut the devil is in the detail. The wing loading is exceptional high >220 kg/m², sitting even above the [[P-47 (Family)|P-47 ''Thunderbolt'']]. It further does so in category of weight and size. Make no mistake, the Skyshark is a Sky whale  and flies appropriately at times. Because of the weight, the elevator authority feels weak and one will kiss the ground more than once, before learning to fly with the momentum properly. Rapid pitch changes are not the Skyshark's forte, an abusable fact known to aces. Worse still is the jittery behaviour while manoeuvring or taking aim. Again the aircraft's mass will delay any inputs, especially noticeable in [[Simulator Battles|simulator mode]]. As a turboprop, the jets require a spool-up time when going from low to high power.\n\nThe acceleration is good, thanks to the powerful engines, allowing for a better sustained turn rate despite mediocre manoeuvrability. This allows the A2D to outshine many early jets in turn dogfights. Maintaining a Yo-Yo with 350 km/h IAS is possible and sadly necessary, any slower than this and the aircraft becomes less responsive. A rare case where lower speeds reduce overall controllability.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 8,534 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n|796||796|| rowspan=\"2\" | {{Specs|ceiling}} ||25.6||26.2||32.4||32.1|| rowspan=\"2\" | 350\n|-\n! Upgraded\n| 796 || 796 || 24.5 || 25.0 || 36.4 || 34.4\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || ✓ || ✓     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} ||428|| 351 || 300 || ~9 || ~4\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 460 || < 480 || < 460 || N/A\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 1,000 m || 5,034 hp || N/A\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\nThe {{PAGENAME}} has no protection for the pilot which makes it very vulnerable to AAA and other aircraft. The radar is also vulnerable to being hit. Belly landings can lead to the aircraft destroying itself beyond repair, but if done in a certain way now, due to damage model changes, the {{PAGENAME}} can indeed belly land.\n\nThe propeller driveshaft besides the engines is the most important part of maintaining thrust, as if it is damaged too much the engine condition will not matter and a loss of airspeed will occur. The A2D1 can still fly on one engine if the prop driveshaft and the one said engine is lightly damaged or undamaged. The {{PAGENAME}}'s fuel tank is quite prone to fires as it is a big target due to being in the fuselage. While this may seem bad, do not let this discourage you from executing boom-and-zoom tactics.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|T31 (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 4 x 20 mm T31 cannons, wing-mounted (200 rpg = 800 total)\n\nThe T31 is a modification of the Hispano-Suiza system and an improvement from the AN-M2 cannon, mostly in weight though. The quadrupple punch is a welcomed upgrade from the Skyraiders. However as the autocannons are mounted in the wings, the pilot must be cognizant of their range to the target and their convergence setting to ensure the ammunition hits the target and doesn't just fly on by.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|AN-M57 (250 lb)|AN-M64A1 (500 lb)|AN-M65A1 (1,000 lb)|AN-M66A2 (2,000 lb)}}\n{{main|HVAR|Mk.13-1 Case (1,927 lb)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 20 x 250 lb AN-M57 bombs (5,000 lb total)\n* 20 x HVAR rockets\n* 10 x 500 lb AN-M64A1 bombs (5,000 lb total)\n* 2 x 1,000 lb AN-M65A1 bombs (2,000 lb total)\n* 2 x 2,000 lb AN-M66A2 bombs (4,000 lb total)\n* 2 x 2,000 lb AN-M66A2 bombs + 8 x 500 lb AN-M64A1 bombs (8,000 lb total)\n* 2 x 2,000 lb AN-M66A2 bombs + 20 x HVAR rockets (4,000 lb total)\n* 2 x 1,927 lb Mk.13-1 Case torpedoes\n\nTwenty-two total hardpoints allow the {{PAGENAME}} to carry an abundance of suspended ordnance much like the Skyraider. Choices of bombs, rockets and torpedoes open up the possibility of targets which can be engaged. Choices in bombs provide options with either 250 lb, 500 lb, 1,000 lb and 2,000 lb bombs. With these targets can range from mobile light trucks, anti-aircraft artillery, tanks, pillboxes and even bases. HVAR rockets provide flexibility to allow the {{PAGENAME}} to fire them from any angle (a restriction which bombs have) as the aircraft descends towards the target. The Mk.13-1 Case torpedoes are outfitted with a special frangible wooden drag ring and box stabilizer which allow for the torpedo to be dropped at high speeds and from higher altitudes than unmodified torpedoes making them a perfect option for the {{PAGENAME}} when taking on an anti-shipping role.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nIn [[Arcade Battles|Arcade]] and [[Realistic Battles]], the A2D-1 can climb with no extra armament to become top cover for the allied fighters, or alternatively escort bombers to their designation. It can also carry one of its most hard hitting armaments and destroy several ground targets or destroy two bases. Though in [[Simulator Battles]] the jittery controls and lack of control make it more akin to a [[B-57B]] fast jet bomber.\n\n;Dogfights\n\nWith its outstanding acceleration and climb-rate the Skyshark can safely assault hostile ground forces and then decide to join the fray, by either assault climbing the closest hostile, relying on its acceleration to gain an energy advantage mid dogfight, or return to allied fighter pack to rejoin their climb. Going straight for the climb from the start will put the A2D at an immense energy advantage should the fight start.\n\nPreferred combat styles are [[energy fighting]], due its aforementioned acceleration and climb-rate, but also [[BnZ|Boom and Zoom]] for the Skyshark is a heavy weight, note though it can easily reach its terminal velocity and loose all wings, coupled with the slow spool-up-time of the engine from low power, a provident engine and air-brake control is paramount. The G-Suit is a welcomed addition, but will often lead to ripped wings via g-forces in diving maneuvers.\n\nCombat versus Jets differs amusingly little than versus propeller crafts. After easily gaining an altitude advantage, dive on the hostile and force it to break away (turn), hence losing speed and energy. Three things could happen now.\n\n# the enemy jet dives - do not try follow too long, your terminal speed is lesser than most jets -> regain altitude,\n# the enemy jet runs - hostile didn't lose too much speed, or assumes the A2D's speed and acceleration to be lesser. If it is the latter -> outpace and kill it,\n# the enemy jet breaks more - hostile is either trying to force an overshoot or prepares for a dogfight, either way -> engage in manoeuvre combat.\n\nVersus propeller fighters one should engage in turnfights, otherwise the Skyshark is most dominant against most WW2 fighters. Few Rank 4 fighters can challenge the A2D on equal terms, so stay sharp.\n\n;Strafing\n\nThe A2D-1 can be a very valuable asset to teams looking to win by destroying ground troops or assaulting the airfield.\nHowever the Skyshark is so heavy weight and hence slugish that every strafing attempt is an inch away from a crash. The momentum change comes later than expected and is more akin to a medium bomber like the [[B-25J-20|B-25]]. One is not surprised the US Navy stuck with the older AD-2, as in the ground attacker role the Skyshark must play a slow game. Take time for every attack run and try to maintain a speed way above 300 km/h IAS with combat flaps. This is a very high velocity for strafing runs, however any less and the plane will not rise above the newly explosive laden ground...\n\n===Radars===\n{{main|AN/APS-19}}\nThe A2D-1 is equipped with an [[AN/APS-19]] search and tracking radar. The radar is mounted in nose, inside the propeller hub.\n\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"4\" | [[AN/APS-19]] - Target Detection Radar\n|-\n! {{Annotation|Maximum<br/>Detection<br/>Range|The maximum possible range at which a target can be detected}}\n! {{Annotation|Guaranteed<br/>Detection<br/>Range|The range, below which, detection of a target is practically guaranteed}}\n! {{Annotation|Max Azimuth<br/>Scan Angle|How far to each side the radar can scan (widest search mode)}}\n! {{Annotation|Max Elevation<br/>Scan Angle|How far up and down the radar can scan (widest search mode)}}\n|-\n| 60,000 m<br />(theoretical) || 7,200 m || ±67.5° || ±67.5°\n|-\n! colspan=\"4\" | [[AN/APS-19]] - Target Tracking Radar\n|-\n! {{Annotation|Maximum<br/>Tracking<br/>Range|The maximum range at which a target can be tracked}}\n! {{Annotation|Minimum<br/>Tracking<br/>Range|The range below which targets cannot be tracked by the radar}}\n! {{Annotation|Azimuth Tracking<br/>Angle|How far to each side the radar can track a target}}\n! {{Annotation|Elevation Tracking<br/>Angle|How far up and down the radar can track a target}}\n|-\n| 1,500 m || 150 m || ±15° || ±15°\n|-\n|}\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Not controllable<br>Not auto controlled || Not controllable<br>Not auto controlled || Not controllable<br>Not auto controlled || Combined || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Powerful turboprop dual engines\n* Quad 20 mm cannon armament\n* Possesses tracking and search Radar\n* Impressive payload\n* Premium bonuses\n* Naval aircraft capable of carrier-landing\n\n'''Cons:'''\n\n* Quite sluggish\n* Extremely large profile\n* Time limit on radar\n* Tracking Radar only works at ~1 km\n* Extremely large profile for an attacker\n* Tail of aircraft is fragile\n* Extremely loud propulsion system allows for easy detection\n* Faces jets like the F-86K and the MiG-21F-13 because of its higher BR in arcade\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe Douglas A-1 Skyraider was an impressive aircraft for a piston-driven propeller-powered aircraft which survived into the jet age, being used by the United States Navy, Marine Corps and Air Force and around nine other countries over its 40-year service. Like many aircraft which were successful, they went through many iterations and variants to keep them up to date with new requirements and technology as they came about. In an age where jet aircraft were beginning to overtake propeller-driven aircraft in all aspects of military service, the Bureau of Aeronautics which was the U.S. Navy's material-support organization was looking for a suitable option for an attack aircraft which would be more fuel-efficient than the upcoming jet fighters. To meet the Navy's requirement, Douglas Aircraft looked to their AD Skyraider airframe and considered modifying it to accept a more fuel economical turboprop engine.\n\nIn the early years following the war, jet engines underwent rapid development. This attracted the interest of the US Navy, which sought to arm itself with aircraft that were superior to that of potential opponents in speed, altitude, payload, and flight range.\n\nAs it turned out, jet engines were perfect for fighter aircraft but too \"voracious\" for strike aircraft, as they significantly reduced their range. The best engineering solution was to introduce the turboprop engine, which was a task the Douglas company undertook.\n\nInitially, engineers simply wanted to replace the piston engine of the Skyraider attack aircraft with a turboprop engine. However, this led nowhere and the vehicle required significant modification. In the end, the engineers settled on a prototype with Allison Т-40А-2 turboprop engines and coaxial propellers.\n\nThe first flight of the XA2D-1 prototype, called the Skyshark, took place on May 26, 1950, but engine vibration nearly destroyed the aircraft and it was forced to land after only two minutes. By December 1950, the prototype had already completed over a dozen flights. However, a routine flight on December 19, 1950, ended in tragedy. Due to issues with the engine, the vehicle and pilot crashed. Nevertheless, testing continued and, despite the many technical problems that plagued the aircraft, the army ordered 10 pre-production models of the A2D-1. However, on August 5, 1954, another accident occurred when the main gearbox failed, and the aircraft crashed a short distance outside Los Angeles. This time, the pilot managed to escape the aircraft, but the project was closed and it was decided to dismantle any existing prototypes. Apparently, this decision was influenced by the fact that in the same year for the first time Douglas got another project in the air, this later became the famous A4D Skyhawk - a new generation of jets.\n\n''- From [[wt:en/news/6210-development-douglas-a2d-1-skyshark-wyvern-to-the-max-en|Devblog]]''\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=a2d Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed\" heights=\"200\">\nFile:A2D-1_WTWallpaper_001.jpg\nFile:A2D-1_WTWallpaper_002.jpg\nFile:A2D-1_WTWallpaper_003.jpg\nFile:A2D-1_WTWallpaper_004.jpg\nFile:A2D-1_WTWallpaper_005.jpg\n</gallery>\n\n;Videos\n{{Youtube-gallery|DsUqjuBUWko|'''Is It Worth Your Money? War Thunder 1.89 A2D-1 Commentary''' - ''DEFYN''|Br0MqMHurKQ|'''Jaws With Wings - A2D-1 SkyShark - Ground Forces RB Gameplay''' - ''CyberDeath Gaming''|osh4KS9yodw|'''The Shooting Range #158''' - ''Metal Beasts'' section at 00:35 discusses the {{PAGENAME}}.|vhTZXYk6eao|'''Tank busters''' discusses the {{PAGENAME}} at 1:43 - ''War Thunder Official Channel''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n* [[AD Skyraider (Family)]]\n\n;Aircraft of comparable role, configuration and era\n* [[Wyvern S4|Westland Wyvern S4]]\n* [[P-47M-1-RE]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/6210-development-douglas-a2d-1-skyshark-wyvern-to-the-max-en|[Devblog] Douglas A2D-1 Skyshark: Wyvern to the Max!]]\n* [https://forum.warthunder.com/index.php?/topic/453543-douglas-a2d-1-skyshark/ <nowiki>[Data Sheet]</nowiki> Douglas A2D-1 Skyshark]\n* [[wikipedia:Douglas_A2D_Skyshark|[Wikipedia] Douglas A2D Skyshark]]\n\n{{AirManufacturer Douglas}}\n{{USA strike aircraft}}\n{{USA premium aircraft}}"}}