{"title":"A6M2 mod. 11","pageid":544,"wikitext":{"*":"{{About\n| about = Japanese fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = A6M (Family)\n}}\n{{Specs-Card\n|code=a6m2_mod11\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Japanese fighter {{Battle-rating}}. It was introduced in [[Update 1.39]].\n\nThe \"Zero\" is almost the ideal dog-fighter. Very good turn times and 2 x 20 mm cannons make this aircraft a frightening foe. Use your superior turn time and better overall manoeuvrability to get on the tail of the enemy. Be mindful of the low ammo count. Historically, as well as in the game, the A6M series was stripped of all armour to lighten the aircraft (achieving its amazing manoeuvrability). This means that your pilot is easily sniped and your fuel tanks, which are not protected, catch on fire very easily.\n\nAlthough this aircraft can carry bombs, it makes you an easy target and is really not worth the added weight in realistic or simulator battles. It is slower compared to most of the opposition, thus be mindful of what is around you.\n\nLanding and runway manoeuvrability is good, but with no tail hook, you can find your self careening off the end of carriers. Landing on a carrier with this land-based version requires a careful hand. With an approach speed of 120 km/h (90 mph), landing flaps and gear down approach a ''moving'' carrier from behind. When setting down on the flight deck immediately pull up the flaps, push the brake and pull up with the elevator (past the stall speed of 90 km/h (60 mph)).\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,400 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 491 || 475 || rowspan=\"2\" | {{Specs|ceiling}} || 17.7 || 18.2 || 10.1 || 10.1 || rowspan=\"2\" | 175\n|-\n! Upgraded\n| 532 || 510 || 16.7 || 17.0 || 17.5 || 13.3\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 484 || 451 || 280 || ~14 || ~8\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 270 || < 420 || < 410 || > 324\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* No armour protection\n* Not self-sealing fuel tanks\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Type 99 Model 1 (20 mm)|Type 97 navy (7.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 20 mm Type 99 Model 1 cannons, wing-mounted (60 rpg = 120 total)\n* 2 x 7.7 mm Type 97 navy machine guns, nose-mounted (680 rpg = 1,360 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|Navy Type 97 Number 6 (60 kg)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x 60 kg Navy Type 97 Number 6 bombs (120 kg total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe best tactic to use in this aircraft is to sneak up behind your enemies and use your excellent turn rate to your advantage, something that most other fighters don't have at the BR. The most dangerous enemies in this aircraft come from above, Boom and Zoomers will rain fire from above if you are not careful.\n\nForce an enemy pilot into a dogfight at 370 - 400 km/h and below 6,000 meters. At this speed and altitude, no enemy fighter can out-manoeuvre or out-climb you. Jump on cruising enemy aircraft from above. Fasten onto the tail of the bandit, use your superior manoeuvrability to match his evasive moves, and put enough rounds into him to bring him down. Use your machine guns first to \"bore-sight\" the enemy - once you get hits on him, finish him off with your cannons. Below 480 km/h you can fling the Zero all over the sky to get on an enemy's tail or to shake off all but the most determined attacker. Climb away from most enemy aircraft, hanging on your prop in a near-vertical climb. Manoeuvres like the Immelmann are easy, and heavier fighters can't stay with you. The Zero rolls faster to the left than to the right. Roll left to tighten your turn and get onto the enemy's six. Don't dive away from attackers - your plane doesn't have the power or weight to out-run most fighters. To exploit your plane's best performance, force the enemy lower and slow down the pace of the engagement.\n\n* In Simulator, the A6M Zero is overall a great plane to fly. Its advantages include the extremely smooth handling, impressive turn rate, low stall speed, the ability to not enter spins in extreme manoeuvres, and decent rear visibility. It is able to pull really tight turns or barrel rolls without losing control or going into a spin, allowing the player to use this stability to their advantage. Its disadvantages, however, are the fragile protection, wing-mounted guns with very little ammo, and the cockpit scattered with frames. Although not thick, these frames can still be obstructions in a fight. Also the gunsight is small and mounted very low, resulting in inadequate visibility over the nose. This can limit the player's ability to see the target in a turn fight since to lead the target, the player must cut inside its turn, meaning the nose will now block the target. The A6M can perform dogfighting, some ground pounding and some intercepting.\n* You can bring the minimum amount of fuel (29 minutes) since this model of the Zero only has a 60-round drum per cannon, as a result you might need to constantly return to airfield to reload so there is no need to bring more fuel. Set the convergence to 150-300 m. When taking off, the A6M will shift severely to the left so it is best to set separate keybind for left and right brakes to counter the torque.\n\n* For dogfighting, it is better to engage with an altitude advantage so climb to around 2,500 m. Track the opponent using lead or pure pursuit, as with lag pursuit you will eventually end up at the 6'o clock of the target aircraft whose fuselage will soak up most of your MG bullets, and your wing mounted cannons will become really awkward to aim. With the amazing stableness the aim should be easy. Target their wings or nose and avoid the back half of the fuselage as there is usually nothing in there. You can turn with most planes with your combat/takeoff flaps deployed. Note that it is best to fire in 5-round/half-second bursts to avoid wasting cannon rounds. Once the cannons are out, the leftover 7.7 mm MGs can only effectively damage single engine fighters.\n* For ground pounding with bombs, look for tanks and pillboxes. First you need some separation between you and the target so you have enough time to line-up the drop. Dive at the target at a rather shallow angle, and release the 60 kg bombs when you are very close, with the target below the gunsight and filling up around half of it. If you only use the MGs, your targets are trucks, AAA and howitzers. Dive at it and stabilise the plane so the gunsight stays overall still at the target. Then, once the target fills out around 1/6 of the gunsight, open fire. If your aim is accurate you can destroy one target in a single pass. However, it is very recommended to set keybind for firing MG only as you can definitely not waste the valuable cannon rounds. Save them for any unexpected dogfights.\n* Landing is easy thanks to the low stall speed and lovely handling. Line up and approach the airstrip at treetop, decrease speed to at most 210 km/h and deploy combat, takeoff and landing flaps in order. Further decelerate so the touchdown speed is no more than 180 km/h to avoid bouncing up. Keep braking until the plane reaches a full stop, you don't have to worry about the nose dipping down and causing a propeller strike.\n\n'''Enemies worth noting:'''\n\n* [[P-61C-1]]: this plane is one tough nut to crack. It is quite fast, packs a fatal punch, has a searching radar, and a deadly turret on top. The turret consists of 4 x 12.7 mm M2 Browning machine guns that cover the upper half of the plane, and most P-61 players tend to fly low or get you into their upper half to target you with the turret. Avoid being above them at all costs, utilise the Zero's manoeuvrability and sneak under their belly. Its appearance resembles a P-38: a center fuselage with two engine nacelles extending backwards and forming the twin tail like a frame, you will know it is a Black Widow and not a Lightning when red tracer bullets start shooting out from it.\n* [[I-16 (Family)|I-16]]: the late I-16s are equipped with ShVAK cannons that can be pretty dangerous to your fragile airframe. They can turn equally well as the Zero, have superior roll rate but the stability is so terrible that as soon as they pull a little more on the stick, they will enter spins. Therefore it is quite easy to counter them: engage a turnfight with them and turn tighter and tighter, or do a few barrel rolls. They will quickly lose control and start spinning and it is quite hard to recover. Then simply get some separation, turn around and put some solid shots into them. They have the I-15's short and fat fuselage, a flat radial engine and triangular stabilisers located right after the low-mounted mono wings, all covered in olive green paint.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* '''A'''6M for Carrier-based fighter:\n** Strictly air-to-air role\n*** Gets 2x [[Navy Type 97 Number 6 (60 kg)|Type 97 No.6 Land Bomb (60kg)]], but strongly ill-advised for air-battles\n** Decent cannon armament\n** Extremely manoeuvrable\n*** Excellent turn rate\n*** Excellent roll rate\n** Very short takeoff distance\n\n* Common Navy plane construction:\n** Excellent manoeuvrability\n** Nose mounted armament\n** Small radiator drag\n\n'''Cons:'''\n* '''A'''6M for Carrier-based fighter:\n** Strictly air-to-air role\n** Limited ammo\n** Slow\n** Low dive speed, and easily compressed in a dive\n\n* Common Navy plane construction:\n** Poor MG offensive armament: [[Type 97 navy (7.7 mm)|7.7 mm Type 97 MG]]\n** Poor Cannon offensive armament: [[Type 99 Model 1 (20 mm)|20 mm Type 99 Model 1 Cannon]]\n*** Very low muzzle velocity\n** Fragile, little armour, and no self-sealing fuel tanks\n\n* '''{{PAGENAME}}''' specific:\n** Evaluation model, doesn't come with tail hook\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe A6M2 mod. 11 was the third prototype to be built. It was powered by a 950 hp Nakajima Sakae engine. Production started in 1939 and a total of 64 were built. These aircraft saw combat in China.\n\n=== In-game description ===\nAt its launch, the A6M2 model 11 knew no equal.\n\nThis single-seater carrier-based fighter was designed to replace the ageing A5M. To reduce its weight, duralumin was widely used, and its propeller was made of a lightweight aluminium alloy. The A6M2 did not have high survivability due to its lack of armour and self-sealing fuel tanks, but in the first half of World War II, it had a considerable advantage in manoeuvrability and speed when compared to the Allies (which had nothing to oppose the Zero until the arrival of aircraft such as the F4U and F6F).\n\nThe first prototype of this series, the A6M1, first flew on April 1, 1939. During the test, a more powerful engine was proposed, and the Mitsubishi Zuisei 13 (780 hp) was replaced with the Nakajima Sakae 12 (940 hp). After a successful test flight, the new engine was adopted for serial production and the plane was designated the A6M2 Model 11. Its main drawback was that it could not be used on aircraft carriers due to its large wingspan, which was not designed for carrier-based operations. To circumvent this limitation, the A6M2 model 21 was designed with folding 500 mm wing panels.\n\nIn 1942 the American Military discovered a crash landed A6M2 on the Akutan Island in Alaska. The plane was shot, which severed the oil return line. Despite the leak, pilot Tadayoshi Koga maintained function of the engine until his crash landing. Unfortunately for Koga, he unknowingly touched down in a marsh, which caused his landing gear to sink into the mud flipping the plane and killing him. Koga landed on that island because there was a Japanese Submarine on standby to safely secure any downed Japanese pilots just off the coast.\n\nThe plane was recovered by the US Military, and was the third A6M2 brought to the US for testing. The priors both being damaged beyond repair and were not air worthy; however, Koga's plane was in miraculous condition allowing it to fly with some minor repairs. The flying of Koga's plane showed the US military that this plane had flaws. Notably, the plane was not as fast as they once thought and the plane could not roll to the right due to its light weight frame and high torque engine. These discoveries brought new tactics to the Allied Pilots in the Pacific and cause the Un-Challenged reign of the A6M2 to slowly come to a halt.\n\nA total of 740 A6M2 model 21s were built in Mitsubishi plants; 326 were built in Nakajima plants.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=a6m2_mod11 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Aircraft of comparable role, configuration and era\n* Grumman [[F4F (Family)|F4F]] Wildcat\n* [[Template:AirManufacturer Nakajima|Nakajima]] [[Ki-43 (Family)|Ki-43]] Hayabusa (▃ Oscar)\n* Supermarine [[Spitfire (Family)|Spitfire]]\n* Hawker [[Hurricane (Family)|Hurricane]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/293772-mitsubishi-a6m2-mod-11/ Official data sheet - more details about the performance]\n* [[Wikipedia:Mitsubishi_A6M_Zero#A6M2a_Type_0_Model_11|[Wikipedia<nowiki>]</nowiki> A6M2a Type 0 Model 11]]\n\n{{AirManufacturer Mitsubishi}}\n{{Japan fighters}}"}}