{"title":"A6M5 Ko","pageid":629,"wikitext":{"*":"{{About\n| about = Japanese gift fighter '''{{PAGENAME}}'''\n| usage = other uses\n| link = A6M (Family)\n}}\n{{Specs-Card\n|code=a6m5ko\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n|store=3296\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} Japanese fighter {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27. This plane is nearly identical to the tech tree counterpart [[A6M5]] with an exception of extra 50 rounds of ammunition for its 20 mm guns.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\nAs with the other A6M5 variants, the A6M5 Ko features an improved exhaust system that gives the plane more thrust and acceleration. While this does not help the Zero to catch up with any enemy fighters, it helps to retain the plane's energy rather well which will certainly be a great asset in a dogfight.\n\nAlthough this variant of Zero has a good climb rate, the Zero's limited top speed and frail airframe makes it ill-suited for bomber hunting and boom-and-zoom tactics. The aforementioned weak airframe also worsens the Zero's manoeuvrability when the plane reaches a speed of 600 km/h in a dive.\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 6,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 521 || 503 || rowspan=\"2\" | {{Specs|ceiling}} || 16.6 || 17.2 || 13.4 || 13.4 || rowspan=\"2\" | 190\n|-\n! Upgraded\n| 563 || 540 || 15.8 || 16.0 || 21.4 || 16.9\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || ✓     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 397 || 368 || 220 || ~14 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 280 || < 420 || < 410 || > 336\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* No armour protection\n* Non-self-sealing fuel tanks\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Type 99 Model 2 (20 mm)|Type 97 navy (7.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 20 mm Type 99 Model 2 cannons, wing-mounted (125 rpg = 250 total)\n* 2 x 7.7 mm Type 97 navy machine guns, nose-mounted (700 rpg = 1,400 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|Navy Type 97 Number 6 (60 kg)|Navy Type Number 25 Model 2 (250 kg)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x 60 kg Navy Type 97 Number 6 bombs (120 kg total)\n* 1 x 250 kg Navy Type Number 25 Model 2 bomb (250 kg total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe Zero is outclassed by everything it faces in terms of speed. The only thing left to hang on to is its famous manoeuvrability. More than ever, the key is to exploit its nimbleness to force the enemy to make mistakes. Every single aircraft in this battle-rating is faster - the [[P-47N-15]] is both faster in a straight line and in a dive - meaning the slow {{PAGENAME}} will have limited opportunities to engage. It is not common to see enemies turn fight with a Zero, but most will break away and attempt to flee. As such, the {{PAGENAME}}'s best bet is to try and end the fight quickly with good shot placement and lead so that the A6M5 Ko can dis-engage before its target flees. During the downtime if the enemy plane continues fleeing or was shot down, start re-climbing to prepare for engaging new targets that approaches the {{PAGENAME}}.\n\nThe Zero's infamous reputation for catching fire after being shot by any incendiary rounds continue - the lack of armour is detrimental to the Zero meaning if it gets hit, it's likely going to be fatal. This means the pilot needs to do their best to dodge all shots coming the {{PAGENAME}}'s way by utilizing the Zero's incredible manoeuvrability. Remember to turn into the enemy to spoil their aim. With good shot placement, the {{PAGENAME}}'s weaponry can dispatch foes as they pass by due to the amazing turn time on the Zero. Then, it's a simple matter of getting onto their six and taking small, accurate bursts at the opponent. The {{PAGENAME}} can also frustrate its enemies by constantly evading all of their attempts to force head-ons, or the A6M5 Ko can dive down on unsuspecting pilots as the Zero still has quite a good climb rate compared to other aircraft of its battle rating.\n\n* In Simulator, the A6M Zero is overall a great plane to fly. Its advantages include the extremely smooth handling, impressive turn rate, low stall speed, the ability to not enter spins in extreme manoeuvres, decent rear visibility, and increased cannon ammo capacity. It is able to pull really tight turns or barrel rolls without losing control or going into a spin, allowing the player to use this stability to their advantage. Its disadvantages, however, are the fragile protection, wing-mounted guns, and the cockpit scattered with frames. Although not thick, these frames can still be obstructions in a fight. Also the gunsight is small and mounted very low, resulting in inadequate visibility over the nose. This can limit the player's ability to see the target in a turn fight since to lead the target, the player must cut inside its turn, meaning the nose will now block the target. The A6M can perform dogfighting, some ground pounding and some intercepting.\n\n* You can bring the minimum amount of fuel (29 minutes) since this model of the Zero only has a 100-round drum per cannon, as a result you might need to constantly return to airfield to reload so there is no need to bring more fuel. Set the convergence to 150-300 m. When taking off, the A6M will shift severely to the left so it is best to set separate keybind for left and right brakes to counter the torque.\n* For dogfighting, it is better to engage with an altitude advantage so climb to around 2,500 m. Track the opponent using lead or pure pursuit, as with lag pursuit you will eventually end up at the 6'o clock of the target aircraft whose fuselage will soak up most of your MG bullets, and your wing mounted cannons will become really awkward to aim. With the amazing stableness the aim should be easy. Target their wings or nose and avoid the back half of the fuselage as there is usually nothing in there. You can turn with most planes with your combat/takeoff flaps deployed. Note that it is best to fire in 10-round/one-second bursts to avoid wasting cannon rounds. Once the cannons are out, the leftover 7.7 mm MGs can only effectively damage single engine fighters.\n\n* For ground pounding with bombs, look for tanks and pillboxes. First you need some separation between you and the target so you have enough time to line-up the drop. Dive at the target at a rather shallow angle, and release the 60 kg bombs when you are very close, with the target below the gunsight and filling up around half of it. For the 250kg, drop it with the gunsight slightly more above the target. If you only use the MGs, your targets are trucks, AAA and howitzers. Dive at it and stabilise the plane so the gunsight stays overall still at the target. Then, once the target fills out around 1/6 of the gunsight, open fire. If your aim is accurate you can destroy one target in a single pass. However, it is very recommended to set keybind for firing MG only as you can definitely not waste the valuable cannon rounds. Save them for any unexpected dogfights.\n* Landing is easy thanks to the low stall speed and lovely handling. Line up and approach the airstrip at treetop, decrease speed to at most 210 km/h and deploy combat, takeoff and landing flaps in order. Further decelerate so the touchdown speed is no more than 180 km/h to avoid bouncing up. Keep braking until the plane reaches a full stop, you don't have to worry about the nose dipping down and causing a propeller strike.\n\n'''Enemies worth noting:'''\n\n* P-61: this plane is one tough nut to crack. It is quite fast, packs a fatal punch, has a searching radar, and a deadly turret on top. The turret consists of 4 x 12.7 mm M2 Browning machine guns that cover the upper half of the plane, and most P-61 players tend to fly low or get you into their upper half to target you with the turret. Avoid being above them at all costs, utilise the Zero's manoeuvrability and sneak under their belly. Its appearance resembles a P-38: a center fuselage with two engine nacelles extending backwards and forming the twin tail like a frame, you will know it is a Black Widow and not a Lightning when red tracer bullets start shooting out from it.\n\n* F4U, F6F, P-47, etc: these planes are a huge threat to the late Zeros as they have superior firepower, speed, dive acceleration and robust airframes. Their 12.7 mm MGs can easily tear you apart or simply pilot-snipe you even when they are far away, as the M2 Brownings have great velocity and trajectory. They can also set you aflame easily. Start a turnfight whenever you see these stubby planes. The F4U has a long cylindrical nose and the iconic inverted gull wing. The P-47 has a huge, jug-like fuselage, bubble canopy and elliptical trailing edge that usually have invasion stripes painted on them. The F6F, on the other hand, might get confused with other planes as it looks rather average.\n\n* Spitfires: their turn time will come close to the A6M5. They are fast, and can boom and zoom. To avoid them, don't panic when they are spotted trying to boom and zoom. Counter by pretending that they have not been noticed, lulling them into a false sense of security. Then, just as they fire the first shots, dodge them, and head upwards and loop around to take the shot on them. The Spitfires have a streamlined nose with the iconic large, elliptical wings.\n* P-51: their machine guns can do severe damage to the A6M5. However, a common tendency of novice P-51 pilots is to get into a manoeuvring fight with the A6M5. Simply dodge their attacks, do a loop to get on their tail, and take shots at the opportune moments. Even better, when beating them in a turn fight, their aircraft's top profile are fully exposed, allowing for a larger surface area to be shot up and even the cockpit to hit the pilot inside.\n* Yak 3/9: their 20 mm cannons are devastating if they hit. Do not try to head on them, just dodge the attacks by looping around the bullets, get on their tail, and shoot them before they get away!\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* '''A'''6M for Carrier-based fighter:\n** Strictly air-to-air role\n*** Gets 2x [[Navy Type 97 Number 6 (60 kg)|Type 97 No.6 Land Bomb (60kg)]], but strongly ill-advised for air-battles\n** Decent cannon armament\n** Extremely manoeuvrable\n*** Excellent turn rate\n*** Excellent roll rate\n** Very short takeoff distance\n\n* Common Navy plane construction:\n** Decent offensive armament: [[Type 99 Model 2 (20 mm)|20 mm Type 99 Model 2 Cannon]]\n*** ''Ground Targets'': Great for Ground battles\n<div class=\"mw-collapsible mw-collapsed\">\n:::* AP-I:\n::::* Shreds soft targets, and can weaken / destroy weak top armored tanks, especially engine decks\n::::* Easily sets fire to air targets\n:::* HEF(T):\n::::* Tracer can help you aim on target\n::::* The few rounds in the belt can still wreck havoc on enemy planes with their HE filler\n</div>\n\n::* ''Stealth'': Great for Air battles\n<div class=\"mw-collapsible mw-collapsed\">\n:::* No tracers\n:::* HEF:\n::::* Near full HE belt\n::::* Wrecks havoc on enemy planes with HE filler\n:::* AP-I:\n::::* Easily sets fire to air targets\n</div>\n\n:* Excellent manoeuvrability\n:* Nose mounted armament\n:* Small radiator drag\n\n* '''A6M5''' specific:\n** Good climb rate\n** Can mount a bomb rack for a single 250 kg bomb, still strongly ill-advised for air-battles\n\n'''Cons:'''\n\n* '''A'''6M for Carrier-based fighter:\n** Strictly air-to-air role\n** Limited ammo\n** Slow\n** Low dive speed, and easily compressed in a dive\n\n* Common Navy plane construction:\n** Poor MG offensive armament: [[Type 97 navy (7.7 mm)|7.7 mm Type 97 MG]]\n** Poor offensive armament when stock: [[Type 99 Model 2 (20 mm)|20 mm Type 99 Model 2 Cannon]]\n*** No HE filler\n*** T & FI rounds usually do nothing\n** Fragile, nonexistent armour, and no self-sealing fuel tanks\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n=== In-game description ===\nMitsubishi Type 0 Model 52 \"Kou\" (A6M5 Model 52a, reporting names: Zeke/Hamp/Zero) single-engine carrier-based fighter\n\nIn the middle of 1942, the Allies in the Pacific Ocean Theatre took the offensive, while the Japanese were more and more often on the defensive. In 1943, new types of high-speed fighters entered service with the USAAF and the USNAF, and they outperformed the Zeros in many respects. Low survivability, the main disadvantage of the Japanese aircraft, was made clear in the fierce air duels between the planes. The fighter's flight characteristics also required some improvement, and Mitsubishi Heavy Industries designers began to upgrade the A6M again in August 1943.\n\nThe Zero received a smaller-area wing (with a span of only 11 m) with rounded tips. The wing folding mechanism was removed. To increase the plane's allowable diving speed, its wing surface skin was reinforced.\n\nSince more powerful engines were not yet available, the designers had to make the most of a Nakajima Sakae 21 engine. Every pair of cylinders was given an individual exhaust pipe instead of a common heavy exhaust manifold. This added exhaust gas thrust to the propeller thrust, which resulted in a higher aircraft speed. The fuselage skin had to be reinforced with steel sheets in the area of the pipes, since the hot exhaust gases quickly burned through thin duralumin.\n\nThe new version of the aircraft was designated Model 52 (A6M5 Model 52). The plane became slightly heavier, but its maximum speed at a height of 6,000 m reached 565 km/h. This was the speed limit for the Zero, since all further modifications made to the machine only increased its weight and, consequently, reduced its maximum speed.\n\nThe next stage in upgrading the Zero was the Model 52 \"Kou\" (A6M5a Model 52a). This improvement significantly reinforced the plane's armament by replacing the wing-mounted Type 99-2 Model 3 drum-fed cannons (with 100 rounds each) with Type 99-2 Model 4 belt-fed cannons (with 125 rounds). This added 25 rounds per cannon and slightly improved the plane's rate of fire. Now the fighter's armament consisted of two synchronous 7.7 mm Type 97 machine guns with 500 rounds each plus two wing-mounted 20 mm Type 99-2 Model 4 cannons with 125 rounds each.\n\nThe A6M5a fighter could carry bombs: two 60 kg (132 lb) bombs suspended under the wing and one weighing 250 kg (551 kb) under the fuselage.\n\nIn addition, the A6M5a's wing structure was reinforced yet again, which resulted in a maximum allowable diving speed of 740 km/h. However, this was still inferior to the diving speed of the American F4U fighter.\n\nMass production of the A6M5a variant began in March 1944. Mitsubishi Heavy Industries manufactured 391 machines. An additional unknown quantity of this variant was built by Nakajima Aircraft.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=a6m5ko Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|V_5hzA-h2eI|'''In Allied Skies - A6M5 Ko''' - ''Napalmratte''|YADf8ptP77A|'''Premium Review: A6M5 Ko [Turn & Burn Baby]''' - ''Jengar''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Aircraft of comparable role, configuration and era\n\n* Vought [[F4U (Family)|F4U]] Corsair\n* Reggiane [[Re.2001 (Family)|Re.2001]]\n* Supermarine [[Spitfire (Family)|Spitfire]]\n* Hawker [[Hurricane (Family)|Sea Hurricane]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[Wikipedia:Mitsubishi_A6M_Zero#A6M5_Type_0_Model_52|[Wikipedia] A6M5 Type 0 Model 52]]\n* [https://forum.warthunder.com/index.php?/topic/295065-mitsubishi-a6m5/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Mitsubishi}}\n{{Japan fighters}}\n{{Japan premium aircraft}}"}}