{"title":"B3C","pageid":8972,"wikitext":{"*":"{{Specs-Card\n|code=saab_b3c\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Swedish bomber {{Battle-rating}}. It was introduced in [[Update 1.95 \"Northern Wind\"]].\n\nOriginally built by the German aircraft firm Junkers, the {{PAGENAME}} started out as the Ju 86, developed in the mid-1930s alongside rival Heinkel's He 111. Since the Luftwaffe could not officially build bomber aircraft at the time, the main purpose of the aircraft was to be a ten-person airliner which could, with minimal effort, be converted into a medium bomber. When tested during the Spanish Civil War, it was found that its diesel engines could not hold up against the rigours of combat and were replaced with BMW 123 radial engines which vastly increased its reliability.\n\nLater in development, the Ju 86K was created for the purpose of exporting this aircraft to foreign nations of which Sweden and Hungary were the first to accept. Sweden started producing their licensed version of the bomber, the B 3 which was outfitted with British Bristol Mercury engines instead of the German BMW radials, of which the Mercury engines were later were license-built in Sweden and Poland.\n\nThe {{PAGENAME}} though an early war bomber is not without a box of tricks. While relegated to a medium bomber function, options in its suspended armament give it the option to carpet bomb smaller and lighter targets or to bomb heavier protected targets and bases. Externally outfitting an 853 kg torpedo gives the bomber the option to strike fear in fleet captains eyes, especially when a crew member announces \"Fish in the water\". Though for the most part considered an average bomber when it comes to manoeuvrability, rate of climb and level speed, the {{PAGENAME}} has what it takes to deliver its ordnance to the target and has several critically placed defensive turrets to protect the bomber against any interlopers, intent on downing the bomber before it gets to its target.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nThe {{PAGENAME}} is an average aircraft when it comes to flight characteristics, nothing really impressive, but nothing which hinders the bombers ability to do its job either. Acceleration, rate of climb and level flight speed are good enough. However, if caught in a low energy state with nowhere to dive, it will be relatively easy to catch, even by the most sluggish fighters or attackers. The large surface area of the wings enable this aircraft to have a comparatively low stall speed and the dual vertical stabilizers detract from the rudder capabilities of this aircraft, compared to aircraft with single vertical stabilizer (see [[B-24D-25-CO|B-24]] vs [[PB4Y-2|PB4Y]] for comparison of vertical stabilizer types).\n\nThe {{PAGENAME}} was designed for mid- to high-altitude bombing, where it remains safe from a majority of the fighters found flying against it in a match. Dropping to lower altitudes enables even the slowest of biplanes ([[Po-2]] and [[Hs 123 A-1]]) to take pot-shots at the bomber. There is one situation, which will require the {{PAGENAME}} to fly low and slow, and that is when setting up for a torpedo run. The bomber will not only be vulnerable to fighters and attackers at the extremely low altitude, but also to anti-aircraft fire from the ships, which should not have much difficulty hitting such a large and slow target.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 5,600 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 372 || 363 || rowspan=\"2\" | {{Specs|ceiling}} || 17.8 || 18.4 || 5.5 || 5.5 || rowspan=\"2\" | 530\n|-\n! Upgraded\n| 421 || 395 || 16.3 || 17.0 || 10.5 || 7.7\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 310 || 297 || 240 || ~7 || ~3\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 200 || < 200 || < 250 || > 324\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* No armour\n* Self-sealing fuel tanks (4 in each wing)\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|sb m/42 (50 kg)|mb m/40 (250 kg)|m/41 (450 mm)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* 16 x 50 kg sb m/42 bombs (800 kg total)\n* 1 x 450 mm m/41 torpedo\n* 4 x 250 kg mb m/40 bombs (1,000 kg total)\n\n=== Defensive armament ===\n{{Specs-Avia-Defensive}}\n<!-- ''Defensive armament with turret machine guns or cannons, crewed by gunners. Examine the number of gunners and what belts or drums are better to use. If defensive weaponry is not available, remove this subsection.'' -->\n{{main|Ksp m/22-37 R (8 mm)}}\n\nThe '''''{{PAGENAME}}''''' is defended by:\n\n* 1 x 8 mm Ksp m/22-37 R machine gun, nose turret (675 rpg)\n* 1 x 8 mm Ksp m/22-37 R machine gun, dorsal turret (1,050 rpg)\n* 1 x 8 mm Ksp m/22-37 R machine gun, ventral turret (825 rpg)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nWhile many aircraft found in War Thunder are considered multi-role capable (fighter and interceptor, attacker and bomber, etc.), some aircraft sit within just one role, but have several subset capabilities within that role. The {{PAGENAME}} is no exception as its sole role in the game is that of a medium bomber, however, it is capable of defining its mission objective, depending on the type of suspended ordnance outfitted.\n\n;Small target bomber\n\nAs an early rank bomber, the {{PAGENAME}} has access to several of the smaller bombs found in the game. Loading up with the 50 kg bombs allows the bomber to take out many of the lightly protect vehicles found on the map, such as trucks, light tanks, anti-aircraft artillery, light pillboxes/bunkers and aircraft parked on a runway. Vehicles travelling in columns make for an especially tempting target as when lined up properly, the {{PAGENAME}} can come in at a lower altitude and drop individual bombs per target, being more judicious with the suspended ordnance, especially in realistic and simulator battles, where reloads require heading back to base. Heavy pillboxes, medium and heavy tanks, along with bases, should be avoided, as these smaller bombs will be less effective against them.\n\n;Large/protected target bomber\n\nWhen it comes to attacking a base or targets, such as reinforced pillboxes, large ships, medium and heavy tanks, the 250 kg bomb and 450 mm torpedo will come in handy. With a harder punch, they will make short work of the vehicles, which the 50 kg bombs will realistically just bounce off of. Base bombing will be more effective, specifically if the {{PAGENAME}} is flying at 4,000 m and above, where it is less likely to run into enemy fighters, and if it does, the defensive turrets can make it that much more difficult for them to get sights on you.\n\n;Torpedo bomber\n\nThe {{PAGENAME}} can outfit a 450 mm torpedo to the external side of the aircraft's bomb bay. This big fish (853 kg) can make a big explosion, however, to get the torpedo into the water, the bomber must approach the intended target at a low altitude and slow speed. Typically, ships don't sit there and just watch the torpedo approach and will open up their anti-aircraft fire. The bomber pilot must remain calm to ensure a precise drop of the torpedo. Once released, the bomber must power back up to full speed and vacate the area to avoid further anti-aircraft fire and any potential enemy fighters, which may be in the area.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* 8 mm defensive guns can ward off most enemy fighters at its BR\n\n* Can carry a torpedo, unlike contemporary bombers at this BR\n* Both bomb loads can destroy a base\n* Defensive turrets have a high rate of fire\n* Large amounts of tracers can scare off beginning players\n* Turn time is better than some fighters\n* The 3 x 250 kg mb m/40 bombs are enough to destroy a single base, so in most cases you can destroy 1 and 1/3 of the enemy bases.\n\n'''Cons:'''\n\n* Average flight characteristics\n* Large wing profile, an easy target for attacking fighters\n* Significant defensive blind spots from the side, above and below\n* Gear retraction and lowering is painfully slow; you will have to start lowering the gear long before you make it to the runway\n* Average speed: it will not be outrunning any fighters\n* Below average defensive turrets\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe SAAB B3C began its life in the mid-1930s in Germany as the Junkers Ju 86. The purpose of this aircraft was to operate first as a high-speed passenger airliner but also function as a medium bomber with minimal conversion. Conversion from airliner required the removal of ten passenger seats and replaced with four bomb cells which carried each bomb in an upright position. Fuel tanks for the bomber version were located in the fuselage while the airliner moved them to the wings. Originally this bomber was outfitted with Junkers Jumo 205 diesel engines, their drawback was their weight, however, they were more fuel-efficient than standard petrol engines. Unfortunately during the Spanish Civil War, it was determined that the Ju 86 under-performed compared to the He 111, mainly because the diesel engines could not handle the rough treatment endured during combat situations. With this knowledge, the Ju 86 was converted to the BMW 132 radial engines which drastically improved the reliability of this bomber.\n\nThe Junkers model Ju 86K was the export version of the Ju 86 which allowed Sweden's aircraft manufacture SAAB to license build these medium bombers and designated them as the B 3. Instead of utilising BMW132 engines, SAAB opted to go with the Bristol Mercury XIX radial engines which had an output of 905 horsepower. The Swedes maintained their B 3 bombers throughout the war and continued to use them for another thirteen years with several being converted to maritime patrol and signal intelligence (SIGINT) aerial platforms to keep apprised of Soviet and Eastern Europe activity.\n\n=== [[wt:en/news/6492-development-saab-b3c-bomber-to-start-from-en|Devblog]] ===\nIn 1934, a set of requirements was issued to both Heinkel and Junkers to develop a new twin engine aircraft, capable of acting as both a high-speed civilian airliner as well as a medium bomber for the German Luftwaffe. While Heinkel would go on to develop the far more successful He 111, Junkers developed the Ju 86, the first test flights of which occurred already in late 1934 and extending in early 1935.\n\nEarly production of the type commenced in late 1935 for military versions, while civilian variants entered service in 1936. Despite being seen as inferior to the He 111, especially in military service, the Ju 86 nonetheless remained a relatively popular aircraft on the export market, being purchased by various operators from around the globe, ranging from South America, over Europe and going all the way to Asia and Oceania.\n\nAmong its many operators was also Sweden, which not only purchased a number of Ju 86s directly from Junkers, but also acquired a licence to manufacture the type domestically in the late 1930s.  Both imported and built under licence by the SAAB company, the aircraft received its new designation B3, and unlike the German original, the Swedish counterpart received different engines (namely licence-built versions of the Bristol Pegasus radial engines) as well as Swedish weaponry. \n\nAs with other countries, Sweden employed their Ju 86s in both military as well as civilian roles for many years before, during and after WWII, with the last of the Ju 86s being decommissioned during the late 1950s. In total, only about 15 B3C and one B3D were built for the Swedish Air Force by SAAB between 1939 - 1940 out of the original 40 aircraft planned.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=saab_b3c Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<div><gallery mode=\"packed\" heights=\"150\">\nFile:SAAB B3C WTWallpaper 001.jpg|\nFile:SAAB B3C WTWallpaper 002.jpg|\nFile:SAAB B3C WTWallpaper 003.jpg|\nFile:SAAB B3C WTWallpaper 004.jpg|\nFile:SAAB B3C WTWallpaper 005.jpg|\nFile:SAAB B3C WTWallpaper 006.jpg|\nFile:SAAB B3C WTWallpaper 007.jpg|\n</gallery>\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Aircraft of comparable role, configuration and era\n\n* Heinkel [[He 111 H-6|He 111]]\n* Dornier [[Do 17 (Family)|Do 17]]\n* Savoia-Marchetti [[S.M.79 (Family)|SM.79]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/6492-development-saab-b3c-bomber-to-start-from-en|[Devblog] SAAB B3C: Bomber to Start From]]\n* [https://forum.warthunder.com/index.php?/topic/474729-saab-b3c/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Saab}}\n{{Sweden bombers}}"}}