{"title":"Bf 109 G-14/AS (Italy)","pageid":648,"wikitext":{"*":"{{About\n| about = fighter '''{{PAGENAME}}'''\n| other\n| usage-1 = the German variant\n| link-1 = Bf 109 G-14\n| usage-2 = other versions\n| link-2 = Bf 109 (Family)\n}}\n{{Specs-Card\n|code=bf-109g-14as\n|images={{Specs-Card-Image|GarageImage_Bf_109_G-14_AS_Italy.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Italian fighter {{Battle-rating}}. It was introduced in [[Update 1.69 \"Regia Aeronautica\"]].\n\nThe Bf 109 G-14 represents the utmost technological achievement of the Bf 109 Gustav series of aircraft. Like both the G-10 and the G-6, the G-14 can be modified for either bombing duties, intercepting bombers, or improving its firepower against enemy fighter. However, the G-14 both possesses a more powerful engine and better manoeuvrability than its predecessors.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nThe plane behaves as you would expect from a late Bf-109: great climb rate, powerful armament options (being able to mount two 20 mm or 30 mm gunpods to deal with air targets as well as a similar option for the engine mounted cannon), and BnZ; of course at the cost of poor turning speeds and a sub-par roll rate.\n\nCompared to the regular G-14, it may look like a worse version but it compensates with improved high altitude performance and manoeuvrability in vertical fighting.\n\nWith a top speed of 698 km/h at 7,000 m, it's well above most of its competition in terms of high altitude performance which makes it a great bomber interceptor and high altitude fighter. However its rip speed prevents it from diving at high speeds or steep angles. Clever positioning and well planed approaches can make up for these limitations.\n\nIn capable hands and with its limitations and strengths in mind it can be one of the best air superiority fighters at its BR, even outperforming the later [[Bf 109 K-4]] or even the [[P-51H-5-NA]].\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 7,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 666 || 645 || rowspan=\"2\" | {{Specs|ceiling}} || 21.2 || 22.1 || 16.4 || 16.4 || rowspan=\"2\" | 325\n|-\n! Upgraded\n| 737 || 698 || 19.4 || 20.0 || 29.6 || 21.8\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 437 || 408 || 260 || ~13 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 450 || < 390 || < 450 || > 715\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Compressor\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n! Setting 1\n| 7,800 m || 1,140 hp || 1,596 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 60 mm Bulletproof glass in front and rear of cockpit.\n* 4-8 mm Steel plates on pilot seat.\n* 10 mm Steel plates around pilot's head.\n* 21 mm Steel plate on rear of fuel tank, with 4 mm plates surrounding it on other sides.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|MK 108 (30 mm)|MG 151 (20 mm)|MG 131 (13 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* A choice between two presets:\n** 1 x 20 mm MG 151 cannon, nose-mounted (200 rpg) + 2 x 13 mm MG 131 machine guns, nose-mounted (300 rpg = 600 total)\n** 1 x 30 mm MK 108 cannon, nose-mounted (65 rpg) + 2 x 13 mm MG 131 machine guns, nose-mounted (300 rpg = 600 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|SC250JA (250 kg)|MK 108 (30 mm)|MG 151 (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 1 x 250 kg SC250JA bomb (250 kg total)\n* 2 x 30 mm MK 108 cannons, gunpods (wing-mounted) (35 rpg = 70 total)\n* 2 x 20 mm MG 151 cannons, gunpods (wing-mounted) (135 rpg = 270 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nJust like its predecessors, the G-14 should generally be utilised as an energy fighter/Boom and Zoomer. While it's fairly more manoeuvrable than other Bf 109's, its increased agility should be used for maintaining high speed and energy rather than dog fighting, since even the G-14 is only passable at best. Due to its excellent energy retention and climb rate, it is exceptionally good at stall fighting, since many fighters will not be able to keep up with its climb rate, giving it the opportunity to put overconfident pilots in vulnerable situations.\n\nWhen it comes to selecting armament, it is largely dependent on the role the pilot intends to fulfil. Equipping bombs should generally only be considered as a last resort or when air cover is sufficient to facilitate tactical bombing. The very potent 30 mm cannon and gun pods should generally only be done if there is a significant threat from enemy bombers and heavy fighters. Keep in mind that while the 30 mm shells pack a high explosive filling, their muzzle velocity and ballistic coefficient results in a slow and fairly inaccurate shell. If chasing after enemy fighters, with a minimal profile exposed, it is not unusual to see 30 mm shells doing minimal damage to wings due to not detonating. Ideally, the 30 mm should only be fired against large frame aircraft from angles at which they expose the most of the planes frame to ensure a detonation within the airframe. Keep also in mind that the Mk 108 only carries 65 rounds of ammo for the center-mounted cannon, and 35 per gun pod, making trigger pulls very costly (especially considering it's fire rate). As for belt selections for the Mk 108, it should generally be anything but the default belt due to the higher content of minengeschoss shells, beyond that it is personal preference since the difference is only cosmetic.\n\nAdding the twin 20 mm MG 151 gun pods, will substantially increase the G-14's fighting potential and longevity against other enemy fighters, due to carrying a total of 250 extra rounds. Additionally, the 20 mm's ballistic trajectory is very similar to the 13mm machine guns, allowing for firing both weapons simultaneously at an enemy target. However keep in mind that the gun pods will run out of ammunition faster than the centre-mounted one, so if it happens, it is usually a good indication of when it is time to head back to reload, as not much ammo will usually remain in the center mounted one afterwards. As for belts, it should generally be stealth or air targets, since every other belt option either sacrifices explosive content and contains more tracer rounds in exchange for better ground attack capabilities which are very poor even with the armoured targets belt.\n\nFinally, keep in mind it is possible to carry both 13 mm, 20 mm and 30 mm weaponry, however due to the 30 mm's aforementioned poor ballistic properties, it should be mapped to fire on a different button. Also remember that while gun pods can be swapped while on the airfield in game, the centre-mounted cannon '''can't''' and can only be changed from the hangar.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Auto control available || Controllable<br>Auto control available || Controllable<br>Auto control available || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Very fast climb rate with an optimal climbing speed of 250 km/h (IAS)\n* Good dive speed\n* Powerful and accurate armament with gun pods\n* Good engine performance compared to the [[Bf 109 G-6|G-6]]\n* Good rear visibility compared to the [[Bf 109 G-2|G-2]]\n* The most manoeuvrable rank IV Bf 109 in War Thunder, thanks to the working leading slats\n* Outstanding energy retention\n* Powerful anti-air armaments with the ability to mount three 20mm MG151 autocannons capable of destroying any plane you come across\n* Can WEP for significantly longer without overheating the engine than any other Bf-109 variant\n* All weaponry mounted in the nose, allowing easy aiming without having to worry about convergence\n\n'''Cons:'''\n\n* Not very manoeuvrable compared to other fighters at its BR range\n* Very bad compression\n* The standard 20 mm armament is lacking vs. heavy armoured targets such as tanks and pillboxes\n* Belt options for the 20 mm MG 151 cannon outside of stealth or air targets serve little purpose as it offers no substantial anti-armour capabilities\n* The rip speed is 790 km/h which makes power dives impossible\n* Many allied are faster in a straight line\n* Cockpit visibility by far not as good as in the [[Fw 190 (Family)|Fw 190s]] or most allied fighters, although there are less frames at the sides\n* Needs all performance upgrades to shine\n* Its only capable anti-armour weapon is a single 250 kg SC250JA bomb\n* Prone to severe turning when taking off in Sim due to the huge engine torque\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nIn 1943, the Bf 109 G-6 entered service. While its performance was less then stellar, its worth derived from the ability to be easily modified into a dedicated fighter bomber, high altitude interceptor or reconnaissance plane. Likewise, great care was taken to make sure the G-6 could fit heavy armament to attack bombers, which were beginning to appear in force over Germany, and the shortcoming of the Fw 190s at high altitude became increasingly apparent.\n\nIn 1944, the RLM approved the Bf 109 G-14, wishing to standardize fighter production. The G-14 was essentially a standardized version of the Bf 109, with all improvements found on late production G-6s, including an enlarged vertical tail surface, a new canopy and Flettner tabs, for better control at higher speeds. To make construction easier, it had a non-retracting tail wheel, and the distinctive bulges on the upper cowling, which housed the breech locks of the machine guns.\n\nIn addition, the new G-14 was fitted with a DB605ASM engine, a heavily modified engine also used in the early G-6. It featured Watermethanol injection (MW50), and an enlarged supercharger taken directly off a DB506, meaning the engine had a better performance at high altitude, while conversely, it had less output at lower altitudes.\n\nServing alongside the 109 G-10 and K-4 in the later stages of the war, it proved to be a less then stellar performer, being outperformed by the newest types the Western Allies brought into service. However, it performed admirably in its role, and with a good pilot, was more then a match for the large majority of Allied aircraft.\n\n=== Italian Service ===\n[[File:Bf 109 G-14-AS (RSI) (2).png|thumb|Bf 109 G-14/AS during a patrol]]\nBy February 27, 1943, the Regia Aeronautica had requested 500 aircraft, this request had specified that the 500 vehicles should be composed of 60% fighters and 40% bomber interceptors.\n\nIn fact, on 5 May 1943, Germany delivered to Italy 300 Bf 109 G (from different variants), 200 Ju 87 and Ju 88, 50 Me 210, 12 Do 217 and 60 DFS 230 gliders.\n\nA document dated 14 April 1943 and written by Field Marshal Albert Kesselring stated that \"after the training of pilots for German vehicles has been completed, the trained Italian units should be attached to the German task forces and participate with them in actions until further notice\", it also stated that the Italian units should be supported by German groups in charge of armament, maintenance and training.\n\nThe delivery of Bf 109s began on 19 April 1943, before the armistice the Regia Aeronautica received 15 Bf 109 F-4, 6 G-2, 10 G-4, 91 G-6, for a total of 122 aircraft.\n[[File:Bf 109 G-14-AS (RSI) (3).png|thumb|Bf 109 G-14/AS at the airport]]\nAfter the armistice and the creation of the Italian Social Republic (RSI), where the ANR (Aeronautica Nazionale Repubblicana) began receiving Messerschmitts in mid-1944, nine months after the armistice. The ANR received a total of 200 Bf 109s of the G-6, G-10, G-12, G-14 and G-14/AS versions.\n\nThe I Gruppo was formed in December 1943 and included 3 squadrons and became operational in January 1944, initially equipped with the C.205, then with some G.55. Finally, the I Gruppo deployed to Lonate Pozzolo and Malpensa where 51 Bf 109 of the G-10, G-14 and G-14/AS variants were assigned. On 27 April 1945 the aircraft of the I Gruppo were set on fire while those of the II Gruppo were handed back to the Germans on the field of Orio al Serio.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Images\n<gallery mode=\"packed-hover\"  heights=\"150\">\nImage:Bf 109 G-14-AS (RSI) (1).png|\n</gallery>\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Aircraft of comparable role, configuration and era\n* Focke-Wulf [[Fw 190 (Family)|Fw 190]]\n* Macchi [[C.205N2]]\n* Fiat [[G.55S]]\n\n== External links ==\n<!--''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''-->\n\n* [https://forum.warthunder.com/index.php?/topic/216830-messerschmitt-bf-109-g-14/ Official data sheet - more details about the performance]\n\n{{AirManufacturer BFW}}\n{{Italy fighters}}"}}