{"title":"Bf 109 G-6","pageid":210,"wikitext":{"*":"{{About\n| about = German fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = Bf 109 (Family)\n}}\n{{Specs-Card\n|code=bf-109g-6\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} German fighter {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27.\n\nThe Bf 109 G-6 is a difficult plane to fly when it is in stock configuration. Once upgraded, it performs well enough to even the playing field and allows an enjoyable experience. This variant is played much like its predecessors, by using energy fighting. Because of its poor performance, it's imperative to keep your energy state high at all times.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 5,500 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 636 || 616 || rowspan=\"2\" | {{Specs|ceiling}} || 21.3 || 22.1 || 14.0 || 14.0 || rowspan=\"2\" | 343\n|-\n! Upgraded\n| 705 || 668 || 19.3 || 20.0 || 27.6 || 19.5\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 437 || 408 || 260 || ~13 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 450 || < 390 || < 450 || > 715\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 5,700 m || 1,270 hp || 1,778 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 60 mm Bulletproof glass in front and rear of the cockpit.\n* 4-8 mm Steel plates on pilot seat.\n* 10 mm Steel plates around pilot's head.\n* 21 mm Steel plate on the rear of the fuel tank, with 4 mm plates surrounding it on other sides.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nThe Bf 109 G-6 performs badly in stock conditions with an armament that is vastly inferior to other fighters. This changes drastically with upgrades. They are listed in the order in which they should be acquired.\n\n# Offensive 13 mm (for removing the tracers and getting an idea of where your cannon rounds land)\n# Radiator\n# Compressor\n# Offensive 20 mm (the stock belts are abhorrent with only 25% of Minengeschoß rounds)\n# Engine\n# U4 modification (do not equip it now, the single 30 mm is a bit inconsistent)\n# Offensive 30 mm (for later use)\n# Engine injection\n# R5 modification (30 mm) or R6 modification (20 mm) depending on which you prefer, though generally, the 30 mm are very useful against bombers and the 20 mm are better for engaging fighters\n\nAfterwards, get all the cannon and machine gun upgrades and the remaining ones for better flight characteristics. Bombs and rockets should be ignored until you have researched everything else since they are not very useful in the G-6's role.\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|MK 108 (30 mm)|MG 151 (20 mm)|MG 131 (13 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* A choice between two presets:\n** 1 x 20 mm MG 151 cannon, nose-mounted (200 rpg) + 2 x 13 mm MG 131 machine guns, nose-mounted (300 rpg = 600 total)\n** 1 x 30 mm MK 108 cannon, nose-mounted (65 rpg) + 2 x 13 mm MG 131 machine guns, nose-mounted (300 rpg = 600 total)\n\nThe two machine guns are located just forward of the pilot firing out of the nose of the aircraft. The cannon (either 20 mm or 30 mm) is mounted in the propeller shaft and will fire through the propeller hub. The 30 mm cannon can only be installed once the corresponding module at tier III is unlocked. The best 20 mm belt is \"Air Targets\", the best 13 mm belt is \"IAI\" or \"Stealth\" and the best 30 mm belt is the \"Universal\" or \"Stealth\".\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|SC50JA (50 kg)|SC250JA (250 kg)|Wfr.Gr.21|MK 108 (30 mm)|MG 151 (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 4 x 50 kg SC50JA bombs (200 kg total)\n* 1 x 250 kg SC250JA bomb (250 kg total)\n* 2 x 30 mm MK 108 cannons, gunpods (wing-mounted) (35 rpg = 70 total)\n* 2 x 20 mm MG 151 cannons, gunpods (wing-mounted) (135 rpg = 270 total)\n* 2 x Wfr.Gr.21 rockets\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nWhen stock, you should side climb and enter combat with a superior altitude before engaging. Your enemies will render you ineffective if you don't have the height advantage. However, when it's fully upgraded you might omit side-climbing as the plane should generally get you either at the same altitude or above the opponent. WEP is very effective, so use it to get to an effective altitude in the least amount of time. The engine overheats quite fast, but it also cools down rapidly. Don't be afraid to use WEP even if your temperature is yellow or red.\n\nIf you're engaging an enemy while you have an energy advantage, you should do everything in your power to keep or regain this advantage while depleting his. The Bf 109 can achieve this through the use of energy traps like rope-a-dopes, and to disengage when a foe avoids your boom. When neither you or the enemy has an advantage, you should avoid head-ons with the least amount of energy waste. Most of the time the enemy tries to get back on your 6 o clock, which drains his energy much more than yours. This gives you the opportunity to extend, climb, or bait him into an energy trap. Should you, however, face an enemy with superior altitude or speed, attempt to evade his booms on you or force him to overshoot.\n\nWhen it comes to armament you have the choice of a 20 or 30 mm cannon in the engine, and gun pods of the same calibre. The 20 mm gun has good gun characteristics with decent damage and a good ammo count, while the 30 mm deals devastating damage but has a low ammo capacity and a very slow shell velocity. The gun pods aren't recommended in realistic battles as they dramatically decrease the plane's performance.\n\nIn Simulator, the Bf 109 G-6 is quite a friendly fighter that can perform many tasks. It offers great flight performance with its smooth handling, adequate speed, and impressive climb rate and turn rate. Its nose-mounted guns do not require any convergence setting, making it very easy to aim. The nose gently slopes down from the windscreen, offering great over-the-nose visibility. The late G models also have an improved canopy side with less frames, and the solid armour headset is replaced by a transparent bulletproof glass, allowing some rear views which is better over the F models. Said bulletproof glass, however, has a thick metal frame, thus you can only see through the middle at a small portion of the tail. Still this is better than not being able to see anything behind at all. There are bombs of 50kg/250kg to choose from which are beneficial for ground-pounding or base-bombing, although these are not its primary objectives. However, the Bf 109 G does have pretty limited cockpit view obstructed by its numerous canopy frames and handles. The inclusion of two 13mm MG131 creates two large, visible bulges on the nose, just in front of the windscreen, obstructing the pilot's downward view. The plane also behaves poorly during takeoffs due to its torquey engine. \n\nBring at least 30 minutes of fuel for prolonged patrolling and fighting. The convergence does not really matter, it might be anywhere between 250-600 m. Depending on the task you wish to complete (eg destroy enemy attackers), gunpods can be helpful, if available. Although they slightly worsen the flight performance, that extra burst mass can be the difference between a \"Hit\" and \"Aircraft destroyed\". Finally, you can set keys for vertical head movement, as lifting up your head a little helps improving the over-the-nose visibility which helps you to track target.\n\nTaking off in a late Bf 109 is harder than other aircraft, so one should familiarise themselves with the earlier 109s. When taking off, the Bf 109 will shift severely to the left side due to the huge torque, so consider setting keybinds for left and right brakes, as they are more effective at directional control than the rudder while on the ground. As the plane just lifts off the ground it will automatically roll to the left again due to the torque, so you must immediately roll a little right to keep it level, or the left wingtip will strike the ground. \n\nDogfighting in SB involves everyday RB tactics and manoeuvres such as Immelmann, Split-S, scissor, barrel roll, etc. Note: the Bf 109 handles very sluggishly in the roll axis at low speed, so take this into account if dogfighting at low speed/altitude. You can even pull the elevator fully for maximum agility, but only if you pull gently and gradually will the 109 manoeuvre as you wish. If the stick is pulled harshly and suddenly, the plane will start swaying around and enter a flat spin. The aircraft can quite easily recover from a flat spin by fully deflecting elevators downward and rudder to the opposite side of which the plane is spinning, and wait until it starts a dive and gather some speed to pull up. \n\n* If you want to engage bombers, consider bring gunpods to maximise your damage output. Against late-war heavy bombers like B-17, relying solely on the one central cannon might also work, but that requires more professional evading and longer aiming which is considerably more dangerous, as the bombers you see will be better armed. Choosing between the 30 mm and 20 mm gunpods is up to you. The extra two Mk 108 will significantly boost your one-second burst mass and damage which can be very destructive for experienced pilots doing deflection shots, however the pathetic 35 rounds each gun will not last long in, for example, \"destroy enemy bombers\" mission where there are ~10 aircraft to down. The pair of MG151 is more balanced in terms of ammo and velocity, although they do not pack as much punch in a short firing window. With the powerful Minengeschoß rounds, 1-3 passes are enough to destroy any aircraft. In fact gunpods can also be helpful in dogfights against fighters, as the slight decrease in performance does not matter a lot in simulator, rather the ability to cripple/destroy the target as soon as you get a chance to is way more important.\n* Landing may need practice for some. It is easy at first: decelerate and descent towards the runway, deploy combat, takeoff, landing flaps and gears in such order, fly at ~210 km/h before touchdown. Now note that you must align the plane with the airstrip correctly prior to touchdown and do not yaw/break one side too much when breaking, as the undercarriages are so close together that they cannot support such lateral force, causing the plane to wobble on the tires dangerously or even tilt towards one side, striking a wingtip into the ground. At last, you can break until the plane reaches a full stop and not worry about propeller strike.\n\n====Specific enemies worth noting====\n<!--Some concerning vehicles to worry about if playing this plane. (i.e. Japanese fighters will out turn you)-->\nYour worst enemies in the Bf-109 G-6 are the [[Spitfire (Family)|Spitfires]] and the [[P-47 (Family)|Thunderbolts]]. The Spitfire can out-turn you at almost all altitudes below 4,000 m. You have to be really careful when engaging a P-47 with an altitude advantage against you. The best thing you can do in that case is to turn away and keep climbing. If the Thunderbolt dives on you, turn into the head-on, fire a few rounds then use your superior roll rate to do a split-S. If a Spitfire engages you DO NOT try to turn with it! If you try, you will have fallen into their trap, your best defence is similar to the tactics employed against the Thunderbolt, split-S and use your roll rate.\n\n====Counter-tactics====\n<!--What to expect, if it would be in command of the enemy and how to counter it. (i.e. They will most likely BnZ, etc.)-->\nIf you're facing this plane, try to deplete its energy and force the plane either low or high. At higher altitudes, the engine performance is poor at best, and at lower ones, the plane loses energy quickly with no fast means to regain it. Avoid head-ons, as the enemy aircraft can potentially carry up to 3 x 30 mm guns.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Auto control available || Controllable<br>Auto control available || Controllable<br>Auto control available || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Extremely good climb rate, even at high altitudes\n* Very good energy retention\n* Great for stalling out enemies, as the stall control is excellent\n* Good low speed manoeuvrability without gunpods: you'll outturn planes like the P-47s and the early P-51s at low speeds\n* Can research 2 types of gun pods for greatly increased firepower\n* 30 mm cannons are extremely effective at bomber-hunting, allied with a great climb rate, will turn out to be a superb interceptor\n* 20 mm cannons are wonderful when dogfighting against fighters\n* The plane is overall very durable, with armour plates covering the only fuel tank\n* Very powerful engine when using WEP\n* Radiators are responsive and will keep the engine cooler for way longer than the G-2s\n* Rather manoeuvrable, in the hands of an experienced pilot may outturn late Spitfire models\n* Can feature a pair of Br.21 rockets, enabling it to take out even heavy tanks like the US T29 and Soviet IS-2 in tank realistic battles\n\n'''Cons:'''\n\n* Engine produces less horsepower on 100% throttle than the Bf 109 G-2, while being about 200 kg heavier\n* Poor armament: unless using gunpods, head-ons should be avoided at all costs\n* Outdated airframe means compression speed and rip speed are lower than most enemies you'll face\n* Undergunned and underpowered when stock\n* Engine still overheats, although not that often as the F or the G-2 models\n* Mounted weaponry/payloads will reduce flight performance significantly\n* Low ammo count unless using gunpods, which sacrifice flight performance\n* 30 mm MK 108 cannons have too little ammo (35 rpg) to be an effective weapon in a battle\n* Flaps are very sluggish to deploy and they rip at low speed\n* 13 mm machine guns don't hit very hard\n* For Sim, the numerous canopy frames and razorback greatly limit the all-round view, and huge engine torque causes severe turning when taking off\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n=== In-game description ===\nThe Messerschmitt Bf 109 was a single-seat monoplane fighter used by the Luftwaffe before and during WWII. It was used as a fighter, interceptor, high-altitude interceptor, fighter-bomber and reconnaissance aircraft.\n\nThe Bf 109 G-6 \"Gustav\" was the most mass-produced variant of the Gustav series. It entered production in the late Autumn of 1942, and was initially designed as a universal platform which could be quickly converted to various roles as needed in field conditions. The G-6 was also equipped with improved engines, either with MW 50 methanol-water injection, or the high-altitude GM-1 nitrous oxide injection. The DB 605AS engine, which used 96-octane fuel, as opposed to 87-octane, could reach over 2,000 HP at 500 m and 1,800 HP at 5,000 m. These variants were designated Bf 109G-6/AS. The armoured seat had a transparent seat back, which significantly improved visibility. A total of 700 /AS aircraft were produced.\n\nIn addition to those changes, the G-6 was also the first to house the 30mm MK 108 cannon, which had 60 specially designed incendiary shells. A single hit was usually enough to destroy a single-seat fighter, most bombers needing no more than 4 or 5 hits.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=bf-109g-6 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n[[File:Bf 109 G-6 Erica Hartmann.mp4|thumb|\"Erica Hartmann\" collaboration camouflage|none]]\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Aircraft of comparable role, configuration and era\n\n* North American [[P-51 (Family)|P-51]] Mustang\n* Focke-Wulf [[Fw 190 (Family)|Fw 190]]\n* Kawasaki [[Ki-61 (Family)|Ki-61]]\n* Fiat [[G.55 serie 1|G.55]]\n* Macchi [[C.205N2|C.205]]\n\n== External links ==\n<!--''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''-->\n\n* [https://forum.warthunder.com/index.php?/topic/316100-messerschmitt-bf-109-g-6/ Official data sheet - more details about the performance]\n* [[wt:en/news/3202--en|[Warrior Profile] Ace of the Month - July - Captain Alexandru Şerbănescu]]\n\n{{AirManufacturer BFW}}\n{{Germany fighters}}"}}