{"title":"Bf 109 E-1","pageid":203,"wikitext":{"*":"{{About\n| about = German fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = Bf 109 (Family)\n}}\n{{Specs-Card\n|code=bf-109e-1\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} German fighter {{Battle-rating}}. It was introduced in [[Update 1.35]]. The second [[Bf 109 (Family)|Bf 109]] in the German aviation tech tree, introducing the Emil airframe to the player, it improves from its predecessor [[Bf_109_B-1/L|Bf 109 B]] in every regard. The E-1 is better in armament, climb rate, sustained turn rate and top speed. The Bf 109 E-1 is succeeded by the cannon-armed [[Bf 109 E-3|E-3]] variant.\n\nThe Bf 109 E-1 will most likely not be an immediate success for new players. While sporting a very respectable climb rate and good acceleration over its historic counterparts, the Bf 109 E-1 is not an easy plane to fly. That said, its light weight in relation to its engine performance allows the player to wield a pure-breed energy-fighter. However, it is lacking in two regards that often make it hard for new players to perform well in. First, while the Emil does have a good turn, its main historic enemies either turn equally well or better. Second, its armament (four MG 17 7.92 mm, 3,000 rounds) is usually insufficient to reliably dispatch enemies in a quick burst.\n\nThat being said, learning how to do well in the E-1 (and later E-3) will pay great dividends to the player in the long run. Alongside its main strength of a good power-to-weight ratio, the Bf 109 E sports a good roll rate, allowing for excellent manoeuvrability. This helps the plane during manoeuvres of all kinds, both in defensive or offensive situations. With this, a seasoned pilot will be able to get on the six of even the tightest turning Spitfire long enough to get their shots in. However, do not overextend for the latter, lest you end up with no speed to escape with.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 5,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 549 || 536 || rowspan=\"2\" | {{Specs|ceiling}} || 21.0 || 21.8 || 14.7 || 14.7 || rowspan=\"2\" | 358\n|-\n! Upgraded\n| 591 || 570 || 19.0 || 20.0 || 21.5 || 17.8\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 477 || 448 || 300 || ~12 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 450 || < 390 || < 400 || > 312\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 4,500 m || 960 hp || 1,037 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\nThere is no armour protection on the Bf 109 E-1, and the fuel tank is not self-sealing. The fuel tank is located behind the pilot's seat. The engine and cooling systems are located in the nose of the plane. This layout allows the pilot some protection, but the lack of real armour still leaves the pilot vulnerable.\n\n* No armour protection\n* Fuel tanks are not self-sealing (1 behind pilot)\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nIt is recommended to unlock all flight performance and survivability upgrades at first. The default 7.92 mm belts are good enough. Energy fighters require acceleration, they live and die by it. Therefore most of flight performance upgrades are advised: Compressor, Engine and Engine injection.\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|MG 17 (7.92 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 7.92 mm MG 17 machine guns, nose-mounted (1,000 rpg = 2,000 total)\n* 2 x 7.92 mm MG 17 machine guns, wing-mounted (500 rpg = 1,000 total)\n\nOf the four machine guns, two are mounted in the upper nose section just in front of the pilot, each armed with 1,000 rpg. The other two machine guns are mounted with one in each wing with a total of 500 rpg.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|SC50JA (50 kg)|SC250JA (250 kg)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 4 x 50 kg SC50JA bombs (200 kg total)\n* 1 x 250 kg SC250JA bomb (250 kg total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nWhen fighting in the Bf 109, the player needs to understand the concept of energy and maintain energy superiority over their foe at all times, while also keeping an eye on their surroundings and incoming bandits. To do this, use speed and altitude to your advantage, constantly shifting between the two in a fight. This calls for discipline on the side of the pilot, as you will often be tempted to bleed away speed or forgo attempts at gaining back altitude in hopes for a few more shots on targets. As your experience with the Emil grows, you will be able to more reliably judge when you can bleed speed/forsake altitude to obtain a positional advantage and when not to, but newer players with a too gung-ho attitude often get themselves into more trouble than they can handle.\n\nSadly, the E-1, with its limited armament, will often take too long to dispatch an enemy and thus prove unrewarding to one's efforts. Four 7.92 mm machine guns are mounted on this plane, providing a very different experience from Messerschmitt fighters in the game that follow it. The centre-mounted guns hold 1,000 rounds each, while the wings hold 500 each. This means that after some shooting, your effective firepower is halved. The 7.92 mm can be effective against enemy fighters when the pilot is accustomed to them, but they require certain patience to handle. Once accustomed to the ballistics, the player can opt to use stealth ammunition belts. This will ensure that the target moves less while being shot at (especially since the lower tiers have many new pilots), providing better and longer opportunities for shots. Also, the 7.92 mm bullets that the E-1 fires when using stealth belts are slightly visible, facilitating target adjustment while still being inconspicuous to the prey.\n\nAt engaging large and/or armoured targets such as bombers, the E-1's guns struggle hard. On bombers, specifically, aim for the engines and fuel tanks. The ammunition might not destroy the plane itself, but knocking out an engine or two helps other fighters with heavier armament and can also cause the plane to crash and attribute you the kill.\nThat said, if done well and left alone, the E-1 will stitch an enemy to death in many well-timed and executed attacks, which makes for a fulfilling experience. If you happen to mess up, extend from the bandit going into a very slight dive to help acceleration. Unless they are right on you, this allows you to gain distance and sets up a nice climbing match in which the Bf 109 E holds all the cards (unless it is facing enemies of later years). Diving away straight down can be done as a last resort but usually leads to you wasting way too much altitude.\n\nNew players should adopt a hit and run tactic with the Bf 109s (also known as Boom and Run). While often called a Boom and Zoom aircraft, the Bf 109s are not dedicated Boom & Zoomers, and many other aircraft such as the [[Fw 190 (Family)|Fw 190]] do it much better. That said, the 109s do build up speed quickly in a dive, and they have a respectable zoom climb that ends in a strongly sustained climb at ~270 km/h (optimal climbing speed 260, and dash 280 km/h). Doing so will often give the player the maximum speed or altitude advantage they can have over their chosen target. A straight-up bounce, with a short extension from the target and a slowly increasing climb leading into an Immelmann, tends to work best for rookie pilots. Remember to check your six and surroundings during the climb and just before diving back on your target.\n\n'''Simulator Battles'''\n\nIn Simulator, the Bf 109 E-1 is quite a friendly fighter that can perform many tasks. It offers great flight performance with its smooth handling, adequate speed, and impressive climb rate and turn rate. Its guns are scattered around the nose, which require little convergence setting, making it very easy to aim. The nose gently slopes down from the windscreen, offering great over-the-nose vision. There are also a few bomb options to choose from which are beneficial for ground-pounding or base-bombing, although these are not its primary objectives. Despite having a razorback, the Emils actually have great visibility towards the tail, increasing the pilot's situational awareness. Finally, the engine is not as powerful as the later models, making takeoff easier. However the E-1 does suffer from rather poor one-second burst mass given by the 4 x 7.92 mm MGs.\n\nBring at least 30 minutes of fuel for prolonged patrolling and fighting. The convergence does not really matter, it might be anywhere between 250-600 m. You can also set keys for vertical head movement, as lifting up your head a little helps improving the over-the-nose visibility.\n\nDogfighting in SB involves everyday RB tactics. Utilise common manuevers such as Immelmann, Split-S, scissor, barrel roll, etc. Note: the Bf 109 handles very sluggishly in the roll axis at low speed, so take this into account if dogfighting at low speed/altitude. You can even pull the elevator fully for maximum agility, but only if you pull gently and gradually will the 109 manoeuvre as you wish. If maximum elevator input is harsh and sudden, the plane will start swaying around and enter a flat spin. The aircraft can quite easily recover from a flat spin by fully deflecting the elevator downward and rudder to the opposite direction to which the plane is spinning, then wait until it starts a dive and gathers some speed to pull up.\n\nLanding may require practice for some. It is easy at first: decelerate and descend towards the runway, deploy combat, takeoff, landing flaps and landing gear, in order, fly at ~190 km/h before touchdown. If the plane bounces up with landing flaps, use takeoff/combat flaps instead to reduce lift. Note that you must align the plane with the airstrip correctly prior to touchdown and do not yaw or brake to one side too much when braking, as the main landing gears are so close together that they cannot support such sideways force, causing the plane to wobble dangerously or even tilt towards one side, striking a wingtip into the ground.\n\n====Specific enemies worth noting====\n<!--Some concerning vehicles to worry about if playing this plane. (i.e. Japanese fighters will out turn you)-->\n[[Spitfire (Family)|Spitfire]]- the great nemesis: Fast, agile and with a powerful punch. This recurrent enemy will change its traits in its development, but even in this early era, the Spitfire possesses them. The Spitfire Mk.I and Mk.II is on par in top speed above 2,000 m, but near sea-level, the E-series has 20 km/h more speed. Further, the 109 can get to these top speeds faster, due to its superior power-to-weight ratio. The latter also allows it to duel the Spitfire in defensive dogfights. In extended manoeuvres, the Spitfire can run out of energy, which the Bf 109 E-1 has fewer issues in regaining. Getting there can be done via scissoring, where the Emil also benefits from its far better roll rate. Yet at these close to stall speed dogfights (~230 km/h), the Spitfire can more easily pull high angle of attack manoeuvres, as it stalls way later than the 109. An alternative defensive manoeuvre is a spiral climb, followed up by a rope-a-dope, although this is only executable in [[Simulator_Battles|Simulator]].\n\nThe late LaGG-3s ([[LaGG-3-35|35]] and [[LaGG-3-66|66]] series) are a serious threat featuring many of the Bf 109 traits, including top speed, climb rate and manoeuvrability. For defensive manoeuvres, scissoring is one of the few options. In Simulator, the chance of throwing off the opponent by making them lose the sight of you is hard, as the LaGG has great frontal cockpit visibility but a bad rear view, coincidentally like the Bf 109 E-1.\nEarly LaGG-3s such as the [[LaGG-3-8|8]] and [[LaGG-3-11|11]] series are much easier to deal with. They are equal in manoeuvrability, but their engine performance is sub-par in every regard. Out-climbing or simply out-running after breaking off in scissors can help rid this pursuer. However, it can be hard to distinguish the different LaGG-3 series, especially in game modes without HUD.\n\nThe [[MiG-3-15|MiG-3]] is a high-altitude fighter. Do not fight it above 5,000 m. It lacks manoeuvrability but possesses great top speed and good energy retention at altitude.\n\nThe [[Yak-1B]] and [[Yak-7B]] are generally superior to the Emil series in turning and low altitude speed. The [[Yak-1]] is around equal in performance.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n[[File:FighterImage_Bf109E-1.jpg|thumbnail|right|In the hangar.]]\n\n'''Pros:'''\n\n* Great climb rate and acceleration\n* Great energy fighter\n* Good top speed\n* Overall performance compares favourably against historic counterparts\n* Good ammunition count\n* Decent high-altitude performance\n* Can double as a fighter-bomber, although not recommended\n* Can carry 250 kg of bombs\n\n'''Cons:'''\n\n* Water overheats quickly if WEP is used for too long\n* Unrewarding for newer pilots\n* Average rear cockpit visibility (SB)\n* Only small calibre guns, lacking in armament, compared to similar tier planes of other nations\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe Bf 109 E-1 is essentially the first \"modern\" Bf 109. While the earlier models (V [Prototype], A, B, C) were tested during the Spanish Civil War and developed out of the experiences made in that conflict, it took a few more years for it to develop into a true front-line fighter. The E-1 was the first of a new breed of [[Bf 109 (Family)|Bf 109]] fighters. Entering production in late 1938, the \"Emil\" quickly replaced its earlier brethren in service with the Luftwaffe. The distinctive chin radiator of the Jumo powered variants was replaced with two much subtler underwing-mounted versions integrated with flaps, and the cowling was redesigned to carry the Daimler-Benz 601 series of engines. The result was a much more aerodynamically efficient aircraft that was more than a match for the new Supermarine Spitfire that was entering service with the RAF around the same time the first Emils were rolling off the production lines. The Bf 109 E-1 was also sent into action with the Condor Legion in the Spanish Civil War during its twilight stages.\n\nEntering service in 1939, the E-1 would see combat in the early phases of WW2, quickly obtaining aerial supremacy over the skies of Europe. The Bf 109 E was able to outclass many of the standard fighters of the day and was a key component of the German Blitzkrieg tactics that dominated the early years of WW2. A small run of E-1B Jagdbomber versions were also created, capable of mounting up to 250 kg of bombs on a centreline pylon. The Bf 109 \"Emil\" would finally meet its match in the RAF's Hawker Hurricane and Supermarine Spitfire fighters that intercepted German formations during the Battle of Britain (where its limited fuel supply restricted combat effectiveness). By the beginning of the Battle, the Bf 109 E-1 was already being replaced or upgraded to the [[Bf 109 E-3]] MG FF cannon armed variant and improved E-4; however, some E-1s would still see combat before the end of the year. After the Battle of Britain's conclusion, the \"Emil\" series would ultimately lead to another major variant, the [[Bf_109_F-1|Bf 109 F]] or \"Friedrich\" that would form the basis of all following Bf 109s.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=bf-109e-1 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|XYQEDmFkMF8|'''Realistic: Bf 109 E-1 [Born Excellence!]''' - ''Jengar''|xV8bQU5m_iA|'''Bf 109 E-1 Gameplay and Review''' - ''DigitalDigging''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Aircraft of comparable role, configuration and era\n* [[C.R.714]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.ru/index.php?/topic/105629-pasport-bf-109-e1e3/ Official data sheet - more details about the performance]\n* Radinger, Willy & Otto, Wolfgang, Messerschmitt Me 109 - Das meistgebaute Jagdflugzeug der Welt - Entwicklung, Erprobung, Technik - Bf 109A bis 109K, Aviatic Verlag, Oberhachingen: 2011\n* [https://me109.info/ <nowiki>[Falcon's Messerschmitt Bf 109 Hangar]</nowiki> Bf 109E]\n* [[wikipedia:Messerschmitt_Bf_109_variants#Bf_109E English|[Wikipedia] Messerschmitt Bf 109 variants - Bf 109 E]]\n* [http://kurfurst.org/#Emil <nowiki>[Kurfürst]</nowiki> Performance Information Bf 109E]\n* [http://forum.warthunder.com/index.php?/topic/271405-vehicle-profile-bf-109-e-1/ <nowiki>[Vehicle Profile]</nowiki> Bf 109 E-1]\n\n{{AirManufacturer BFW}}\n{{Germany fighters}}"}}