{"title":"Bf 109 E-7 (Japan)","pageid":626,"wikitext":{"*":"{{About\n| about = premium Japanese fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = Bf 109 (Family)\n}}\n{{Specs-Card\n|code=bf-109e-3_japan\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium rank {{Specs|rank}} Japanese fighter {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27 as the Bf 109 E-3; it was renamed to the Bf 109 E-7 in [[Update 1.65 \"Way of the Samurai\"]].\n\nWhile essentially the same plane as the [[Bf 109 E-3|E-3]], the E-7 overcomes the inadequate MG FF for MG FF/M, featuring the powerful Minengeschoß rounfs. With two wing-mounted MG FF/Ms carrying 60 rounds each, the plane has an even more devastating punch. Fighting in the E-7 is essentially the same as with all Emil variants of the Bf 109.\n\nRemaining a great energy fighter versus its historical opposition, the E-7 is somewhat troubled by the fact that it often faces mid-to-later warplanes such as the [[P-47D-25]]. To engage these, make sure you have a clear energy advantage or, if attacked, fly defensively and attempt to bleed the enemies speed while pulling him down. The Bf 109 E-7 is often not regarded as a good turner, a reputation coming out of the fact that its main rival, the Spitfire, simply did it better. However, especially with combat flaps, the E-7 is a respectable turner able to out turn most planes that outperform it. Keep in mind though that one of the changes from E-3 to E-7 increased the frame's weight. Flat turning should only be reserved for extreme situations.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 5,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 544 || 532 || rowspan=\"2\" | {{Specs|ceiling}} || 21.3 || 21.8 || 14.0 || 14.0 || rowspan=\"2\" | 376\n|-\n! Upgraded\n| 594 || 570 || 18.7 || 20.0 || 26.5 || 17.8\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 487 || 471 || 280 || ~12 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 370 || < 370 || < 420 || > 250\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 4,800 m || 905 hp || 1,086 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 10 mm Steel plates behind the pilot.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|MG FF/M (20 mm)|MG 17 (7.92 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 20 mm MG FF/M cannons, wing-mounted (60 rpg = 120 total)\n* 2 x 7.92 mm MG 17 machine guns, nose-mounted (1,000 rpg = 2,000 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nUnlike its Emil variant predecessors, the Bf 109 E-7 has improved its flying characteristics, while packing the MG FF/M at its wings for maximum damage output. Respectable rate of climb and energy retention due its power-to-weight ratio allow the Bf 109 E-7 to perform BnZ tactics, however due to the limited ammo of the MG FF/M cannons, this role may be better left to more suitable aircraft, such as the Fw 190s. Instead, Bf 109 E-7 excels at energy fighting, capable of bleeding opponents of energy and quickly striking them down. Bf 109 E-7 has good manoeuvrability, and combined with strong flaps can deal with anyone trying to dogfight you. The Air targets belt for your MG FF/M is undoubtedly effective for most aircraft, while universal ammo for your MG 17 provides AI and AP-I rounds which are capable of setting aflame vital part of your opponents.\n\nRemember, altitude is everything, so make sure you are above your opponents. Thankfully the engine provides excellent speed and energy retention which makes climbing even higher without losing much speed easy. Once you are at altitude and found your opponents, analyze the situation and pick the right target to deal with. However if someone is above or has same altitude with you, don't attempt to head-on as your MG 17 cannot do much damage while the MG FF/M is less accurate at longer ranges. Instead, evade any shots from them by doing a barrel roll. If they try to turn vertically, you can turn in aggressively and attempt to shoot them down. After any engagement, regain your altitude ASAP. You don't want the opponent above your plane and destroy you without letting you to counter-attack. Be careful not to dive towards your opponents too steeply (600+ km/h), or you will crash without getting kill at all.\n\nThe 2,000 rounds in the pair of MG 17 are sufficient for sustaining battles, but the amount of MG FF/M rounds is a different story. Its cannon still utilizes the 60-round drum magazine, and its accuracy is mediocre at best. Once again, picking the right target can prevent you from burning through the cannon ammo in no time. Adjust your gun convergence to 250-400 m to maximize the effectiveness of MG FF/Ms. Refrain from attempting to catch bombers as the armament is not strong enough to reliably down them quickly, and also could get you killed from its defensive gunners. If your cannon has run out, the pair of MG 17 is still capable doing its job despite its low damage output. Most important of all: don't destroy ground targets as you don't have any kind of ordnance and save your ammo for your actual role: killing fighters.\n\nOverall, Bf 109 E-7 is fun to play, combining a stable platform, power-to-weight ratio, improved overall performance, and devastating armament. However, trigger discipline is mandatory as cannon ammo amount is limited. As long as you have enough energy in your Bf 109 E-7, this plane can overcome anything without worrying about being overtiered as this plane provide stable performance characteristics.\n\n'''Specified enemies worth noting''':\n\n* [[Spitfire (Family)|Spitfires]]: The bane of your existence. Not only boasting an extremely tight turn radius, but its armament (8 x 7.7 mm or 2 x 20 mm + 4 x 7.7 mm) is capable of shredding you if you are unaware of its presence. Its performance in low alt is excellent, and the opposite. If you find one on your six, do a barrel roll to make them overshoot at you. Climb slightly, and attempt to scissor as the Spitfire's roll rate is mediocre at best. Once they have bled most of their energy, rolling over and shooting them down should be easy as their wings are fragile even towards your 7.92 mm MG 17. If you are both at altitude, you can also lure them higher, as the Spitfire's engine begins to choke above 3,000 m. While so, if they force you into a sustained dogfight, pop your flaps to takeoff mode, and you may be able to outturn them. Also, remember the Spitfire engine is prone to overheating, and will soon have to break off from the fight. If they attempt to do straight flat evasion, use your speed and armament to take him down with ease. However, as a general of thumb, never attempt to dogfight Spitfire under any circumstances without proper support.\n\n* [[LaGG-3 (Family)|LaGG-3]]: LaGG-3s has devastating armament placed in its nose. Avoid head-ons as your MG 17 are inadequate to do this task. LaGG-3 has mediocre manoeuvrability, lousy energy retention, and inadequate rate of climb. Dogfighting LaGG-3 is a good option to exploit its weaknesses. Or, if your teammate has engaged with LaGG-3, don't miss the opportunity to destroy LaGG-3. You should outclimb him, and force him into dogfight where its engine performance is significantly worse once hit and the aircraft becomes a flying brick.\n\n* [[F4U (Family)|F4U-1 Corsair]]: Known for its gull-like wing, F4U Corsair has powerful M2 Browning which capable to shred your Bf 109 with single burst at well-placed aim. If its not enough, the Corsair could outrun and outdive you, so special awareness must be taken. However its strength has significant drawbacks: low rate of climb, poor manoeuvring energy retention, and poor performance at lower speed, making the Corsair nothing but an easy sitting duck in your sights. It should be noted despite the inverted gull wing being strong during steep dives, is actually not durable against enemy fire, especially 20 mm. If they are above you, make sure to lure them to your current altitude and provoke them into dogfight. Usually, most Corsair player will extend away if they couldn't hit you, however if they turnfight against you, pop your flaps into takeoff mode. Once they lose energy and prefer to run away, use your MG 17 to damage, or if lucky, set him on fire. If below you, watch your speed and decrease the throttle to prevent control stiffening during engagement. At this point, you have not only secured your altitude, but have greater energy to make another kill if you miss it. Low-altitude Corsair is dead Corsair, so don't miss this opportunity to secure your kill.\n\n* [[MiG-3 (Family)|MiG-3]]: This Soviet fighter has same armament as LaGG-3s. You'll mostly find it above your current altitude, so evade its guns and attempt the same as against LaGG-3. Fortunately, its manoeuvring capability is much worse than F4U and LaGG-3, so countering with a dogfight is the best option and you can secure the kill much easier even if they attempt to run away.\n\n* [[ITP (M-1)]]: Another worst nightmare beside Spitfire, this Soviet fighter not only has faster speed than most Soviet fighters, but also sports 2 x 20 mm ShVAK and a 37 mm NS-37 which can provide devastating damage to your fuselage in a very short burst. Worse still, the player with ITP will outclimb you by a large margin, and once that happens, he will perform BnZ at you without giving you room to evade if you are caught. Maintaining your energy is the only key to fight against ITP, and never attempt to head-on at any cost as it will end badly. Although ITP is manoeuvrable at high speed, it will not lose energy easily unless it attempts hard manoeuvring. If you find an ITP ground-pounding, analyze the situation before ambushing. Decrease your throttle if your speed is more than 450 km/h. If he notices you and pulls manoeuvres, pursue them and pepper them with your armament.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Auto control available || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Good energy retention\n* Lots of light machine gun ammo\n* Minengeschoss rounds are very hard-hitting against all aircraft\n* Can endure negative Gs without the engine dying (RB and SB)\n* The Bf109 has excellent cockpit visibility\n\n'''Cons:'''\n\n* Heavy on energy fighting and gaining altitude. The turning capabilities are not reliable\t\n* Hard to control over 500 km/h\n* MG FF/M cannons have low ammo capacity (60 rpg), and low muzzle velocity\n* Relatively poor durability \t\n* No suspended armament, limiting its ground attack capabilities\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nAlthough Imported, Japan decided to not pursue a license agreement with Germany over the Bf 109E. The Emil, (Nicknamed Mike) would stay in Japan until the end of the war.\n\n=== In-game description ===\nMesserschmitt Bf 109E \"Emil\" single-engine front-line fighter\n\nIn 1941, a Bf 109E prototype fighter was sold to Japan as a part of the German-Japanese military technical cooperation.\n\nThe aircraft was delivered to the Land of the Rising Sun without armament for flight tests. Japanese Hinomaru markings and a tail number of \"1\" were applied to the fighter, and then the machine underwent a complete cycle of flight tests at the Kawasaki Company's factory airfield. Comparative tests of the Bf 109E were also performed, with Japanese army fighters involved, such as the Nakajima Ki-43 Type 1 Hayabusa, the Nakajima Ki-44 Type 2 Shoki, and the Kawasaki Ki-61 Type 3 Hien prototype. The aircraft was piloted not only by the Japanese but also by a German test pilot named Willy Stor.\n\nThe Japanese were most of all interested in the Messerschmitt's DB 601 engine, whose licensed production was being mastered by the Japanese industry at the same time and which was to be mounted on the Ki-61 Hien, the newest fighter being developed in Japan. That is why the Bf 109E itself, as well as any prospects of its licensed manufacture, aroused minimal interest among Japanese specialists.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=bf-109e-3_japan Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed-hover\" heights=\"200\">\nImage:Bf-109 E7 (Then Bf-109 E3) Old Camo.jpg|<small>Old camouflage scheme of the Bf 109 E-3 which was later changed in-game to the '''{{Specs|name}}'''.</small>\n</gallery>\n\n;Videos\n{{Youtube-gallery|EsKZScFwXqA|'''Japanese Opinion on the Bf 109''' - ''Military Aviation History''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Aircraft of comparable role, configuration and era\n\n* [[IAR-81C|IAR-81]]\n* Kawasaki [[Ki-61 (Family)|Ki-61]]\n* Macchi [[C.202 (Family)|C.202]]\n* Macchi [[C.205 (Family)|C.205]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/287348-messerschmitt-bf-109-e-7u2/ Official data sheet - more details about the performance]\n\n{{AirManufacturer BFW}}\n{{Japan fighters}}\n{{Japan premium aircraft}}"}}