{"title":"Bong's P-38J-15","pageid":177,"wikitext":{"*":"{{About\n| about = American twin-engine fighter '''{{PAGENAME}}'''\n| usage = other variants\n| link = P-38 (Family)\n}}\n{{Specs-Card\n|code=p-38j_marge\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_p-38j_marge.jpg\n|market=Richard Bong%27s P-38J-15 Lightning(USA)\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\n'''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} American twin-engine fighter {{Battle-rating}}. It was available in [[Update 1.57 \"Battle March\"]] as a reward vehicle for the [[wt:en/news/3681-special-event-series-chronicles-of-world-war-ii-day-28-faq-added-en|2016 \"Chronicles of World War II\"]]. The plane is painted after the camouflage scheme of American pilot Richard Bong of the US Army Air Forces, who is the highest-scoring American pilot ace with 40 kill credited in a P-38.\n\nThe P-38J is a sleekly designed, twin-engine monoplane by Lockheed. This plane has a top speed of 431 mph (694 km/h) with an airspeed warning at 460 mph (740 km/h). The weaponry installed is 1 x [[AN/M2 (20 mm)|20 mm AN/M2 cannon]] with 4 x [[Browning M2 (12.7 mm)|12.7 mm Browning machine guns]]. Further expanding the role, with upgrades, it can be equipped with either rockets or bombs to further allow it to conquer and dominate the battlefield, whether that be air or ground.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 7,921 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 667 || 649 || rowspan=\"2\" | {{Specs|ceiling}} || 22.6 || 23.4 || 15.9 || 15.9 || rowspan=\"2\" | 332\n|-\n! Upgraded\n| 720 || 693 || 20.4 || 21.5 || 24.3 || 19.6\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 565 || 495 || 250 || ~9 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 380 || < 460 || < 500 || > 420\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 7,500 m || 2,540 hp || 2,845 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 6.5 mm Steel - Fore cockpit armour plating\n* 6.5 mm Steel - Pilot's seat\n* 9.5 mm Steel - Pilot's headrest\n* 38 mm Bulletproof glass - Windscreen\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|AN/M2 (20 mm)|M2 Browning (12.7 mm)}}\n\n'''''{{PAGENAME}}''''' is armed with:\n\n* 1 x 20 mm AN/M2 cannon, nose-mounted (150 rpg)\n* 4 x 12.7 mm M2 Browning machine guns, nose-mounted (500 rpg = 2,000 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|AN-M64A1 (500 lb)|M8}}\n\n'''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x 500 lb AN-M64A1 bombs (1,000 lb total)\n* 6 x M8 rockets\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nWhen playing the P-38J climb to a high altitude, search for the enemy, locate the enemy you feel confident in engaging.\nOnce these steps have been, ticked-off the check-list. Assuming you are above the enemy target: Put the plane into a gradual descent, which gives you and allows you to maintain the speed advantage. As you are descending; make small corrections on your path, so you don't give the element surprise away by overshooting the enemy.\nNow you are about one to two seconds away, from your target. Line your sights up, with your sights on the tail and fire a burst with your cannon and machine guns. You have now shot down your target. Why keeping the momentum, climb back up to the height you where before and repeat for the best results.\n\n'''Ground Battles'''\nUsing this plane in ground battles, is very effective once you have unlocked the appropriate modules. FMBC Mk.1 allows you to equip two x 500 lb bombs, these are mounted under the wings. To help get the bombs on target, use the machine guns to help predict where the bomb will fall. To do this, put the plane into a steep dive. As you near the ground and start getting closer, fire the machine guns. Using a short burst, if the burst hits the area or target you are aiming for; drop the bombs then pull up.\n\nThey are great for destroying, tanks, bunkers and ships. M10 Bazooka module allows you to equip your P-38J with two bazookas, each one has three rockets in total you get six rockets. These are attached to the lower nose panel, and are very accurate. These are ideal for destroying tanks and bunkers.\n\nOnce the ground units have been destroyed, you can use this to plane dominate the air and keep the enemy bomber and fighters away. This will help you secure that much wanted victory.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Auto control available || Controllable<br>Auto control available || Controllable<br>Auto control available || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent speed, acceleration, and climb rate\n* Very powerful armament, great for bomber hunting\n* Armament being positioned in the nose allows it to have great and fearsome head on capability\n* Multiple armament presets: Gives it a wider role it can have external Bombs or Rockets mounted\n* Good roll and turn time\n* Good overall visibility in simulator matches\n* Great air superiority aircraft\n\n'''Cons:'''\n\n* Wing fuel tanks, prone to fuel tank fires when shot\n* Unable to dive to put wing fires out, without breaking wings\n* Easy to rip wings in dives, no air/drive breaks as installed on P-38L\n* Easy to black out if crew vitality is low, i.e. G-force and stamina are low\n* Low cannon ammunition amount, compared to other planes in the tier\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe concept of the plane was made in February 1937 when the US Army Air Corps made a requirement for a plane that had twin-engine and can act as a high-altitude interceptor that can hold a large amount of armament and ammunition. The term \"interceptor\" was used for the aircraft by the requirement authors, 1st Lt Benjamin S. Kelsey and Gordon P. Saville, to bypass the Air Corps' strict requirements on aircraft designs at the time. The specifications laid by this new requirements also called for a maximum speed of 360 mph (580 km/h) and able to climb to 20,000 ft altitude in six minutes, making it the toughest specifications at the time. Design proposals were made for the specifications, one of which would become the [[P-39 (Family)|Bell P-39 Airacobra]], but it was the Lockheed design team headed by Hall Hibbard and Clarence \"Kelly\" Johnson that made the final product. They made many designs with a twin-engine configuration. The prototypes made for the design used a twin-boom design to hold all the components of the aircraft. Various armaments were tested on the aircraft, from different machine gun combinations and autocannons. It was finally settled to four M2 .50 cal machine guns and one Hispano 20 mm autocannon. The aircraft armament configurations, all at the nose of the aircraft, was very unusual for American aircraft design, as most of their designs and those of their foreign contemporaries had the armament mounted on the wings angled forward. Because of this mounting, the aircraft is able to fire at a longer distance accurately than wing-mounts.\n\n===Combat Usage===\nThe P-38 performed very well in the Pacific and European theatres during World War II. They were used in roles such as bombers escorts, escort V.I.Ps, performing reconnaissance over enemy locations, combat air patrols, ground attack, search and rescue and other important and critical roles.\n\n===Survivors===\nUnfortunately, it is estimated that only five P-38Js survived to this day and of these, only two of them are still airworthy.\n\n=== Richard I. Bong ===\nRichard Ira Bong was born in Superior, Wisconsin, on 24 September 1920. He grew up on a farm in Poplar, WI, where he gained an interest in aviation while watching planes fly overhead. Bong enrolled in the Civilian Pilot Training Program (CPTP) in 1938 while attending Superior State Teachers College (now University of Wisconsin-Superior). He also took private flight lessons, and on 29 May 1941, he enlisted in the Army Air Corps (USAAC) Aviation Cadet Program.\n\nAfter training in California, Bong was commissioned as a second lieutenant on 19 January 1942, when he was awarded his pilot's wings. He was assigned to Luke Field, Arizona, as a gunnery instructor from January to May 1942. His next assignment was to the 49th Fighter Squadron (FS), 14th Fighter Group at Hamilton Field, California. He was assigned to the 49th Squadron on May 6, and with that squadron he was trained to fly the Lockheed P-38 Lightning; 49th Squadron was based at Hamilton Field, CA at the time.\n\nOn 12 June 1942, Bong buzzed (flew low) over a house in San Anselmo belonging to a pilot who had just been married. Bong was cited and grounded after the incident, along with three other pilots who had looped around the Golden Gate Bridge. General George C. Kenny, commander of the Fourth Air Force, reprimanded him. Bong always maintained that he had not done so, but was forced to stay behind when the squadron was sent to England in July of 1942. He was then transferred to 84th Fighter Squadron of the 78th Fighter Group which was also based at Hamilton Field.\n\nBong was then sent to the Southwest Pacific area, when he was assigned to the 9th Fighter Squadron on 10 September 1942. At the time, the squadron was flying Curtiss P-40 Warhawks from Darwin, Australia. While awaiting the delivery of P-38 Lightnings, the 9th FS was transferred temporarily to the 39th Fighter Squadron, 35th Fighter Group, based in Port Moresby, New Guinea. Bong scored his first aerial victories on 27 December when he shot down a Japanese A6M \"Zero\" and a Ki-43 \"Oscar\" over Buna. For his actions during the battle of Buna-Gona, Bong was awarded the Silver Star.\n\nIn January 1943, Bong was reassigned to the 9th FS, based out of Schwimmer Field (near Port Moresby), which had by then been equipped with P-38 Lightnings. On 26 July, Bong participated in an action in which he would down four enemy aircraft over Lae. For this action he earned the Distinguished Service Cross. He was promoted to Captain in August.\n\nDuring November and December, Bong was on leave in the United States. During this time, Bong met Marjorie Vattendahl and began dating her. When he returned to the southwest Pacific in January 1944, he named his P-38 \"Marge\" and painted a picture of her on the nose. Bong shot down his 26th and 27th aircraft on April 12, and was later promoted to major by General Kenny. Afterwards, he was sent to see General Henry \"Hap\" Arnold in the United States, and he was given a leave. After Bong went on a war bond promotion tour through 15 states, he returned to New Guinea in September. His assignment was to the V Fighter Command as an advanced gunnery instructor. He was allowed to fly on missions, but not to seek out any sort of combat. He flew out of Leyte during the Philippines campaign, and by 17 December 1944, he had attained a total of 40 confirmed aerial victories.\n\nBong considered his gunnery skills as lacking, and as such decided to fly as close to the enemy as possible before shooting. In one case he even collided with an enemy aircraft, claiming it as a probable kill.\n\nCommander of the Far East Air Force, General Kenny, recommended for Bong to receive the Medal of Honor; it was awarded to him by General MacArthur in December of 1944. Bong was sent home permanently in January of 1945 by General Kenny. He married Marjorie Vattendahl on 10 February 1945.\n\nBong became a test pilot for the Lockheed Corporation's Burbank plant in California. On 6 August 1945, Bong took off in a Lockheed F-80 Shooting Star (44-85048), with a previous total of four hours and fifteen minutes - 12 flights - of flight experience in the F-80. During the takeoff, the main fuel pump failed, and Bong ejected. Unfortunately, he was too low for his parachute to deploy, and he died in the event. He was buried at Poplar Cemetery in Poplar, Wisconsin.\n\n=== Notable pilots ===\n[[File:Richard_Bong_portrait.jpg|thumb|none|300px|link=User:U64962917#Bong,_Richard_I.|Major [[User:U64962917#Bong, Richard I.|Richard Bong]] had one of the most recognizable nose-art of the war, a photo of his future wife and her name ''Marge'' as seen in-game on {{PAGENAME}}.]]\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=p-38j_marge Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|wPPrE_VduOI|'''The Shooting Range #263''' - ''Metal Beasts'' section at 00:28 discusses {{PAGENAME}}.}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Aircraft of comparable role, configuration and era\n* Northrop [[P-61C-1|P-61]] Black Widow\n* Savoia-Marchetti [[SM.92]]\n\n== External links ==\n<!--''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''-->\n\n* [https://forum.warthunder.com/index.php?/topic/272428-lockheed-p-38j-15/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Lockheed}}\n{{USA twin-engine fighters}}\n{{USA premium aircraft}}"}}