{"title":"C. 205 serie 3","pageid":644,"wikitext":{"*":"{{About\n| about = Italian fighter '''{{PAGENAME}}'''\n| and\n| usage = other versions\n| link-1 = C.205 serie 1\n| link-2 = C.205N2\n}}\n{{Specs-Card\n|code=mc-205_serie3\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_mc-205_serie3.jpg\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Italian fighter {{Battle-rating}}. It was introduced in [[Update 1.69 \"Regia Aeronautica\"]] along with the initial Italian aviation tree.\n\nThe C.205 serie 3 is a refinement of the C.205 serie 1, which was a development of the C.202. The serie 3 addresses the main issue of the serie 1, which is its highly underwhelming firepower. The wings now each hold a 20 mm MG151/20 cannon which accompany what used to be the primary armament, 2 x 12.7 mm machine guns mounted above the engine cowling. The extra weight on the Daimler-Benz 605 engine marginally reduces flight performance and its faces more formidable foes due to its higher battle rating, but the serie 3 remains competitive with its peers as a versatile fighter comfortable with boom-and-zoom, energy fighting, and turning engagements as the situation requires. Anyone caught on the receiving end of its twin cannons will seriously rethink their choices as their plane is ripped to shreds.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\nThe aircraft has a very good roll rate and generally good acceleration both in level flight and when diving. Overall handling is good and energy retention in level flight and in the vertical is very good. Control lock up starts with the rudder past 500 - 550 km/h with the test of the control surfaces steadily locking up past 600 - 650 km/h. Players should make sure to leave enough altitude to pull out of a steep dive. The control lockup prevents the wings from tearing due to excessive G-force. The engine maintains a lot of power even past 5,000 metres and takes a while to overheat.\n\nFor full real control pilots, the left wing is slightly longer than the right to counter the torque of the engine. This can cause the aircraft to roll to the side even when making a slight change in pitch.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 7,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 648 || 630 || rowspan=\"2\" | {{Specs|ceiling}} || 20.1 || 20.8 || 15.5 || 15.5 || rowspan=\"2\" | 250\n|-\n! Upgraded\n| 699 || 672 || 18.0 || 19.0 || 23.5 || 19.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 845 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || 535 || 450 || 260 || ~14 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 400 || < 270 || < 550 || > 380\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 50 mm Bulletproof glass - Windscreen\n* 8 mm Steel - Behind pilot\n* Decent build quality, can take some punishment\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|MG 151 (20 mm)|Breda-SAFAT (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 20 mm MG 151 cannons, wing-mounted (250 rpg = 500 total)\n* 2 x 12.7 mm Breda-SAFAT machine guns, nose-mounted (400 rpg = 800 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nC.205 Serie 3 is not just a mere upgrade from [[C.205 serie 1]], now it features a pair of 20 mm MG 151 cannons which mean that executing Boom-and-Zoom and bomber intercepting is now very possible with greater chance of success. The flight performance still remains competitive for its BR thanks to the powerful DB-605A engine.\n\nRemember, altitude equals advantage. Keep climbing at 20 degrees. Once you've reached 4,000 m, lower the climbing angle to 15 degree to increase speed. Make sure to watch your speed as you climb, you might not want to risk yourself being hit or destroyed by enemy fighter who has a speed advantage over you. The engine will still perform well up to 8,000 m. Use this opportunity to scour for enemy planes, or dive down toward bombers and enemy fighters. If you spot the enemy at your altitude, stop climbing or climb a little to regain your speed. The DB-605A engine provides exceptional speed at higher altitude, which is helpful for 1-on-1 engagements.\n\nIf you're getting tailed by enemy fighters, do an Immelmann turn, and scissor to drain enemy fighters' energy. Once your enemy has lost its energy to pursue and begun to stall, use your flaps when pitching up to your enemy, and you can proceed to shoot it down when the time is right. Roll rate in C.205 serie 3 is also good at both medium and high speed, use this to make your enemy overshoot you and run out of their ammo. C.205 also has exceptional manoeuvrability in higher speeds even carrying a pair of 20 mm MG 151, but don't expect to outturn Spitfires and Yaks as you'll bleed your energy and become an easy target. The combat flaps are strong, as long as you can keep your speed at 600 km/h while dogfighting.\n\nWhile the 12.7 mm Breda-SAFAT still remain on this aircraft, the most prominent feature of the C.205 serie 3 is an additional pair of 20 mm MG 151 on the wings, replacing the 7.7 mm Breda-SAFAT machine guns. Here, with a total of 500 rounds for the 20 mm, you should be able to destroy a fighter with a single burst or a bomber with good shot placement at their wings or fuselage once equipped with the Air targets belt which consists mostly of deadly Minengeschoss shells. While the 12.7 mm Breda-SAFAT loses its effective firepower beyond 300-400 m, you can load them with the Tracers belt which is helpful to ignite plane component, although not as easily as the American [[M2 Browning (12.7 mm)|M2 Browning]] does. You can set gun targeting distance at 400 m, which is best for intense dogfighting, or pursuing your enemy.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Good for boom-and-zoom attacks\n* Good performance above 4,000 m (13,000 ft)\n* Very solid armament, twin 20 mm MG 151 cannons offer practically twice the internal firepower of contemporary Bf 109s like the [[Bf 109 G-2/trop|G-2/trop]]\n* Great ammunition pool\n* Can be used as interceptor against bombers\n* Relatively tough\n\n'''Cons:'''\n\n* Average climb rate means it can find itself below or at equal altitude to the enemy at times\n* Very sluggish at low speed\n* When stock, the cannons are surprisingly inaccurate and tend to \"shotgun\" a bit\n* Breda-SAFAT machine guns have a low muzzle velocity and don't hit very hard\n* No suspended ordnance, limited utility against ground targets\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nThe Macchi C.205 was a development of the famous [[C.202]] \"Folgore\". The Folgore was the most modern and effective domestic fighter available to the Regia Aeronautica when it was introduced in 1941, proving itself well against Allied Spitfires, Hurricanes, and P-40s. It did still have a number of flaws, including the weak armament of only two heavy machine guns and two rifle-caliber machine guns. This was insufficient for attacking heavily protected American bombers. The design still had further developmental potential and the improved C.205, initially designated the C.202''bis'', mainly differed by the installation of a German DB605 engine (used by the German Bf 109G series) instead of the license produced DB601 used by the C.202.  The DB605 was heavier and more powerful but had very similar dimensions, easing the transition. The resulting aircraft had much improved performance over the C.202, comparable to the other Italian \"''Serie 5''\" aircraft powered by the DB605: the [[G.55 (Family)|Fiat G.55]] and the [[Re.2005 serie 0|Reggiane Re.2005]]. The C.205 had the worst handling at high altitudes due to its relatively small wings and high wing loading. Its strengths were in speed and diving abilities at low and medium altitudes. Its similarity to the existing C.202 was a significant advantage, especially compared to the high performing but very complex Re.2005, and it was chosen for mass production along with the G.55.\n\nThe early \"Veltro\" (\"Greyhound\") models of the C.205 were outwardly similar to the C.202, having only minor revisions to the airframe. After the initial [[C.205 serie 1|C.205 ''serie 1'']], which retained the Folgore's inadequate armament, the '''C.205 ''serie 3''''' replaced the wing-mounted Breda-SAFAT 7.7 mm machine guns with German 20 mm MG151/20 cannons. This gave the ''serie 3'' a potent punch. No further Veltro marks were produced, as development turned to the [[C.205N2|C.205N \"Orione\"]] with more radical changes to the aerodynamics and firepower. Interestingly, the ''serie 2'' was supposed to be produced by Fiat, but the factory tasked with it was destroyed by bombing and no such aircraft were made.\n\nLike its predecessor, the C.205 performed well in Sicily, Tunisia, and other operational areas. It had competitive agility and speed and was praised by Allied pilots as an excellent aircraft and dangerous opponent in the hands of skilled Italian pilots. The C.205 was involved in a number of storied engagements. For example, in the Battle of Pantelleria of April 1943, a force of 33 Macchi fighters (largely C.205s with a handful of C.202s) engaged a much larger number of Spitfires and claimed 15 kills for only 3 losses. The kill claims were contradicted by Allied loss reports, but said reports stated that only 2 C.205s were shot down with one possibly making an emergency landing.\n\nA small number of C.205s were used by the Italian Co-Belligerent Air Force after the Kingdom of Italy signed an armistice with the Allies, but they were soon supplanted by lend-lease aircraft like the [[P-39 (Family)|P-39]]. The opposing Italian Social Republic reorganized under Mussolini continued to produce and fly Veltros with the Aeronautica Nazionale Repubblicana. Allied bombing raids eventually put an end to C.205 production by April 1944. While the C.205s continued to fight effectively against the Allies, attrition dwindled their numbers and they were largely replaced by -G and -K series Bf 109s.\n\nAfter the war, an order of 60 C.205s consisting of refurbished airframes and C.202 conversions was delivered to the Egyptian Air Force, who used them in combat against Israeli aircraft from 1948-1949. Later batches were redirected to the postwar Italian Air Force after Israel's war for independence had ended. The Veltro continued to serve with Italy until 1951. The last example was decommissioned in 1955, at which point the jet age was well underway.\n\nBesides Egypt, the C.205 had a few other foreign users. The Luftwaffe briefly equipped a unit with C.205s in late 1943. Reception to the Veltro was lukewarm: the flying characteristics were generally deemed good, maintenance was difficult, and the radios were unreliable. The inverted throttle compared to German aircraft also led to several accidents. The Italian aircraft were soon replaced by Bf 109s and returned to Italy. The Independent State of Croatia had 4 C.205s in their inventory that were largely unremarkable. In a bomber interception in mid 1944, two C.205s and three C.202s were shot down by defensive gunners and P-51 Mustangs, with only one C.205 limping home.\n\nThe three ''serie 5'' fighters were each considered some of the best Italian aircraft of World War II by their pilots and opponents. The C.205 was perhaps the least glamorous of the trio, having the worst general handling and high altitude performance, but its heavy heritage from the proven C.202 was a considerable strength. And like the racing dog it was named after, it was fast.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n{{Youtube-gallery|DwbexTKZA-A|'''The Shooting Range #49''' - ''Pages of History'' section at 07:02 discusses the C.205.}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''encyclopedia page on the aircraft;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/365071-macchi-c205-serie-3/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Macchi}}\n{{Italy fighters}}"}}