{"title":"Do 217 J-1","pageid":240,"wikitext":{"*":"{{About\n| about = German heavy fighter '''{{PAGENAME}}'''\n| usage = other variants\n| link = Do 217 (Family)\n}}\n{{Specs-Card\n|code=do_217j_1\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} German twin-engine fighter {{Battle-rating}}. It was introduced in [[Update 1.29]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 5,500 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 450 || 434 || rowspan=\"2\" | {{Specs|ceiling}} || 34.4 || 36.1 || 4.2 || 4.0 || rowspan=\"2\" | 750\n|-\n! Upgraded\n| 486 || 469 || 31.7 || 33.0 || 8.0 || 5.9\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| X || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || N/A || 381 || 270 || ~6 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 290 || < 360 || < 360 || > 315\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 8.5 mm Steel - Fore-cockpit plate\n* 8.5 mm Steel - Pilot's seat\n* 50 mm Bulletproof Glass\n* 8.5 mm Steel - Dorsal gunner's plate\n* 5 mm Steel - Belly gunner's plate\n* 8.5 mm Steel - Belly gunner's upper plate\n* 5 mm Steel - Rear boom plate\n* 5 mm Steel - Aft plate\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nNew 20 mm belts are a good start for this machine. The extra punch of the air-belts is useful. Otherwise, there is not a lot worthwhile to go for weapons wise. Long burst are not needed, turrets are not a game changer and the 7.92 mm's aren't the meat of this plane. However for unlocks in tier I/II ''Offensive 7 mm'' and ''Turret 13 mm'' outclass the alternatives (except Compressor!)\n\n''Compressor'', ''Engine'', ''Wings repair'' and ''Engine injection'' are the desirable first performance upgrades.\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|MG FF/M (20 mm)|MG 17 (7.92 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 4 x 20 mm MG FF/M cannons, chin-mounted (200 rpg = 800 total)\n* 4 x 7.92 mm MG 17 machine guns, nose-mounted (700 rpg = 2,800 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|SC50JA (50 kg)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 8 x 50 kg SC50JA bombs (400 kg total)\n\n=== Defensive armament ===\n{{Specs-Avia-Defensive}}\n<!-- ''Defensive armament with turret machine guns or cannons, crewed by gunners. Examine the number of gunners and what belts or drums are better to use. If defensive weaponry is not available, remove this subsection.'' -->\n{{main|MG 131 (13 mm)}}\n\nThe '''''{{PAGENAME}}''''' is defended by:\n\n* 1 x 13 mm MG 131 machine gun, dorsal turret (500 rpg)\n* 1 x 13 mm MG 131 machine gun, ventral turret (500 rpg)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThis heavy fighter has only limited capabilities, due to low manoeuvrability. Here are some of them:\n\n;Head-on fighting\n\nThis tactic is good for one reason: you have an arsenal of guns in the nose. Find a lone fighter and engage it head-on. If he tries to engage you, go ahead (unless he has hub mounted 37 mm cannon like some Yak versions, in that case don't engage). But keep in mind that you will need to wreck the enemy aircraft so you don't damage your aircraft. If the enemy dodges the attack and tries to attack you from behind, then you are in a dangerous situation. This tactic is risky, but if you have a wingman fighter or two, it shouldn't be a problem.\n\n[[File:FighterImage_Do217j1img1.jpg|thumbnail|right|Do 217 showing fuselage and wing structure.]]\n\n;Ground attack\n\nThere are 2 kinds: with bombs or without. The problem is that bombs will make you even less manoeuvrable and you cannot dive bomb, so unless you are really confident, don't use them. Use your guns on soft targets and you will score success. But don't go too low, or you will crash as your manoeuvrability is poor.\n\nThe 8x 50 kg bombs are of little use even in simulator battles. They contain little explosive, resulting in a very small blast radius. The Do 217 J also happens to have no bomb sight, which makes dropping those small bombs accurately very challenging with the cockpit view. Ground pounding therefore should not be the primary mission for the Do 217.\n\n;Bomber interception\n\nAfter seeing the armament this plane carries, you might think that hunting bombers will be an easy task. To a certain degree, yes. The main flaw in this tactic that bombers are usually flying at altitudes you can't reach and your climb rate is also poor. Instead, try to engage the bombers flying at low to medium altitude, usually performing dive runs. They are easy prey, but if they are escorted by fighters, try to take those out first in head-on attacks or have fighters assist you.\n\nIn Simulator, the Do 217 J is a good tool for the bomber-hunting playstyle. Its large size allows it to carry a heavy-punching armaments of 4x 20 mm MG FF/M cannons plus 4x 7.92 mm MG17 machine guns in the nose, with each holding plenty of ammunition. This firepower at its BR is something that cannot be ignored by any bomber. However, the high weight of the Do 217 means that it has very slow acceleration and climb rate, which can make it hard to catch up to a target sometimes. Its lack of manoeuvrability also strictly limits its targets to similarly heavy aircraft. Finally, it has extremely restricted field of view due to the thick canopy frames and no glass towards the back at all. You even may need to use the gunner view like a bomber just to be aware of your surroundings.\n\nWhen taking off, you can't use flaps at all while you accelerate on the runway. This is quite a heavy plane, so you need to gather more speed before lifting off (flaps do generate lift but also decrease speed), and you will use more of the runway than other planes. Do not forget to counter the shift to the left by kicking the rudder to the right. Deploy takeoff flaps when you are above 200 km/h, and pull the stick back. This process can be harsher if there are obstacles at the end of the runway (eg. trees, houses). Upon being airborne, immediately retract gear and take-off flaps when you are beyond 240 km/h.\n\nGetting to a target's altitude takes time and patience given the low climb rate or the Do 217. Ambush around friendly ground targets (eg. tank columns, artillery positions, convoy routes, etc) or bases (especially half-bombed ones) so there is a better chance of catching enemy bombers or ground-pounders. The Do 217 cannot really perform BnZ on a bomber since it is hard to quickly climb higher than them after spotting them, therefore you will usually engage the target aircraft at a similar altitude. Track the target aircraft with lead pursuit to close in faster. As aforementioned, the Do 217 J's sluggish flight performance does not allow much manoeuvres when intercepting, thus you cannot utilise tactics such as deflection shooting as the turns bleed too much speed. It is best to just sit behind a bomber and carefully shoot at it, although this is not beneficial for the player to develop and practice the said tactics for later aircraft. Bombers at similar BR have weak defensive armaments which do little damage to the rugged Do 217 J. Open fire once the target's wingtips are about to fill up the aiming reticule completely. The big ammo pool for the cannons (200 rpg) allows some spray-and-pray, but it is still better to fire with 1-3 second bursts. The 4x 20 mm cannons are very efficient at tearing off flaps, cracking open cooling systems and damaging engines, and common bombers around this tier will not survive long. The Do 217 J's turn rate allows it to keep up with most bombers should they manoeuvre to avoid the Dornier's guns, however against certain bombers (eg. SB2M) the Do 217 will get out-turned. These bombers, however, will also bleed speed and energy in a tight evading manoeuvre, allowing you to catch up. If they are out of your view, switch to gunner view to locate them.\n\nIf you have to deafeat a Do 217 J with a good fighter, engage it from the side. That will make him turn, in which case he will slow down, making him easy to destroy. If he tries to escape upwards, follow him. He can't climb very well. If he tries to dive, follow him also. You can achieve higher speeds and still manoeuvre better. Here is the important advice: if the Do 217 tries to engage you head-on, fly straight at him, but at 900 m before him, break into a turn of about 45 degrees left or right. He will try to turn, but he can't manoeuvre well. Then follow him and engage him from behind.\n\n[[File:FighterImage_Do217j1img2.jpg|thumbnail|left|Front view: Nose armament and engines]]\n\n;Defensive Tactics\n\nDespite the heavy frontal firepower, you may find yourself in a position where you cannot use it. Fast nimble fighters will be hard to target, especially if they know that you are coming. Fortunately, you have two hard-hitting 13 mm machine guns to the rear with relatively good coverage. These can be used very effectively, particularly as many opponents will underestimate your defensive firepower.\n\nIn simulator, if an enemy fighter catches you, do not bother to try turning and get your guns on it. You simply cannot. Instead, keep flying straight to keep your speed up, and use your turrets to ward off the chasing aircraft. The 2 turrets have very good coverage, which may scare off some new simulator pilots.\n\n;Hit and Run\n\nAnother tactic you can use is to Hit and Run. This method requires you to plan your attack before engaging a target and relies partially on your team. Being a heavy plane has its ups and downs. On the downside, it turns like a brick and on the bright side, it hits like a brick. If you plan your intercept so that it finishes near your teammates, you should be safe. In order to do so, you might have to flank the enemy. Another way to pull a hit and run is to try to engage as many fighters as you can in head-ons, and then to return to base and rely on the gunner's aim to protect the plane.\n\n;Landing\n\nAs mentioned before, the Do 217 is a heavy aircraft, making landing slightly tricky. In essence, it is better to approach at a shallower angle and a slightly higher speed. Because due to the sheer weight and drag, the Do 217 will decelerate and sink much quicker than fighters when the throttle is lowered. So, if you approach at the same height and speed as you normally do in a fighter, you will soon realise that you are close to a stall/crash quicker than expected, which may lead to a crash. Thus, you need to approach at a slightly higher speed and a slightly lower height than fighters. As the airstrip fills up the windscreen, drop down to treetop level and sustain speed to at least 250 km/h with landing flaps and gears down. As you come closer to the runway decelerate and descent slowly, keep up your speed to around 220 km/h right before touchdown. Gently put the plane on the ground, as the Do 217's main landing gears are not sturdy enough to withstand a heavy touchdown.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Not auto controlled || Not controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Combined || Not controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* 2 x rear gunners, which is sometimes really handy\n* 4 x MG FF/M cannons and 4 x machine guns in the nose, good for bigger targets\n* Ability to mount bombs\n* Faster than most of its bomber opposition\n\n'''Cons:'''\n\n* Very poor rate of climb, difficult to get to bombers' altitude\n* Poor stability in turns, sometimes leading to stalling at low speeds\n* Large target\n* Exposed cockpit\n* Slower than most of its fighter opposition\n* Very poor energy retention in turns (thus a poor dogfighting aircraft)\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n=== In-game description ===\nDornier Do 217 J-1 twin-engine night fighter\n\nThe Do 217J night fighter was based on the Do 217E bomber. It differed from the bomber in that its crew was reduced to three people and its fixed firepower was strengthened. The first prototype, the Do 217J V1, was converted from the Do 217 E-1 and underwent tests in late 1941. They started to deliver the Do 217 J-1 to the Luftwaffe's fighting troops in the spring of 1942.\n\nJust like the Do 217 E-2, this plane was equipped with two BMW 801 ML fourteen-cylinder, air-cooled engines with a takeoff power of 1,580 hp.\n\nThe plane's offensive armament consisted of four 20 mm Oerlikon MG FF/M cannons (drum-fed, with 200 rounds each) and four 7.92 mm Rheinmetall-Borsig MG 17 machine guns (with 700 rounds each) located in the forward fuselage.\n\nThe defensive armament included two 13 mm Rheinmetall-Borsig MG 131 machine guns. One of them was installed in an upper DL 131/1A electric turret (500 rounds of ammo), and the second one was located in a lower WL 131/1 turret (1,000 rounds of ammo).\n\nProduction Do 217 J-1s had no radar and were equipped only with Spanner-Anlage infra-red detection systems. There was an extra 1,160-litre fuel tank in the forward bomb bay, and the rear bay could hold eight 50 kg aerial bombs in suspension, if the aircraft was to be used as a \"night hunter\" to strike enemy airfields.\n\nThe Do 217 J-1 was the heaviest night fighter in the Luftwaffe's arsenal. In this capacity, the aircraft had only modest speed (even lower than the Do 217E that it had been based on) and manoeuvrability. Its high landing speed ruled out multiple airfields as options for the plane's base. A combined total of 130 Do 217 J-1 variant aircraft were built. Some of them were subsequently converted to the Do 217 J-2 when a radar station was installed.\n\nIn addition to the Luftwaffe, Do 217 J-1s were also operated in Italy. A total of 12 Do 217 J-1 night fighters were received by the Regia Aeronautica in early 1943 to enter service with 235a Squadriglia, 60° Gruppo. The crews of these Italian night fighters never achieved any noteworthy successes. They chalked up only one air victory when they brought down a British Lancaster bomber on the night of July 16, 1943.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=do_217j_1 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n\n* [[Do 217 (Family)]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/436316-do217j-12/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Dornier}}\n{{Germany twin-engine fighters}}"}}