{"title":"F-100D","pageid":4025,"wikitext":{"*":"{{About\n| about = American jet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = F-100 (Family)\n}}\n{{Specs-Card\n|code=f-100d\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_f-100d.jpg\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} American jet fighter {{Battle-rating}}. It was introduced in [[Update 1.85 \"Supersonic\"]] and was one of the first three jets to feature guided air-to-air missiles, the other two being the [[MiG-19PT]] and the [[Javelin F.(A.W.) Mk.9]].\n\nThe dog-fighting days of WW II were over and while there was air-to-air combat during the Korean and Vietnam Wars, it was nowhere the level of previous wars. Jets were becoming faster, electronics and avionics were making them more manoeuvrable and the fighters were able to carry extremely large amounts of ordnance. The {{PAGENAME}} was no exception to this as it was designed to be a ground attacker first and a fighter/interceptor as a secondary role. Visible changes to the shape of the fighter compared to earlier [[F-80A-5|F-80s]], [[F-84 (Family)|F-84s]] and [[F9F-2|F9Fs]] as the {{PAGENAME}} sported a more sleek and aerodynamic shape to it.\n\nOne noticeable difference is the deviation from the straight-wing aircraft, early on in development the {{PAGENAME}} was known as the ''45-Sabre'' (officially later it was dubbed ''Super Sabre'') due to its wings being swept back at a 45° angle. The fighter's elevators were also swept back to help increase the aerodynamics of the aircraft. Engine exhaust nozzle control, upgraded avionics and early computer systems worked together to make this the first US fighter which was able to fly faster than the speed of sound in level flight. Compared to earlier jet fighters, the {{PAGENAME}} may feel more like a race car as it has a great climb rate, accelerates well in a straight line and during a dive while maintaining a decent roll rate. Slats in the wings help with the already horrible turn time, especially when the fighter is loaded down with ordnance, as such, turning should be left to a minimum.\n\n[[File:F-100 duckmcmallardson001.png|350px|thumb|left|Literally looking down the barrels of an oncoming '''{{PAGENAME}}'''.]]\n\nWeapon loadout options allow the pilot to tailor the aircraft to their play-style or even mix it up depending on the map they are flying. This fighter excels as a ground attack bomber utilizing up to 6,000 lbs of bombs, [[AGM-12B Bullpup|Bullpup]] rockets, [[FFAR Mighty Mouse|Mighty Mouse]] rockets or several combinations of the three. Whether you are into dropping and running or firing and forgetting, there are ordnance choices will fit the pilot's style. For those pilots who want to hunt fighters and bombers, The four nose mount 20 mm cannons and choice of [[AIM-9B]] Sidewinder air-to-air missiles will fit the bill. Centre-mounted cannons mean that convergence is not a factor and allows the pilot to set up for head-on attacks and being more successful against other fighters which may have to factor in convergence. The Sidewinders are also an intimidation factor as pilots with one on their tail must immediately focus on outmanoeuvring the missile, providing you with the opportunity to manoeuvre in and line up the kill-shot with your cannons if the missile does not make contact. The speed of the {{PAGENAME}} can come in handy when attacking bomber aircraft as Boom & Zoom tactics will help you avoid any defensive weapons allowing you to wreak havoc during an attacking dive.\n\nIf handled correctly, the {{PAGENAME}} can be a wrecking ball of destruction both in ground attacks and as an aircraft interceptor. Ordnance options are available for all play-styles and can be a tide-turner in a decisive match.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\nThe F-100 during its initial development was outfitted with the then de-rated Pratt & Whitney XJ57-P-7 engine and was still able to achieve faster than the speed of sound. By the time the {{PAGENAME}} rolled off of the production line they were outfitted with the more powerful Pratt & Whitney J57P-21. It is this engine which turns the fighter into a hot rod. The {{PAGENAME}} is much like a ground-based dragster in that it has acceleration, it has a high top speed and is a horrible turner.\n\nThe {{PAGENAME}} is aerodynamically fit with its sleek body and swept-back wings which coupled with its J57P-21 is a fantastic climber which continues to accelerate even without WEP engaged. This fighter will continue to accelerate in a flat run to the point of going over Mach 1 and even more quickly hits top speeds when in a dive. Climbing, diving and rolling are excellent capabilities of this fighter, however, this comes with having speed on your side as when flying slower, it has a more challenging time to manoeuvre without being a relatively easy target for others. The {{PAGENAME}} is not the greatest of turners even with leading-edge wing slats to help, manoeuvres like the Immelmann and Split-S are the most optimal when changing directions without attempting energy-bleeding manoeuvres like turning (unless that is what you are intending to do to cause an overshoot of someone following you).\n\n[[File:F-100 fulzy nyan001.png|350px|thumb|right|Bird's eye view of a '''{{PAGENAME}}''' after unloading on ground targets.]]\n\nFlying at speeds close to Mach 1 or past can pose a challenge for pilots utilizing the 3rd-person view as a condensation cloud forms around the aircraft and obscures your view (not an issue for those flying simulator-style from in the cockpit). While this can make targeting enemy aircraft a challenge, it just takes a little more work to line up the shot either with the cannons or air-to-air missiles.\n\nTypically aircraft which pound ground targets fly slow to ensure they hit their targets with guns, rockets or bombs, however, the {{PAGENAME}} becomes difficult to get out of harms way when flying slow, so it requires the pilot to learn how to bomb and fire rockets at targets at higher speeds than what they may be used to with earlier aircraft. Terms like drop & run or fire & forget come into play as the {{PAGENAME}} descends towards a ground target at a good clip, dropping its bombs or firing its rockets and then boogieing out of the area to ensure the ground anti-aircraft fire nor any trailing fighters gain a targeting solution on you. Some pilots like to watch and make sure their ordnance hits the target, however, this can cost you your jet when someone takes advantage of your inattentiveness and gets the drop on you. Speed in and speed out is the key with the {{PAGENAME}}.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 10,668 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 1,445 || 1,438 || rowspan=\"2\" | {{Specs|ceiling}} || 40.6 || 41.5 || 61.4 || 54.6 || rowspan=\"2\" | 1,400\n|-\n! Upgraded\n| 1,478 || 1,458 || 39.5 || 40.0 || 94.6 || 79.2\n|-\n|}\n\n==== Details ====\n[[File:F-100 rheinberg001.png|500px|thumb|right|'''{{PAGENAME}}''' at cruising altitude on the watch for potential enemy fighters.]]\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| ✓ || ✓ || ✓ || ✓ || X || ✓     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 620 || 590 || 435 || ~11 || ~4\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 640 || < 540 || < 610 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"5\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | {{Annotation|Basic mass|Mass of the aircraft with pilot and engine oil, but no fuel or weapons load}} || colspan=\"3\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | Pratt & Whitney J57P21 || 1\n| colspan=\"2\" | 9,658 kg || colspan=\"3\" | 354 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"4\" | Mass with fuel (no weapons load) || rowspan=\"2\" | Max Takeoff<br>Weight\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 14m fuel || 20m fuel || 30m fuel || 46m fuel\n|-\n| 900 kg || colspan=\"2\" | Afterburning axial-flow turbojet\n| 10,708 kg || 11,156 kg || 11,905 kg || 13,159 kg || 16,689 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB/SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"5\" | Thrust to weight ratio @ 0 m (WEP)\n|-\n! Condition || 100% || WEP\n! 14m fuel || 20m fuel || 30m fuel || 46m fuel || MTOW\n|-\n| ''Stationary'' || 3,786 kgf || 5,868 kgf\n| 0.55 || 0.53 || 0.49 || 0.45 || 0.35\n|-\n| ''Optimal'' || 4,254 kgf<br>(1,200 km/h) || 8,058 kgf<br>(1,200 km/h)\n| 0.75 || 0.72 || 0.68 || 0.61 || 0.48\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\nFor post-war fighter jets wanted to take advantage of the newer jet technology and maximize both speed and ordnance carried. To keep up speed and maximize ordnance, something had to give and that came with pilot survivability. The idea is to be faster than the enemy which would make it really difficult for them to get a targeting solution on you. Though the {{PAGENAME}} does have protection for the pilot, it isn't much and leaves the rest of the critical components virtually unprotected with armour. For the pilot, the back of the seat and headrest maintains a continuous piece of steel at 12.7 mm thick and the windscreen is rated at 64 mm bulletproof windscreen. Typically this type of protection is meant more for protection from defensive turret attacks from bombers rather than gun attacks from other aircraft.\n\nThe {{PAGENAME}} is a relatively sturdy aircraft and can take a beating before critical components begin to fail. While the engine and the pilot are important to protect as much as possible (without the engine you don't go and without the pilot…you don't go…) the wings are another critical component which you must protect as hits to the wings can make flying very difficult or send you to the respawn point. If being tailed by another aircraft try to speed away because if you try to pull up, turn to the side or pull-down, you risk exposing increased surface area of the skin, giving the enemy pilot more to shoot at and a greater opportunity of taking out a wing. If possible, increase speed and sway back and forth, even some very shallow elevator dips up and down maybe enough to throw off the sighting of the enemy pilot and spray his bullets all around you without exposing very much surface area of the jet, however, if there is a missile launch, take evasive action to avoid the missile and worry about the guns later.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | [[Ballistic Computer]]\n|-\n! CCIP (Guns) !! CCIP (Rockets) !! CCIP (Bombs) !! CCRP (Bombs)\n|-\n| {{Cross}} || {{Cross}} || {{Cross}} || {{Tick}}\n|-\n|}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M39A1 (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 4 x 20 mm M39A1 cannons, chin-mounted (200 rpg = 800 total)\n\nEarly fighter aircraft utilized the wings of aircraft to mount machine guns and cannons, which was very effective especially aircraft like the P-47 which could outfit four guns in each wing for a total of eight. The downside is that for these guns to be effective, they had to have a convergence set to a specific distance, bullet hits before that distance and after became less effective, the pilots needed to make sure to hit the sweet spot. For the {{PAGENAME}}, convergence is non-existent as all four of its M39A 20 mm cannons are mounted on the underside of the fuselage, effectively able to decimate targets at extremely close range or snipe targets which maybe even 700 - 800 m, if not farther away, effectively almost any range (below 1000 m) is a sweet-spot for this fighter.\n\nThe cannons are air-cooled and rarely overheat, typically with the 200 round limit for each gun, the pilot should want to make each shot count and not just hold down the firing trigger and spray away. Another bonus to having all four cannons being the same type and calibre is that the bullets will have the same drop rate, so after getting used to how they work, it is much easier to estimate where to target moving vehicles to ensure a connection with the bullets. With the four cannons grouping so tightly, only a few rounds are needed to blow off an enemy aircraft's wing, eliminate a critical component (engine, compressor, fuel tank, pilot, etc) and even take out ground units to include up to light armoured vehicles.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n[[File:F-100 wp gaming001.jpg|500px|thumb|right|'''{{PAGENAME}}''' peeling away from the flight revealing the suspended ordnance it is carrying.]]\n{{main|LDGP Mk 82 (500 lb)|M117 cone 45 (750 lb)|LDGP Mk 83 (1,000 lb)|BLU-27/B incendiary}}\n{{main|AGM-12B Bullpup|AIM-9B Sidewinder|AIM-9E Sidewinder|FFAR Mighty Mouse}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x AIM-9B Sidewinder missiles\n* 6 x 500 lb LDGP Mk 82 bombs (3,000 lb total)\n* 10 x 500 lb LDGP Mk 82 bombs (5,000 lb total)\n* 8 x 750 lb M117 cone 45 bombs (6,000 lb total)\n* 4 x 1,000 lb LDGP Mk 83 bombs (4,000 lb total)\n* 76 x FFAR Mighty Mouse rockets\n* 14 x FFAR Mighty Mouse rockets + 4 x 750 lb M117 cone 45 bombs (3,000 lb total)\n* 2 x AGM-12B Bullpup missiles\n* 2 x AGM-12B Bullpup missiles + 4 x 750 lb M117 cone 45 bombs (3,000 lb total)\n* 4 x AIM-9B Sidewinder missiles\n* 4 x AIM-9E Sidewinder missiles\n* 4 x BLU-27/B incendiary bombs\n* 4 x BLU-27/B incendiary bombs + 2 x AGM-12B Bullpup missiles\n* 4 x BLU-27/B incendiary bombs + 14 x FFAR Mighty Mouse rockets\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n[[File:F-100 tio pilin001.png|350px|thumb|right|'''{{PAGENAME}}''' caught in the cross-hairs of a MiG fighter.]]\n\nThe F-100 is absolutely crippled in an up-tier situation. Unlike the F4 Phantom II or the MiG-21, the F-100 is equipped with leading-edge slats. This gives it a much higher angle of attack at low speeds, allowing the F-100 to out-turn both the F4 and the MiG-21 while pulling so many G-forces and dropping speed so severely that it becomes an easy target for even AIM-9E missiles. However, at lower battle ratings, the F-100D is best at [[Boom & Zoom]] tactics. When fighting at a lower battle rating, the F-100 has some bad flying characteristics at low speeds which includes flying like a rock with wings. At high speeds, the F-100 locks up severely in spite of its all-flying tail and boosted controls, losing most of its control authority (particularly in its rolling axis). It has a massive angle of attack, so once you get on someone's tail, there's pretty much no escape, though floundering around at subsonic-optimized speeds leaves you vulnerable to interception. The best way to use the F-100D in the face of constant uptiers is to start climbing away from the battlefield, returning as support once more capable fighters have engaged the enemy. 5,000 meters is usually a good altitude to climb to. In the off chance that you encounter subsonic aircraft, Boom & Zoom tactics should be used to capitalize on your relatively superior climb rate. Climb high, make a pass, then climb away. Be extremely careful to not bleed energy and don't turn when subsonic planes are around, they will be able to outmanoeuvre the F-100D.\n\nAgainst the F-100's second biggest foe (with the first being AIM-9Js and R-60s), the MiG-19, turning isn't a bad idea if you keep your energy up. You bleed a lot of speed in a turn, so extreme pulls aren't recommended, especially considering the MiG-19's superior manoeuvring energy retention. The MiG-19 will rip easily at high speeds, something the F-100 doesn't have a problem with, though reaching those speeds effectively dooms the Super Sabre to degrees of manoeuvring lock-up similar to that experienced by its foe. However, the MiG-19 accelerates much faster than the F-100D at all speeds and altitudes so it can slip away easily. In the best-case scenario, bait the MiG-19 for a teammate, as the MiG-19 can't do much against two F-100s.\n\nThe F-100 is an amalgamation of paradoxical design features that results in an aircraft too heavy to sustain manoeuvring engagements despite of its strong slats, too slow to accelerate to its surprisingly high rip speeds, and too sluggish at speed to take advantage of its strong armament, all while being near incapable of matching the performance demands of its BR-peers at 10.3. Overall to get this bus to perform, it must be at high speeds. Keep your energy up.\n\n;Ground attack\n\nThe {{PAGENAME}} is no stranger to ground attack and can be effectively outfitted with just about anything (the LDGP Mk series kitchen sinks were not yet available) necessary to destroy ground targets both large and small. While bombers could deliver a massive amount of ordnance, they typically flew slow and high and were not always as precise as hoped for, therefore the USAF designated some of their fighter aircraft to also excel as low altitude precision bombers.\n\nThe J57P21 engine was necessary for this aircraft to both get it to fighter altitude and also to carry a massive amount of ordnance. A fully researched version of the {{PAGENAME}} can carry an assortment of low-drag general-purpose bombs ranging from 500 lb, 750 lb and 1,000 lbs. Total maximum bomb weight is 6,000 lbs, the same amount carried by a single [[B-17E]] bomber, but the {{PAGENAME}} can heft this amount at almost 1,000 kph faster and at a lower more accurate altitude. Of course, the bomb size will be determined by which type of target will be in the crosshairs. For smaller targets the 500 and 750 lb bombs will work best, additionally, the full 8x 750 lbs is the best load out for base bombing, since that load out has the highest total TNT Equivalent, and can take out up to 3/4 of a bombing base. The only time to use the LDGP Mk.83 bomb against vehicles is when there is a significant number en masse.\n\nNot all targets will require the usage of bombs or on some maps, you may be fortunate enough to have several bombers working on ground targets, or ground targets may be spread out, this is where rockets begin to shine. The AGM-12B Bullpup is essentially a 250 lb bomb attached to a rocket motor and is spin-stabilized. The Bullpup can be quite precise as long as the pilot can maintain visual of the target as he will need to guide the Bullpup in, any break from the target (due to manoeuvring or avoiding incoming enemies) can cause the rocket to go awry and miss the target. If needed the {{PAGENAME}} must throttle back and deploy the speed brake to ensure the Bullpup hits the target before manoeuvring away.\n\nOn the other hand, usage of the smaller [[FFAR Mighty Mouse]] unguided rockets can do a good amount of damage against ground and aerial targets, the one drawback – they are unguided. This means that once they are fired, they continue at their trajectory until they either hit something or run out of fuel and crash into the ground. The main counterpoint for the {{PAGENAME}} is the amount of these Mighty Mouse rockets it can carry, a total of 76. Rockets work best when they are fired in groups as this significantly increases chances that one or more rockets will hit their target. When going against aircraft it can induce a fear factor and cause the enemy pilot to take evasive manoeuvres to avoid an incoming salvo of rockets making them a much easier target to line up and reduce to small bits with the cannons.\n\nOf all the ordnance available, only one is set up to aid the fighter in air-to-air combat and that is the [[AIM-9B]] and [[AIM-9E]] Sidewinder missiles. The US Navy adopted the AIM-9 in 1956, with the Air Force adopting the missile to replace the troubled AIM-4 Falcon in 1964. The Sidewinder has an excellent reputation for locking onto an enemy and chasing it down, but don't assume the missile will do all of the work. There will be times when the enemy pilot may be able to outmanoeuvre the missile and it is at this point where the attacking pilot will need to be ready to jump in and take the shot with cannons while the enemy fighter has spent all of its energy and advantages just to avoid the missile and are a relatively sitting duck in the sky.\n\n=== Radars ===\n<!--{{main|AN/APG-30}}-->\nThe F-100D is equipped with an AN/APG-30 rangefinding radar, located in the nose of the aircraft.\nIt will automatically detect other planes within the scanning area and display the range to the closest target. It is linked with a gyro gunsight and can help with aiming at close range.\n\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"4\" | AN/APG-30 - Rangefinding radar\n|-\n! {{Annotation|Maximum<br/>Tracking<br/>Range|The maximum range at which a target can be tracked}}\n! {{Annotation|Minimum<br/>Tracking<br/>Range|The range below which targets cannot be tracked by the radar}}\n! {{Annotation|Azimuth Tracking<br/>Angle|How far to each side the radar can track a target}}\n! {{Annotation|Elevation Tracking<br/>Angle|How far up and down the radar can track a target}}\n|-\n| 2,750 m || 300 m || ±9° || ±9°\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent guns that have both high muzzle velocity, rate of fire, plenty of ammo (200 rpg), and pack a good punch with high-explosive shells\n* Can carry a wide array of suspended armaments including bombs, rockets and missiles\n* 4x AIM-9Es are adequate for air combat\n* Being supersonic, it can outrun the subsonic jets it commonly faces \n\n'''Cons:'''\n\n* Thoroughly unmanoeuvrable at low speeds\n* Loses a lot of energy in turns\n* Suffers from severe compression near Mach 1 \n* Rather slow acceleration, even with afterburner \n* Not nearly fast enough to outrun supersonic jets it commonly faces such as the MiG-19/21, A-5C and J35A\n* No countermeasures \n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nBy the mid-50s, jet aircraft had become robust machines which had obtained sufficient combat experience for the next step into a fundamentally new age: the era of supersonic speed. Supersonic fighters were developed by both of the main opposing nations of the Cold War. In parallel with the development of the MIG-19 in the USSR, American aircraft designers were putting the finishing touches on their own design for a supersonic fighter. The F-100 Super Sabre entered serial production somewhat later than its Soviet counterpart, but it needed just as many improvements and upgrades.\n\nThe F-100's main problems were its high failure rate and the shortcomings of its control systems. In addition, a fighter-bomber version was also being developed based on the Super Sabre: the F-100D, which featured an increased vertical and horizontal fin area and expanded capabilities with regard to suspended weaponry. In the end, it was the D version that became the most widespread modification of the single-seat Super Sabre thanks to its improved control and excellent combat abilities as either a fighter-bomber or pure fighter. In terms of suspended weaponry, the F-100D was able to carry over twenty extremely varied weapon load-outs, from traditional high-explosive bombs and rockets to air-to-air rockets and nuclear bombs.\n\n''- From [[wt:en/news/5929-development-f-100d-super-sabre-the-new-era-en|Devblog]]''\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=f-100d Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed\" heights=\"150\">\nFile:F_100d_wallpaper_001.jpg\nFile:F_100d_wallpaper_002.jpg\nFile:F_100d_wallpaper_003.jpg\nFile:F_100d_wallpaper_004.jpg\nFile:F_100d_wallpaper_005.jpg\nFile:F_100d_wallpaper_006.jpg\nFile:F_100d_wallpaper_007.jpg\n</gallery>\n\n;Videos\n{{Youtube-gallery|XFKJSkrgA0w|'''The Shooting Range #133''' - ''Metal Beasts'' section at 00:32 discusses the F-100D.|r4iaAbCImj0|'''F-100D Super Sabre [CloudMaker!]''' - Jengar|udBJeO9aMbg|'''How To Grind The F100 In War Thunder''' - ''TheLoganatorz''|fjqlRenNUAs|'''F-100 Super Sabre - Tips and Gameplay''' - ''WhooptieDo''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n\n* North American [[F-86 (Family)|F-86]] Sabre\n\n;Aircraft of comparable role, configuration and era\n\n* Dassault [[Super_Mystere_B2|Super Mystere]]\n* Mikoyan-Gurevich [[MiG-19PT|MiG-19]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/5929-development-f-100d-super-sabre-the-new-era-en|[Devblog] F-100D Super Sabre: The New Era]]\n* [https://forum.warthunder.com/index.php?/topic/436416-f-100d-super-sabre/ Official data sheet - more details about the performance]\n\n{{AirManufacturer NAA}}\n{{USA jet aircraft}}"}}