{"title":"F-104A (China)","pageid":10581,"wikitext":{"*":"{{About\n| about = jet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = F-104 (Family)\n}}\n{{Specs-Card\n|code=f-104a_china\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese jet fighter {{Battle-rating}}. It was introduced in [[Update \"Starfighters\"]].\n\nThis early interceptor model of the F-104 Starfighter, identical to the [[F-104A|US F-104A]] is a very different aircraft from the [[F-100A (China)|ROCAF F-100A]] that precedes it. The thin and pencil-shaped F-104 has excellent speed, acceleration, and climb for its battle rating but horrid turning capabilities at low speeds. The missile armament of two AIM-9B Sidewinders is disappointing, but it at least has a nifty M61 Vulcan rotary cannon that can dispatch enemies in a quick burst. Pilots who adhere to strict boom-and-zoom tactics can take advantage of the F-104's high performance compared to its contemporaries. Succeeding this aircraft is the improved [[F-104G (China)|ROCAF F-104G]], which boasts further improved performance and vastly superior payload options.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\nThe F-104A has a lower top speed than the later Starfighter models but is still capable of reaching about twice the speed of sound. The acceleration and climb are very good and the F-104A should be able to achieve an altitude and speed advantage over its close competitors. Horizontal energy retention and vertical energy retention are both good, allowing the F-104A to escape easily after making a pass. The elephant in the room is the substandard turning ability due to the tiny wings shared by all Starfighters. At low speeds, the turn rate is agonizing and flaps are not of much help. At high speeds, the turn rate becomes more bearable, but still not good. Manoeuvring energy retention is also unimpressive, though the effects may not be immediately obvious due to the low turn rate. The roll rate is very good and is important to utilize when making defensive manoeuvres.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 10,668 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 2,104 || 2,076 || rowspan=\"2\" | {{Specs|ceiling}} || 32.4 || 32.8 || 187.5 || 178.7 || rowspan=\"2\" | 1,180\n|-\n! Upgraded\n| 2,195 || 2,149 || 31.6 || 32.0 || 255.2 || 220.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| X || ✓ || ✓ || ✓ || ✓ || ✓     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 1,527 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || N/A || 827 || 444 || ~13 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 720 || < 950 || < 800 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"5\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | {{Annotation|Basic mass|Mass of the aircraft with pilot and engine oil, but no fuel or weapons load}} || colspan=\"3\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | General Electric J79-GE-3 || 1\n| colspan=\"2\" | 6,112 kg || colspan=\"3\" | 509 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"4\" | Mass with fuel (no weapons load) || rowspan=\"2\" | Max Takeoff<br>Weight\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 10m fuel || 20m fuel || 30m fuel || 35m fuel\n|-\n| 1,615 kg || colspan=\"2\" | Afterburning axial-flow turbojet\n| 6,915 kg || 7,624 kg || 8,380 kg || 8,789 kg || 24,000 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB/SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"5\" | Thrust to weight ratio @ 0 m (WEP)\n|-\n! Condition || 100% || WEP\n! 10m fuel || 20m fuel || 30m fuel || 35m fuel || MTOW\n|-\n| ''Stationary'' || 4,190 kgf || 6,571 kgf\n| 0.95 || 0.86 || 0.78 || 0.75 || 0.27\n|-\n| ''Optimal'' || 4,190 kgf<br>(0 km/h) || 8,584 kgf<br>(1,200 km/h)\n| 1.24 || 1.13 || 1.02 || 0.98 || 0.36\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\nThe F-104A is not equipped with any armour plating, and is therefore rather vulnerable to enemy fire, especially given the fact that most enemies at this rank sport high-calibre cannons. Since the plane's wings are so small, any damage to them at all drastically reduces stability and manoeuvrability, and may result in a crash. All of the vehicle's fuel tanks are centrally located, so fuel fires are unlikely to occur. However, the engine is very large, so it is very likely that it will sustain heavy damage if the vehicle is fired upon.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nThe pilot should focus first on researching the ''Fuselage'' ''repair'' and the ''AIM-9B'' modifications.  After that, it is recommended to research the remaining ''Flight performance'' modules before moving on to the ''Survivability'' modules.\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M61A1 (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 1 x 20 mm M61A1 cannon, fuselage-mounted (750 rpg)\n\nThe M61A1 Vulcan is a powerful gatling cannon. A quick and accurate burst can send targets into flames and the incredible rate of fire allows for some spray-and-pray, which is especially helpful considering how difficult it can be to get guns on target in this aircraft. But it has several drawbacks: first, the gun needs to spool up momentarily before it will fire, and second, the ammunition supply of 750 rounds will be depleted in no time if fired continuously. The former makes tap firing the gun to conserve ammunition a difficult affair but the latter means that holding down the trigger is not optimal either—certainly an awkward situation! New pilots can be afford to be somewhat more trigger-happy as they get used to the gun.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|AIM-9B Sidewinder}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x AIM-9B Sidewinder missiles\n\nThe F-104A is an interceptor variant, unlike the later multirole models like the [[F-104C]] or [[F-104G]]. In light of this, its only loadout option is a pair of AIM-9B Sidewinders. The AIM-9Bs have worn out their welcome at the F-104A's battle rating and getting kills with them is challenging: they have a limited acquisition cone,   are prone to losing their target due to evasive manoeuvres, flares, or sometimes plain luck. Poor-quality missiles like these are situational: save them for use against enemies that are not paying attention or who have run out of airspeed and are unable to manoeuvre, but do not rely on them to score a kill and be ready to mop things up with the Vulcan at a moment's notice.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe F-104A does one thing extremely well: speed. This is the vehicle's greatest advantage and can be used to great effect if the pilot is careful about choosing which engagements to pursue. It is recommended to keep up a high air-speed at all times, which will allow the F-104A to swoop in and out of the combat zone while evading enemies. Sometimes, it is even possible to outrun enemy air-to-air missiles.  At this battle rating, the F-104A is able to greatly outspeed the vast majority of its opponents.\n\nHowever, the F-104 struggles with manoeuvrability. With such small wings, it simply can't produce the lift necessary to throw itself around the sky and therefore has a very poor turning circle. This means that any turning engagement is most likely futile, and also reemphasizes the utility of a boom and zoom playstyle. Note that getting guns on target, even in a high speed pass, is difficult and a pilot may find themselves fighting with the controls often. If the target dodges, extend away and gain a comfortable amount of separation before climbing and preparing for another pass. Working with teammates is very helpful to keep an enemy distracted and limit their opportunities to regain energy.\n\nKeep the airspeed up at all costs. A slow F-104A is a sitting duck for guns and missiles due to its horrible turning. If an enemy is tailing the F-104A, the best option is to outrun them, but if they are closing in the only chance of pulling a reversal is to use the roll rate for rolling scissors.\n\nThis vehicle also lacks in the weaponry department. Although it has a powerful [[M61 (20 mm)]] Vulcan cannon, the only air-to-air missiles to which the plane has access is the AIM-9B. At this high battle rating, these early missiles are simply not enough to reliably destroy enemy targets, and the best way to use them is to target only slow-moving or inattentive enemies, like those in stall climbs. What's more, this vehicle is only equipped with two of them; the previous F-100A at least had four AIM-9Bs to toss around.\n\nThe complete lack of ground attack ordnance makes the F-104A fairly useless for ground pounding. At most, the Vulcan can mop up lightly armoured AI ground targets, but the handling characteristics of the aircraft make low-altitude gun runs risky. In combined battles, the Vulcan's AP rounds have decent penetration on paper, but attacking armoured targets from the top-down angles required to attack roof armour is borderline suicidal in a Starfighter. Stick to other options for CAS.\n\n===Radars===\n<!--{{main|AN/APS-19}}-->\nThe F-104A is equipped with a AN/ASG-14 search and tracking radar. The radar is mounted in the nose of the aircraft.\n\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"4\" | AN/ASG-14 - Target Detection Radar\n|-\n! {{Annotation|Maximum<br/>Detection<br/>Range|The maximum possible range at which a target can be detected}}\n! {{Annotation|Guaranteed<br/>Detection<br/>Range|The range, below which, detection of a target is practically guaranteed}}\n! {{Annotation|Max Azimuth<br/>Scan Angle|How far to each side the radar can scan (widest search mode)}}\n! {{Annotation|Max Elevation<br/>Scan Angle|How far up and down the radar can scan (widest search mode)}}\n|-\n| 37,000 m || 15,000 m || ±45° || ±46°\n|-\n! colspan=\"4\" | AN/ASG-14 - Target Tracking Radar\n|-\n! {{Annotation|Maximum<br/>Tracking<br/>Range|The maximum range at which a target can be tracked}}\n! {{Annotation|Minimum<br/>Tracking<br/>Range|The range below which targets cannot be tracked by the radar}}\n! {{Annotation|Azimuth Tracking<br/>Angle|How far to each side the radar can track a target}}\n! {{Annotation|Elevation Tracking<br/>Angle|How far up and down the radar can track a target}}\n|-\n| 18,500 m || 150 m || ±10° || ±10°\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent top speed; much faster than most enemies, supported by high acceleration\n* Great climb rate\n* Decent high-speed manoeuvrability, in spite of its tiny wings\n* Powerful 20 mm Vulcan gun has absurdly high fire rate, high velocity and high damage\n* Good roll rate\n\n'''Cons:'''\n\n* Terrible low-speed manoeuvrability\n* Inadequate air-to-air missiles\n* No countermeasures to counter AAMs\n* Unable to equip bombs or rockets, limited to an air-to-air role only\n* As with most jets, it tends to bleed  speed quickly in sustained turns\n* Relatively low ammo count for the Vulcan; trigger discipline is necessary\n* M61 Vulcan doesn't shoot instantly; it takes a moment to spool up\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nThe Lockheed F-104 Starfighter was a supersonic jet fighter known for its distinctive appearance, described as a \"missile with a man in it\". At the time of its introduction in 1958 with the US Air Force as an interceptor, the F-104 set multiple performance records and was the first production fighter capable of flying at twice the speed of sound. Flaws of the design included engine troubles, limited range, and poor handling characteristics that led to a poor safety record, earning it several morbid nicknames like \"Widowmaker\".\n\nThe F-104's involvement with the Republic of China/Taiwan began soon after it entered service with the US Air Force in 1958. The Second Taiwan Strait Crisis in August of that year was sparked by the People's Liberation Army shelling new ROC military installations on the islands of Kinmen and the Matsu Archipelago. The USAF deployed F-104s to Taiwan and used them to perform supersonic passes into the airspace of the straits and mainland China in order to show off the capabilities of the Mach-2 capable Starfighter and intimidate the PLAAF, which at that time was equipped with [[J-2|MiG-15]]s and [[J-4|MiG-17]]s. No actual shooting engagements occurred and the F-104s were withdrawn after a cease fire in October.\n\nThe Republic of China Air Force received its first Starfighters starting in 1960, the first batch of F-104A/Bs being from ex-USAF stock. A number of them were sent to Pakistan in 1965, who received at least two F-104As from Taiwan to replace combat losses in the war with India. The F-104As were retired in the 1980s, with only the later variants like the [[F-104G (China)|F-104G]] remaining in service until the late 1990s with upgrades.\n\nA large number of Starfighters are preserved and on display in Taiwan today. At least four F-104As can be found at Kanshan Air Force Base, Hsinchu Air Force Base, and other locations. A full list can be found [https://www.i-f-s.nl/preserved-f-104s/preserved-in-taiwan/ here].\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n''Excellent additions to the article would be video guides, screenshots from the game, and photos.''\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''encyclopedia page on the aircraft;''\n* ''other literature.'' -->\n''Paste links to sources and external resources, such as:''\n\n* ''topic on the official game forum;''\n* ''encyclopedia page on the aircraft;''\n* ''other literature.''\n\n{{AirManufacturer Lockheed}}\n{{China jet aircraft}}"}}