{"title":"F-14A Early","pageid":18655,"wikitext":{"*":"{{Specs-Card\n|code=f_14a_early\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} American jet fighter {{Battle-rating}}. It was introduced in [[Update \"Danger Zone\"]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nThe F-14A might be seen underpowered compared to other aircraft, primarily the F-4J Phantom II and other Phantom variants such as the Phantom FG.1. While it is true that the engines are not as powerful, the flight performance of the F-14A is much better when it comes to top speed and energy attacks, but insufficient power can be noticed when zoom climbing, or when turning at low speed. Regaining the speed back can take a while. The other problem related to the engine is the tremendous fuel consumption: while with the full fuel tanks it can stay in the air for at least one hour, but when the player decides to use the full afterburner (WEP) it can fly for only 7 minutes at sea level.\n\nThe F-14A is more of a two circle dogfighter since it keeps speed very well while pulling lots of G, but might not have as much AoA (Angle of Attack) available as other planes to win one circle fights (scissors and anything similar when you turn into the opponent's nose); though it can still beat planes like the MiG-23MLD in the instantaneous turn rate performance, delta wing fighters like the J35 or MiG-21 could have the advantage during the first seconds of the fight. Just like in other planes with variable wing geometry, the F-14A reaches the highest turn rate performance when wings are swept fully forward (so set to 0%) and that can be achieved only by using the manual wing sweep controls. Since it is semi-automatic, the wing will automatically change its position after reaching around ~800 km/h IAS.\n\nThe most optimal speed for turning is around 900 km/h IAS at sea level (it reaches the highest sustained turn rate there), but the best is actually between 700 and 830 km/h IAS since any faster and it becomes impossible to maintain the turn without the crew blacking out. At those speeds, the F-14A in a clean configuration with 30 minutes of fuel can reach up to 23 deg/s of sustained turn rate, which is better than any MiG-23, Su-17, or even other more manoeuvrable fighters like the MiG-19. Both the sustained and instantaneous turn rate can be improved by using combat flaps, they can increase the turn rate at the speeds up to 850 km/h IAS.\n\nThanks to the variable wing sweep, the F-14A is able to move its center of mass and thus increase or decrease its roll rate. High sweep means higher speeds at reduced roll rate and vice versa; low sweep means slower speeds at an increased roll rate, but also increased energy retention at subsonic speeds.\n\nTo get the most of its turn rate performance in Simulator Battles you should always try to use the manual SAS (Stability Augmentation System) mode, the damping mode limits its AoA too much and it is harder to win fights against planes like the MiG-21 or other deltas. The combat flaps should also always be used when you are about to merge with the enemy plane, they do not only increase the sustained turn rate, but also make it so you can pull AoA, it is easier to get lead on the enemy plane, they also make it easier to control the plane when the manual SAS mode is being used. The player should still be very careful with pulling the stick around 500 km/h IAS, below that speed it's very easy to reach the critical AoA and stall out the plane and if not then lose lots of speed, pulling the stick all the way to yourself should be done only when you are going for snap shots. The other downside of using the manual SAS mode except for the plane being much easier to stall out is also making it much more sensitive to controls, especially in pitch, during the cruising and BVR engagements it is recommended to use the damping SAS mode.\n\nWhile using the manual SAS mode it is can be easy to stall out the plane when flying below 400 km/h IAS, after entering the flat spin the quickest method to get the plane out of it is to increase the wing sweep angle and then counter the plane rotation with the rudder.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 12,192 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 2,202 || 2,191 || rowspan=\"2\" | {{Specs|ceiling}} || 24.4 || 25.1 || 178.4 || 170.5 || rowspan=\"2\" | 750\n|-\n! Upgraded\n| 2,245 || 2,221 || 23.6 || 24.0 || 231.6 || 203.8\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| ✓ || ✓ || ✓ || ✓ || ✓ || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"60%\"\n|-\n! rowspan=\"2\" | Limits\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n! Min sweep\n| 1,359 || rowspan=\"2\" | {{Specs|destruction|gear}} || rowspan=\"2\" | 1,200 || rowspan=\"2\" | 873 || rowspan=\"2\" | 416 || ~10 || ~5\n|-\n! Max sweep\n| 1,555 || ~11 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 1,200 || < 850 || < 1,800 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"7\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"3\" | {{Annotation|Basic mass|Mass of the aircraft with pilot and engine oil, but no fuel or weapons load}} || colspan=\"4\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | Pratt & Whitney TF30-P-412A || 2\n| colspan=\"3\" | 18,545 kg || colspan=\"4\" | 493 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"5\" | Mass with fuel (no weapons load) || rowspan=\"2\" | {{Annotation|Max Gross<br>Weight|Mass of the fully equipped aircraft with heaviest weapons load}}\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 18m fuel || 20m fuel || 30m fuel || 45m fuel || 62m fuel\n|-\n| 1,802 kg || colspan=\"2\" | Afterburning low-bypass turbofan\n| 20,750 kg || 20,905 kg || 22,085 kg || 23,855 kg || 25,895 kg || 30,935 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB/SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"6\" | Thrust to weight ratio @ 0 m (WEP)\n|-\n! Condition || 100% || WEP\n! 18m fuel || 20m fuel || 30m fuel || 45m fuel || 62m fuel || MGW\n|-\n| ''Stationary'' || 4,860 kgf || 8,019 kgf\n| 0.77 || 0.77 || 0.73 || 0.67 || 0.62 || 0.52\n|-\n| ''Optimal'' || 5,808 kgf<br>(1,555 km/h) || 12,692 kgf<br>(1,555 km/h)\n| 1.22 || 1.21 || 1.15 || 1.06 || 0.98 || 0.82\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\nThe F-14A holds 60 countermeasures, a decent amount of flares that can keep the Tomcat in the air for longer. Due to the massive engines, the IR signature of the aircraft is not an easy thing to conceal when fighting heat-seeking missiles. Afterburners should be turned off and preferably throttle should be reduced while dumping flares. This is to ensure that IR guided missiles track the flares and not the engines. Due to the massive size compared to other aircraft, the chances of a successful hit from enemies, both missile and cannon, are higher compared to other aircraft, such as the AV-8 or F-5. This should be taken into consideration as proximity fuzes will trigger with more ease as the wingspan of the Tomcat is considerably larger than most jets seen in game.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | [[Ballistic Computer]]\n|-\n! CCIP (Guns) !! CCIP (Rockets) !! CCIP (Bombs) !! CCRP (Bombs)\n|-\n| {{Tick}} || {{Tick}} || {{Tick}} || {{Tick}}\n|-\n|}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M61A1 (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* A choice between two presets:\n** 1 x 20 mm M61A1 cannon, cheek-mounted (676 rpg)\n** 1 x 20 mm M61A1 cannon + 60 x countermeasures\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|LDGP Mk 81 (250 lb)|LDGP Mk 82 (500 lb)|LDGP Mk 83 (1,000 lb)|LDGP Mk 84 (2,000 lb)|Zuni Mk32 Mod 0 ATAP}}\n{{main|AIM-7E Sparrow|AIM-7F Sparrow|AIM-54A Phoenix}}\n{{main|AIM-9D Sidewinder|AIM-9G Sidewinder|AIM-9H Sidewinder}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance presets:\n\n* Without load\n* 2 x AIM-9D Sidewinder missiles\n* 4 x AIM-9D Sidewinder missiles\n* 4 x AIM-9G Sidewinder missiles\n* 4 x AIM-9H Sidewinder missiles\n* 6 x AIM-7E Sparrow missiles\n* 6 x AIM-7F Sparrow missiles\n* 6 x AIM-54A Phoenix missiles\n* 14 x 250 lb LDGP Mk 81 bombs (3,500 lb total)\n* 14 x 500 lb LDGP Mk 82 bombs (7,000 lb total)\n* 4 x 1,000 lb LDGP Mk 83 bombs (4,000 lb total)\n* 4 x 2,000 lb LDGP Mk 84 bombs (8,000 lb total)\n* 16 x Zuni Mk32 Mod 0 ATAP rockets\n\nThe F-14A is the first aircraft in game to have access to Active Radar Homing missiles with internal navigation. While it is mostly used for air defense and anti-air duties, it holds decent ground pounding abilities that are nothing new to American pilots. The F-14A has access to a wide variety of weapon selections due to having 'Custom Loadouts' feature. Depending on the needs of the pilot, one can carry different loadouts for different needs. Some may prefer the use of the AIM-7F over the AIM-54 due to the fast acceleration and good performance in short-medium ranges. A recommended loadout to carry is the following: x4 AIM-54A, x2 AIM-7F, x2 AIM-9 (on preference). It holds the power to fight on all ranges, being able to launch AIM-54A at unaware targets and then engage other with Sparrows, later to dogfight at close ranges with Sidewinders.\n\n==== Custom loadout options ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! !! width=\"7%\" | 1 !! width=\"7%\" | 2 !! width=\"7%\" | 3 !! width=\"7%\" | 4 !! width=\"7%\" | 5 !! width=\"7%\" | 6\n| rowspan=\"12\" width=\"30%\" | <div class=\"ttx-image\">[[File:Hardpoints_{{PAGENAME}}.png]]</div>\n|-\n! 250 lb LDGP Mk 81 bombs\n| || || 8* || 6 || ||\n|-\n! 500 lb LDGP Mk 82 bombs\n| || || 8* || 6 || ||\n|-\n! 1,000 lb LDGP Mk 83 bombs\n| || || 2* || 2 || ||\n|-\n! 2,000 lb LDGP Mk 84 bombs\n| || || 2<sup>*†</sup> || 2 || ||\n|-\n! Zuni Mk32 Mod 0 ATAP rockets\n| || 8 || || || 8 ||\n|-\n! AIM-7E Sparrow missiles\n| || 1 || 2 || 1, 2* || 1 ||\n|-\n! AIM-7F Sparrow missiles\n| || 1 || 2 || 1, 2* || 1 ||\n|-\n! AIM-9D Sidewinder missiles\n| 1 || 1 || || || 1 || 1\n|-\n! AIM-9G Sidewinder missiles\n| 1 || 1 || || || 1 || 1\n|-\n! AIM-9H Sidewinder missiles\n| 1 || 1 || || || 1 || 1\n|-\n! AIM-54A Phoenix missiles\n| || 1 || 2* || 2<sup>†</sup> || 1 ||\n|-\n| colspan=\"9\" | * Use of dual Sparrow missiles on hardpoint 4 prevents use of the marked options on hardpoint 3 <br> <sup>†</sup> The AIM-54A Phoenix missiles on hardpoint 4 cannot be carried in conjunction with 2,000 lb LDGP Mk 84 bombs on hardpoint 3\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe F-14A Tomcat is an energy and air-superiority fighter and should be used as such. A mix between long-range weapons and short-range weapons must be used at pilot's discretion. It is advised to never turn fight with the Tomcat unless absolutely necessary as the speed will bleed drastically, leaving it as an easy target for enemy aircraft and anti-air. The range of the missiles can be drastically increased if the Tomcat is positioned above its target. The missiles will not only increase speed but distance as well, this should be taken into consideration as it can take unaware targets as they never expect to be hit from the top. Thankfully, both the Sparrow and the AIM-54A are able to do all-aspect attacks on enemies, making it an all-rounder weapon for all sorts of medium-long range scenarios.\n\nThe F-14A is especially practical when playing Enduring Confrontation battles as it is able to engage multiple targets at a time with the AIM-54A at extreme ranges making it useful for taking down enemy attackers, scouts and players. It should be noted that the F-14A burns up fuel very fast when on afterburner. This should be taken into consideration as one can burn up all the fuel without realizing until it is too late. You can also use the mouse scroll wheel to save a lot more fuel by using the first-stage afterburner, it gives a significant power boost from 100% throttle but a little less power than full afterburner. On minimum fuel (18 minutes) the full afterburner can only last about 2 minutes and 30 seconds while the mouse scroll wheel afterburner (first-stage) could last you 8 minutes.\n\nSomething to be aware of when playing the F-14A is the insane heat of its engines. At high throttle and afterburner, its engines emit an unparalleled amount of heat at around 2,100 °F (1,150 °C). For reference, that is around 66% hotter than the F-4J's engines, which is around 1,239 °F (671 °C) at 100% throttle and 1,256 °F (680 °C) during full afterburner. During gameplay, this means that in the F-14A simply by just turning off the afterburner and deploying flares may not be enough to avoid an incoming IR missile. You will also have to throttle down the engine significantly (at least 85%) to make sure that an incoming IR missile goes for the flare. This also means that you will lose a decent amount of speed in the process, so be prepared. \n\n'''Simulator Battles - Enduring Confrontation'''\n\t\nBefore you take the F-14A to battle you need to figure out what weapons you want to use. All the available IR missiles have almost identical turn performance, the range is almost the same too. The D version cannot be slaved to the locked target, the G can be and the H works exactly like the G, but has a higher tracking rate. Taking at least two of them is highly recommended since they almost do not affect the flight performance.\nThere are also two options between radar guided missiles. The AIM-7F works very well at close and medium ranges (3-20 km) and can hit a target which is pulling lots of G. They are harder to dodge in Simulator Battles, though you need to keep your lock all the time. The AIM-54A is an active radar guided missile, it does not require the radar lock when it is launched 16 km from the target (or when it gets that close, then you can break your lock), but it can pull only up to 16G which is quite easy to dodge, both these missiles can also be avoided by just simply notching when the F-14 uses the Pulse Doppler radar mode.\n\nA few loadouts recommendations:\n\n* 4x AIM-9H + 4x AIM-7F - Works very well in almost any scenario, does not affect the flight performance that much.\n* 4x AIM-9H + 4x AIM-54A or 2x AIM-9H + 6x AIM-54A - Makes the plane turn a lot worse, in most cases will not work against fighters which know how to deal with radar guided missiles, this loadout is useful mainly against planes that attack the bombing bases or airfields only, so for example the Su-6s loaded with bombs etc. (farmers). It is not recommended to use it in normal EC battles.\n* 4x AIM-9H + 2x AIM-54A + 2x AIM-7F\n\nTo make the full use of the F-14A's manoeuvrability it is the best to buy the expert crew and the ace crew if it is possible, since the plane pulls around 8G at 750 km/h IAS in a sustained turn and that increases even further when the player decided to pull it even more, though you need to keep in mind that the G limit is ~11G.\n\n'''Outside the combat''':<br>As a start keep in mind that the F-14A really likes to burn the fuel a lot when the afterburner is used, at low altitude it can fly up to 7 minutes with full fuel tanks, so it is recommended to fly either with 45 minutes of fuel (on 64x64 km maps like Ruhr, Port Moresby) or full fuel tanks (128x128 km maps like Vietnam, Denmark). WEP should not be used while cruising and only during combat or while chasing someone, flying with the throttle set to 85-90% should be fine too. There are a few tactics that can be used in the F-14 in SB, but it mostly depends on what map you play. On more open maps like Denmark you can at 1,000-3,000 m alt while looking for targets, though some MiGs can still sneak up to you if you are not paying enough attention to your surroundings, doing so you are mostly vulnerable to attack from below and behind, especially when the enemy has access to all-aspect missiles. The other tactic is just simply hugging the ground, in most cases it is the safest one and should be used on maps with hills and mountains where you can break the enemy's line of sight by flying between them. It is more difficult and requires lots of focus. The player needs to keep looking around all the time to find the target, the radar is less useful in this scenario, though the TWS mode can be helpful on maps like Vietnam to check the enemy plane direction and ambush them while you are flying in areas where it is hard to spot the planes due to the ground color and many objects like trees. To make the cruising easier the damping SAS mode can be used, which limits the angle of attack (AoA) so much that the G limit cannot be reached at any speed, the automatic wing sweep control also can be activated. About the radar modes, the PDV should not really be used since it is the only one which does not have any kind of IFF and it is as good at detecting targets as the normal PD mode. Since the PD radar cannot track targets that are flying perpendicular to your plane switching between modes is very important, even the normal Pulse (SRC) mode can detect targets against the ground up to 15-20 km and even further when it is above the horizon. To be safe from enemy missiles it is the best to stay around 20-30 km away from the enemy planes.\n\n'''During the combat''':<br>\nDuring the BVR combat when both sides have similar missiles it is important to get at higher rate before launching it and launch the missile before the enemy does, for now the only plane that can actually start this kind of fight is the Viggen (Sweden is very often on the Russian side), though you can just ignore it and keep notching while getting below the enemy plane (missiles have much lower range at low altitude) and wait until it gets close, the start a dogfight. The AIM-54A can be useful in such scenarios, even when the F-14 will be forced to break away the missile will still be tracking the target, then the enemy will be forced to dodge it and when that happens you can launch another missile to force the enemy into an even more defensive position. When the distance between planes is around 10 km, the radar mode should be switched to either BST or VSL since they offer an instant radar lock after pointing at the targets, locking on manually can sometimes take a few seconds and a few failed attempts. Those two modes can also be used when the player in the F-14A is trying to be sneaky, then when the enemy is not aware of being tracked by TWS mode on maps like Vietnam the F-14 can switch to them when the enemy gets close from the front and then right after that launch the AIM-7F.\nOverall learning quick switching between radar modes depending on the situation is very important.\n\nWithin visual range (up to ~10 km) against the MiGs in a head-on it is important to keep launching 1 flare every few seconds, it will reduce the chance of being tracked by the R-23T, R-24T or R-60M, also as soon as the missile launch happens a few more them should be launched. For this kind of scenario it is the best to be equipped with AIM-7F missiles, by using them you can deny the enemy any head-on attempts, by launching it they will be forced to notch it, while the IR missiles in most cases can be dodged by using flares right before the launch, not using WEP before the dogfight starts and it can be done by just flying in a straight line (when the distance between the missile and the F-14 is big enough).\nThe enemy will not be able to safely reengage until it gets very close (when the AIM-7F becomes less effective, so within 2 km from the target), but at that point the AIM-9H can be used in some cases against afterburning targets trying to notch the PD radar. All of this can lead to the enemy having to dodge the missile and becoming an easy target, you can easily get on their six and shoot them down by using the gun.\n\nWhen the dogfight happens it is needed to switch the SAS mode to manual, the damping limits the manoeuvrability too much and can put the F-14 in a worse position, especially against the delta wing planes, though using it makes the plane harder to control. The other thing to remember is switching the wing sweep controls to manual, then reducing it to 0% for the best manoeuvrability. \nThe last thing is using the combat flaps, but overusing them and doing it in the wrong situation can lead to being shot down faster. Before the merge between both planes happens the speed should be around 800 km/h IAS and 900 km/h (450-500 kn IAS), it will make starting a two circle fight (where the F-14 excels) easier. The combat flaps in the F-14 improve both the sustained and instantaneous turn rate, the only downside is that they work effectively only up to 900 km/h IAS and make reaching speed above that harder. The one circle fight can be done only planes like the MiG-23, Su-17/22 or the Japanese Phantoms, against other planes, especially the delta wing planes it is not very safe, although the F-14 can sometimes pull a very tight turn (takeoff flaps have a speed limit up to 800 km/h and can help with that). Generally the safest way to win the fight is keep your speed around 800 km/h IAS in a two circle fight, there is not a single plane that can win it. There are a few planes which can give a hard time in close range fights, the MiG-23MLD, J35s, MiG-21bis, J-7E, Chinese F-5E, the player should be very careful while engaging any of these.\n\n'''Basic mistakes''':<br>\nIgnoring the IFF and teamkilling - one of the biggest mistakes happening in SB, it is always important to check if the target is a friendly plane or not (one line - unknown/enemy, two lines - friendly), also launching the AIM-54 into a direction with a few friendly planes can end really badly, the same about launching any kind of missile into furballs. Ignoring the IFF readouts will lead to being kicked from the session and the team performing worse because they will also need to worry about dodging friendly missiles.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Very effective dogfighter at any speeds with its variable wing sweep thus being one of the best energy retaining jet fighters\n* Variable swept wings can help plane accelerate fast when it's swept back and turn better when the wing is less swept\n* High top speed (can cap out at 1500 km/h IAS at sea level)\n* Lethal M61 Vulcan cannon which has an extremely fast fire rate, great velocity, and great damage\n* Can carry up to 8 missiles maximum, with options of AIM-7s, AIM-9s, and [[AIM-54A Phoenix|AIM-54]]<nowiki/>s for versatile use\n* The AIM-54 has insane range (100 km max), its rocket booster lasts for a very long time, and it's an Active Radar Homing missile\n* Multi-mode radar makes it effective at any situation (The TWS mode allows launching AIM-54s at multiple aircraft at once)\n* The new [[AIM-9H Sidewinder|AIM-9H]] has much better flare resistance than previous AIM-9s (such as the [[AIM-9G Sidewinder|G]] or [[AIM-9J Sidewinder|J]] variants)\n* 60 countermeasures provides good ability to ward off missiles\n\n'''Cons:'''\n\n* Big plane and thus an easy target to hit\n* The afterburner's fuel consumption is otherworldly fast; constant usage of it requires carrying a lot of fuel that can hamper the plane's performance and manoeuvrability\n* Massive wing and fuselage fuel tanks makes it especially prone to catching fire\n* Cannot pull sustained Gs when above 1000 km/h IAS (11-13 G) in RB or the wings will rip\n* At high throttle and afterburner, the engine emits an unparalleled amount of heat, requiring throttling down (and therefore significantly bleeding speed) to reliably flare missiles off \n* The AIM-54A only has 16G overload and thus is rather easy to dodge\n* The AIM-54A's rocket motor lasts for a very long time, giving plenty of time for enemies to spot and evade it\n* Requires lots of work and binded controls related to the radar and variable wing sweep angle to make it fully work in simulator battles\n* The Damping SAS mode limits the AoA so much that it cannot be used in one circle fights (scissors etc.) thus forcing the player to use the much harder to use the Manual SAS mode (SB with full-real controls)\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n=== Early Development ===\nIn 1967, the U.S. Navy wanted a long-range fleet defence fighter to boost their naval plane capabilities with the \"VFX\" program. The USN first started with a redesigned F-111 Aardvark named the F-111B (basically an F-111 designed around the TF30 engine and AIM-54 Phoenix missiles), they soon found out that the F-111 was too big for practical reasons so the F-111B plan never came to fruition. Fast forward to 1969, the USN gave the contract to Grumman to build the new fleet defence fighter named the F-14 Tomcat, its first variants were built around the TF30 engines found on the F-111B and to use the AN/AWG-9 radar set and the airframe was specifically built to carry the AIM-54 Phoenix missile.\n\n===[[wt:en/news/7705-development-f-14a-tomcat-into-the-danger-zone-en|Devblog]]===\nIn 1968, five aircraft building companies entered the Pentagon's competition for a new carrier-based interceptor fighter. The commission's preference was given to Grumman's design, a twin-engine jet fighter with a variable-swept wing. Work on the F-14A fighter began in February 1969, and in December of the next year, the new aircraft took her maiden flight. The main weapon of the F-14A was the AIM-54 Phoenix long-range missiles controlled by the newest to date weapon control system. Instead of building prototypes, Grumman immediately switched to the production of an experimental series, and already on December 31, 1972, the first batch of jet fighters were put into service with the VF-124 Fleet Replacement Squadron . Pilot training took place on the deck of the USS Enterprise aircraft carrier, and during the withdrawal of US troops from Vietnam, combat sorties were also made from the deck. In total 557 F-14A fighters were delivered to the US Navy until 1987, and another 80 aircraft were built for Iran. Tomcats were used in all military conflicts where US aircraft took part until the very decommissioning. Iranian F-14s took an active part in the Iran-Iraq war, scoring dozens of air kills.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=f_14a_early Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed\" heights=\"150\">\nFile:F-14A Early Wallpaper 1.jpg|\nFile:F-14A Early Wallpaper 2.jpg|\nFile:F-14A Early Wallpaper 3.jpg|\nFile:F-14A Early Wallpaper 4.jpg|\nFile:F-14A Early Wallpaper 5.jpg|\nFile:F-14A Early Wallpaper 6.jpg|\nFile:F-14A Early Wallpaper 7.jpg|\n</gallery>\n\n;Videos\n{{Youtube-gallery|Wdnef_6_6oM|'''The Shooting Range #307''' - ''Metal Beasts'' section at 00:26 discusses the {{PAGENAME}}.}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Other jet planes with variable sweep wings\n\n* [[MiG-23 (Family)]]\n* [[Su-17/22 (Family)]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/7705-development-f-14a-tomcat-into-the-danger-zone-en|[Devblog] F-14A Tomcat: Into the Danger Zone!]]\n* [https://forum.warthunder.com/index.php?/topic/557191-f-14a-early/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Grumman}}\n{{USA jet aircraft}}"}}