{"title":"F-4C Phantom II","pageid":7424,"wikitext":{"*":"{{About\n| about = American jet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = F-4 Phantom II (Family)\n}}\n{{Specs-Card\n|code=f-4c\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} American jet fighter {{Battle-rating}}. It was introduced in [[Update 1.91 \"Night Vision\"]].\n\nDevelopment of fighter aircraft attempts to balance size, speed, armament and manoeuvrability to come up with the perfect fighter. Due to the difficulties and challenges of bundling all of these in one aircraft, many different varieties have been developed through the years which highlighted one or more aspects but rarely all in one. And sometimes the mould had to be broken and the motto \"bigger IS better\" came into play. Due to these such heavyweight fighters like the [[P-61C-1|P-61]], [[Me 410 (Family)|Me 410]], [[Beaufighter (Family)|Beaufighter]], [[J5N1]] and [[SM.91]] were developed to fly faster, remain manoeuvrable and carry heavier weapons and ordnance, sometimes much heavier than their lighter counterparts. The {{PAGENAME}} is no exception, originally developed as a souped-up F3H Demon, this fighter was modified into a larger, heavier, faster fighter-interceptor/bomber that the U.S. Navy didn't realize it needed and when it did, it went all in.<ref name=\"Hachette\" />\n\nThe imposing {{PAGENAME}} can seem a bit intimidating at first due to its size, but the pilot will quickly find that with the dual J79-GE-15 engines that this fighter is no slouch. Going from takeoff, acceleration in a climb and to level flight the {{PAGENAME}} will move and is quite agile for an aircraft of its size. Pilots new to the {{PAGENAME}} will initially be set up with an M61 20 mm cannon. Due to this aircraft not being configured with an internal cannon, one was required to be mounted on a centre-line pylon. Options become available to mount two additional 20 mm cannon gun pods, one under each wing which all together will spew out a slew of 20 mm rounds acting like a shotgun effect even at >500 m. [[AIM-9B]] and [[AIM-9E Sidewinder|AIM-9E]] Sidewinder missiles round out the Phantom's anti-air capabilities and are okay missiles to use against enemy aircraft which will cause the enemy pilot to take evasive manoeuvres to avoid the missile. In the event that happens, be ready with the cannons for backup as the enemy pilot should be an easy target after bleeding all of their speed and energy avoiding the missile.\n\n[[File:F 4 phantom markymark 002.jpg|350px|thumb|left|Bird's eye view of a {{PAGENAME}} from the VF-111 Sundowners squadron]]\n\nAnother arena where the {{PAGENAME}} shines is in the ground-pounding or ground attack function of the aircraft. With eleven hardpoints, this fighter/bomber can be configured in many different ways to carry a combination of guns, bombs and rockets. When it comes to bombs, the {{PAGENAME}} has the option to use either 250 lb, 500 lb, 750 lb or 1,000 lb bombs and can hold upwards of 9,000 lbs total. The Phantom also has three different rocket types to choose from, depending on the targets you are going after. These range from anti-tank AGM-12B and AGM-12C Bullpup guided rockets, Zuni Mk32 anti-tank rockets and the small but powerful FFAR Mighty Mouse in a volume of 228, which can be devastating when used en masse.\n\nThe amazing F-4 Phantom II was state-of-the-art in its day and even 60 years later, several countries are still utilising this iconic fighter/bomber as a force multiplier with their air forces today. This fighter coupled with a pilots skill and determination can help alter the outcome in the jet-battle matches.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\nThe {{PAGENAME}} is an incredibly stable aircraft, however from the way its wingtips and tailplanes look, one might think otherwise. Due to extensive wind tunnel testing, McDonnell engineers determined that by canting the tailplanes downward at a 23° anhedral (inclination) the stability and stall recovery characteristics of the aircraft dramatically improved and in the same fashion they didn't interfere with the engine's jet exhaust. The wings, on the other hand, were developed to be extremely strong to support large suspended armaments; however, they needed to be given a 5° upward inclination to prevent having to redesign the entire wing. So, the engineers elected to just raise the wingtips at a 12° dihedral which averaged the wing at the necessary 5°. The iconic shape of the {{PAGENAME}} was set.<ref name=\"Hachette\" />\n\nWith the airframe, wings and tailplanes set in place, the fighter became a stable and solid aircraft. Stability is especially critical with a jet which closes in on the Mach 2 mark. Early speed trials identified flaws in the aircraft which at times proved fatal, but corrections and modifications for later aircraft increased their stability and airworthiness which saved many pilots with damaged aircraft. The {{PAGENAME}} is powered by two General Electric J79-GE-15 engines which are necessary to keep the fighter/bomber in the sky, especially with heavy ordnance loads, however, these engines don't bog down too much under heavy loads as it will still accelerate in a climb, during level flight and during a dive. A testament to the jet and its engines, during one altitude test, the F-4 flew Mach 2 all the way to 90,000 feet where the engines were shut off and the plane coasted up to 98,000 ft, slowing to almost 45 mph and upon dropping back to Earth, fired up its engines at around 70,000 ft and successfully landed.\n\nThe Phantom II has the speed and acceleration and also has sufficient manoeuvrability. As a low altitude bomber, the F-4C needed to be manoeuvrable or else it would have been an easier target for either the MiG fighters or the anti-aircraft ground fire. Even with heavy ordnance loads, the Phantom II could still shimmy into position, release its ordnance and then rocket away to a higher altitude. Pilots found out early on that some MiG fighters like the -17 were extremely manoeuvrable and had to be prepared to nullify the target to prevent the MiG from getting behind them.\nFor the F-4C pilot, it is important when bombing targets to keep a look around and watch for enemy fighters attempting to swoop in, attack the ground target and rocket up to safety. When flying at altitude, be careful not to get into a turning fight as the Phantom is a very heavy aircraft and does not turn very well, instead fly fast and work with Boom & Zoom techniques and always watch your six as a MiG may try to sneak up from behind. Furthermore, beware pulling negative G's as this can result in a broken wing quite easily (especially if equipped with ordnance on the wing hardpoints).\n\nIn game, however, the aircraft will not reach both its maximum altitude of 16,000 m or top speed of over 2,000 km/h (even when unarmed and with the minimum fuel loadout). After about 8,000-9,000 m the aircraft starts to slowly lose nearly all lift and eventually plateaus at 12,132 m. In order to reach higher altitudes one must go supersonic, enter a steep climb, and then level off at the desired altitude (although currently this serves little to no gameplay purpose). As for its actual average speed, the F-4C is more likely to just barely break Mach 1 after about 30-40 seconds of level flight at any altitude with all upgrades (so keep this in mind when attempting to boom and zoom or outrun an opponent).\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 12,192 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 2,228 || 2,202 || rowspan=\"2\" | {{Specs|ceiling}} || 26.5 || 27.5 || 142.4 || 132.5 || rowspan=\"2\" | 850\n|-\n! Upgraded\n| 2,362 || 2,288 || 25.5 || 26.0 || 203.9 || 172.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| X || ✓ || ✓ || ✓ || ✓ || ✓     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || N/A || 584 || 463 || ~11 || ~4\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 810 || < 750 || < 700 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"5\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | {{Annotation|Basic mass|Mass of the aircraft with pilot and engine oil, but no fuel or weapons load}} || colspan=\"3\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | General Electric J79-GE-15 || 2\n| colspan=\"2\" | 13,405 kg || colspan=\"3\" | 392 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"4\" | Mass with fuel (no weapons load) || rowspan=\"2\" | Max Takeoff<br>Weight\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 9m fuel || 20m fuel || 30m fuel || 32m fuel\n|-\n| 1,720 kg || colspan=\"2\" | Afterburning axial-flow turbojet\n| 15,164 kg || 17,014 kg || 18,819 kg || 19,270 kg || 24,000 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB/SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"5\" | Thrust to weight ratio @ 0 m (WEP)\n|-\n! Condition || 100% || WEP\n! 9m fuel || 20m fuel || 30m fuel || 32m fuel || MTOW\n|-\n| ''Stationary'' || 4,910 kgf || 7,561 kgf\n| 1.00 || 0.89 || 0.80 || 0.78 || 0.63\n|-\n| ''Optimal'' || 4,955 kgf<br>(1,458 km/h) || 8,856 kgf<br>(1,200 km/h)\n| 1.17 || 1.04 || 0.94 || 0.92 || 0.74\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n[[File:F 4 phantom sgtroach.png|350px|thumb|right|Fox-2, Fox-2 - ROKAF F-4C Phantom II launching an [[AIM-9B]] Sidewinder missile]]\nDue to the sheer weight of the {{PAGENAME}} it is surprising to note that there is no armour plating nor any bulletproof canopies. Littered with eight fuel tanks, one in each wing and the other six in the fuselage right above the engines, there isn't much protection for the self-sealing tanks. The Phantom pilot will need to be cognizant of where enemy aircraft are behind them to ensure they prevent their aircraft from taking damage as speed and manoeuvrability are the keys to survival and if lost, there is not much hope for the fighter.\n\nFor those aircraft attacking the {{PAGENAME}}, when using machine guns and cannons an attempt can be made to try to blow off a wing or snipe the pilot, however, the best bet will be to aim for centre fuselage where there is the greatest chance of hitting several fuel tanks or even the engines. Firing missiles will cause the pilot to take evasive manoeuvres which may cause the aircraft to pitch up or down which will expose the greatest surface area allowing guns or cannons to finish the fight as for without any armour, only the thin metal skin separates the incoming bullets from critical {{PAGENAME}} components.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | [[Ballistic Computer]]\n|-\n! CCIP (Guns) !! CCIP (Rockets) !! CCIP (Bombs) !! CCRP (Bombs)\n|-\n| {{Tick}} || {{Tick}} || {{Tick}} || {{Cross}}\n|-\n|}\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n[[File:F 4 phantom news001.jpg|350px|thumb|right|Three-quarter view of an {{PAGENAME}} displaying the variance of suspended armament]]\n{{main|LDGP Mk 81 (250 lb)|LDGP Mk 82 (500 lb)|M117 cone 45 (750 lb)|LDGP Mk 83 (1,000 lb)|LDGP Mk 84 (2,000 lb)}}\n{{main|AGM-12B Bullpup|AGM-12C Bullpup|AIM-7D Sparrow|AIM-9B Sidewinder|AIM-9E Sidewinder}}\n{{main|BLU-27/B incendiary|FFAR Mighty Mouse|Zuni Mk32 Mod 0 ATAP|GAU-4 (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance presets:\n\n* 1 x 20 mm GAU-4 cannon (1,200 rpg)\n* 1 x 20 mm GAU-4 cannon + 2 x AIM-9B Sidewinder missiles\n* 3 x 20 mm GAU-4 cannons (1,200 rpg = 3,600 total)\n* 24 x 250 lb LDGP Mk 81 bombs (6,000 lb total)\n* 24 x 500 lb LDGP Mk 82 bombs (12,000 lb total)\n* 19 x 750 lb M117 cone 45 bombs (14,250 lb total)\n* 13 x 1,000 lb LDGP Mk 83 bombs (13,000 lb total)\n* 3 x 2,000 lb LDGP Mk 84 bombs (6,000 lb total)\n* 4 x BLU-27/B incendiary bombs\n* 1 x 20 mm GAU-4 cannon + 4 x AGM-12B Bullpup missiles\n* 1 x 20 mm GAU-4 cannon + 2 x AGM-12C Bullpup missiles\n* 285 x FFAR Mighty Mouse rockets\n* 60 x Zuni Mk32 Mod 0 ATAP rockets\n* 4 x AIM-7D Sparrow missiles\n\n==== Custom loadout options ====\n{| class=\"wikitable\" width=\"100%\" style=\"text-align:center\"\n|-\n! !! width=\"4%\" | 1 !! width=\"4%\" | 2 !! width=\"4%\" | 3 !! width=\"4%\" | 4 !! width=\"4%\" | 5 !! width=\"4%\" | 6 !! width=\"4%\" | 7 !! width=\"4%\" | 8 !! width=\"4%\" | 9 !! width=\"4%\" | 10 !! width=\"4%\" | 11\n| rowspan=\"16\" width=\"30%\" | <div class=\"ttx-image\">[[File:Hardpoints_{{PAGENAME}}.png]]</div>\n|-\n! FFAR Mighty Mouse rockets\n| 57 || 57 || || || || 57 || || || || 57 || 57\n|-\n! Zuni Mk32 Mod 0 ATAP rockets\n| 12 || 12 || || || || 12 || || || || 12 || 12\n|-\n! 250 lb LDGP Mk 81 bombs\n| 6 || 3 || || || || 6 || || || || 3 || 6\n|-\n! 500 lb LDGP Mk 82 bombs\n| 6 || 3 || || || || 6 || || || || 3 || 6\n|-\n! 750 lb M117 cone 45 bombs\n| 4 || 3 || || || || 5 || || || || 3 || 4\n|-\n! 1,000 lb LDGP Mk 83 bombs\n| 2 || 3 || || || || 3 || || || || 3 || 2\n|-\n! AGM-12B Bullpup missiles\n| 1 || 1 || || || || || || || || 1 || 1\n|-\n! BLU-27/B incendiary bombs\n| 1 || || || || || 2 || || || || || 1\n|-\n! 20 mm GAU-4 cannons (1200 rpg)\n| 1 || || || || || 1 || || || || || 1\n|-\n! 2,000 lb LDGP Mk 84 bombs\n| 1 || || || || || 1 || || || || || 1\n|-\n! AGM-12C Bullpup missiles\n| || 1 || || || || || || || || 1 ||\n|-\n! AIM-9B Sidewinder missiles\n| || || 1, 2 || || || || || || 1, 2 || ||\n|-\n! AIM-9E Sidewinder missiles\n| || || 2 || || || || || || 2 || ||\n|-\n! AIM-7D Sparrow missiles\n| || || || 1 || 1 || || 1 || 1 || || ||\n|-\n| colspan=\"12\" | Maximum permissible weight imbalance: 1,500 kg\n|-\n| colspan=\"13\" | * The AGM-12C Bullpup missile on hardpoints 2/10 cannot be carried in conjunction with air-to-air missiles on hardpoints 3/9 respectively.\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n[[File:F 4 phantom markymark 001.jpg|350px|thumb|left|VF-96 Showtime-100 F-4C unloading bombs in Vietnam]]\nThe {{PAGENAME}}  frankly, not a dogfighter. That is because the F-4C's ungainly maneuverability, large size and lack of countermeasures leave it heavily disadvantaged and an easy target should one catch it in weapons range. The F-4C's best friend is its good speed and powerful M61 Vulcan cannon. As a result, F-4C pilots are forced to act as vultures, staying fast and using missiles or gunpods to pick off hapless targets of opportunity.  \n\nIn air battles, it is entirely up to you on which modifications to research first. More air-to-air missiles are typically better, so you will want to prioritize researching the AIM-9B, AIM-9E and AIM-7D missiles. While these missiles certainly are an advantage, many of your air-to-air kills will be made using the M61 20mm cannon (which you have stock), so while not having these missiles is a handicap, you can certainly still effectively fight air-to-air without them in order to research modules. If you aren’t confident in your aerial fighting ability in the F-4C, then ground attack in Air Realistic Battles can be a profitable avenue for advancement, as the 20 mm cannon is more than capable of destroying high value targets such as light pillboxes and tanks. When stock, it is recommended that you first unlock some basic ground ordinance before adding this to your Ground RB lineup (see [[F-4C Phantom II#Ground pounding|\"Ground Pounding\"]] for further information). While the 20mm cannon is good for air-to-air and against thinly armored vehicles, it will at most only be able to harass more heavily armored MBTs.\n\n==== Air-to-air ====\nDue to its size and weight, it is heavily recommended not to turn-fight in the F-4C. As stated earlier, speed and its weapons systems will be the F-4C’s best friend. Stock, it comes with the powerful M61 Vulcan 20mm rotary cannon, which boasts excellent damage, fire rate and velocity, and also comes with a adequate ammo pool. Additionally, once the gunpod modification is researched, two more gunpods can be added for insane frontal firepower, though this adds significant drag. It also comes with two AIM-9Bs stock, which  turns into a maximum of four AIM-9Es when they are researched. These are only the basic, entry level air-to-air missiles, and will be very easily dodged; due to this, you generally won’t be using them as your primary weapons.  Only use them when necessary, such as when the enemy isn’t paying attention (won’t see the missile coming) or is very slow. Regardless, the AIM-9s can make for reliable backup anti-air missiles that can at the very least force an enemy into a disadvantageous position. [[File:F-4C A-5 kill.jpg|350px|thumb|A F-4C eliminating a enemy A-5 with a AIM-7D Sparrow missile]]\nThe F-4C’s specialty is it’s AIM-7D Sparrow Semi-Active Radar Homing (SARH, or basically, radar guided) missiles. To use them, you must first radar lock a target, and then the AIM-7 can be launched. You must keep the target radar locked for the entire duration of the missile’s flight, or else it will stop tracking. The AIM-7D has great range; under ideal conditions, they can hit non-manoeuvring targets from upwards of a 10 Kilometer launch. It has a 15G manoeuvring capability, meaning it can follow targets in a turn decently well. And since they are radar guided, they are all-aspect missiles, meaning they can be launched from any angle, including from the front. On paper, this sounds like a great missile, especially at a BR of merely 10.0. Unfortunately, two major factors significantly reduce the effectiveness of this missile, and one may find it simply constantly missing. First, perhaps the AIM-7D’s biggest downside is that it has a 1 kilometer warmup range before it starts tracking. What this means it that, once fired, it will always travel in a straight line for one kilometer (around 2-3 seconds) before it starts manoeuvring itself towards the target. While at longer ranges (7km+) this generally isn’t a problem, it is most problematic when the missile is launched at close ranges (with usual speed and at around 4 kilometers or less); in these cases, the missile won’t start manoeuvring until it’s very close to the enemy (less than 1.5km), which usually isn’t enough time for the missile to turn into the now very close enemy. Additionally, this initial straight line travel means that there is a chance the enemy can move out of the missile’s field of view before it can track, in which case the missile will simply blow up and do nothing. The other problem which hampers the AIM-7 doesn’t have to do with the missile itself, but rather the radar that guides it— that is, the F-4C’s own unreliable radar. Despite it having a maximum listed range of over 150km, in-game, typically you will only see the radar start picking up targets at less than 20km. Commonly, the radar fails to see a target directly in front of it until it gets closer (less than 9km). This is a significant downside, when coming back to the topic of the AIM-7D, as oftentimes the radar will pick up a target too late to reliably launch an AIM-7D in time (due to it’s 1km initial straight line travel). Additionally, the radar sometimes randomly loses lock on a target, which doesn’t help the situation at all. Overall, the radar generally struggles to do it’s job, even under ideal conditions. \n\nUnguided rockets are another option for this aircraft, however they are not recommended for air-to-air combat. While extremely large amounts of FFAR Mighty Mouse rockets can be carried, they are highly inaccurate for air-to-air combat, and even with a timed fuse, you generally won’t be routinely hitting anything as aircraft are very fast at this BR (don’t expect an F-89D-like experience). The Zuni rockets, on the other hand, create large explosions, and when the timed fuse is used correctly, they can be used somewhat reliably. However, the main downside of these rockets are that they are both carried in rocket pods which stay attached to the aircraft even after the rockets are fired.  These rocket pods are large and heavy and significantly impact manoeuvrability and performance. This impact on performance is why it isn’t recommended to use them in air combat; stick to using them for ground strikes. \n\nAt it’s BR of 10.0, the F-4C’s is one of the lowest BR aircraft in the game to  feature BVR capability with radar-guided AIM-7s. As such, it is recommended to try to exploit this capability, and the best way to do this is to zoom climb to high altitude (at least 5km) at the start of the match. There are three main reasons why you should do this. First, the ground gives a massive radar return which blinds all early airborne radars (including the F-4C’s) from detecting or locking anything at low altitudes. As no radar lock can be achieved at all, this renders the AIM-7D pretty much useless dead weight below 2 kilometers altitude. However, at higher altitudes, the radar has a much easier time locking targets, so the AIM-7D must be used up high. Next, due to thinner air, missiles will have a significantly longer range, while aircraft will have trouble manoeuvring and regaining speed. This increases the chance your missile will hit the enemy. Finally, and perhaps most importantly, early game tends to be the only time where enemy targets will be at these high altitudes. This is because, in air RB, players tend to start at high altitude but eventually end up at low altitude, where furballs start to form. These low altitude fights encountered after the start of the game are exactly where the F-4C’s radar and in turn AIM-7s don’t work, so you want to use them in the start of the game. Commonly, you will encounter A-5Cs, Harriers, and other well-climbing aircraft at high altitude, which you can use your exclusive radar guided missiles on. AIM-7Ds can hit at launch ranges up to 15km, though this requires the enemy travels in a straight line. You will want to keep your speed up, as this not only allows you to have some defensive options (such as running away from enemies), launching missiles while at higher speeds also means they start off with more speed and therefore more range. Additionally, you can use the powerful M61 Vulcan to engage targets which can’t be engaged with missiles. Something you may not want to do is go by yourself, because as mentioned before, your subpar manoeuvrability ability means that fighting on your own will likely not end well. If an aircraft with similar speed engages you, you will be pinned down with little options. Additionally, your lack of countermeasures actually makes high altitudes dangerous for you as well, as the thinner air limits your ability to dodge missiles. The AIM-7Ds are fairly strong, but can also be defeated with moderate defensive manoeuvers, so it is a mistake to expect that they make you invincible, and it is mistake to think you will be able to wipe the high skies clean on your own with the AIM-7s. Due to this, try your best to stay near teammates at high altitude. \n\nAfter your AIM-7s are gone or no targets at altitude can be found, move down to lower altitudes to fight. Below 2 kilometers, your primary weapons will be your cannons and AIM-9s; don’t even consider the AIM-7s at low altitude. As the Phantom lacks in manoeuvrability, it is not recommended to get into a dogfight, but rather to utilize the phantom’s great top speed to make high speed passes, as the Phantom retains controllability even at very high speeds while the Vulcan's incredibly high muzzle velocity allows for ease of aiming at high speed. Try to make sure no one can/will bother following you though these passes so you aren’t forced to turn into a dogfight.\n\nIn a downtier, the F-4C can act independently as it can easily outspeed most enemies. Additionally, most enemies in a downtier lack a radar warning receiver (RWR), allowing you to radar lock them and launch AIM-7Ds without alerting them in any way until they spot the missile. The F-4C's high top speed and high speed controllability allows the plane to boom-and-zoom and quickly getting out of a furball without much issue. Again, it is not recommended to get into a dogfight, as nearly all subsonics encountered in a downtier will out-maneuver you \n\nIn a full uptier, it is recommended to fly near teammates and support them, as the F-4C has inferior top speed, manoeuvrability, and weapon systems making it very difficult to dogfight any high-tier fighter. In addition, it’s lack of countermeasures generally means that if a high tier fighter gets on your tail, you are generally guaranteed to die. Therefore, the same boom-and-run mindset should be used as stated before. Keep your speed up as it will be your best (and only) defense against missiles, and make high speed passes with your M61 cannon. AIM-7Ds still can be used at higher altitudes, but know that even your BVR capability is outclassed by much of the opposition, so caution must be taken. Try your best not to catch the attention of anyone, as if anyone focuses on killing you, you won’t survive. At the very least, enemies may not focus on you as much as you generally won’t be of very high threat level. \n\nIn Air Arcade battles, this aircraft's flaws are a lot more forgiving and it can see far more utility, especially with its gunpods. As with nearly all aircraft in Air Arcade, the minimum fuel option should be your default choice, as you will rarely if ever run out of fuel due to low survival time and overall match time in arcade battles. Even if you do run out, your airfield is a short distance away once you notice your fuel is low. The recommended armaments remain the same as in Air RB, but with much more leeway to tack on ground ordinance to quickly destroy large groups of armor (especially at the start of the \"Domination\" gamemode). Even the lack of countermeasures can be worked around via clever use of terrain on most maps. Tactics for fighting aircraft around your BR remain the same as in Air RB, albeit they're much easier to execute and you have unlimited missiles. Because of the latter, you'd think side climbing could be a legitimate tactic, but due to the poor radar of the F-4C, the rarity of high-altitude fighting in Arcade, and/or the heavy terrain clutter on most maps you'll rarely find many targets to shoot at. Again, try to avoid turnfighting as manoeuvrability is subpar. \n\n==== Ground pounding ====\n[[File:F 4 phantom iscari.png‎|350px|thumb|right|Fully loaded {{PAGENAME}} en route to bombing site]]\nThe {{PAGENAME}} was not called a \"Mud Mover\" for nothing as with its legendary suspended ordnance options it can quickly reshape the landscape with bombs and rockets.<ref name=\"Hachette\" /> Although in War Thunder there are better CAS options at or around this BR in the American tech tree (the [[F-105D]] being superior in all forms as it can carry countermeasures in addition to its ground ordinance). Nonetheless, the Phantom II's ballistic computer and bomb options ranging from 250, 500, 750 and 1,000 lbs let it effectively attack ground targets ranging from large bases to armor. The triple gunpods in particular can made the F-4C very efficient in destroying ground units in air battles, as they can destroy all but the heaviest of targets and have a large ammo count (allowing one to rack up significant score before having to rearm). Zuni and FFAR Mighty Mouse rockets can be used for great effect on vehicles and anti-aircraft sites, especially those which are clustered close together, however against heavy pillboxes and heavy tanks they might not do much. The final option is to outfit the AGM-12B or AGM-12C Bullpup rockets. These are this aircraft's best anti-tank ordinance in Ground Realistic battles and should be your first modification to unlock before usage in said battles. But know that while these missiles can be guided, this can only be done manually and, at this BR, puts the F-4C at significant risk due to the chances of radar guided AAA or a SAM shooting the F-4C down. During the guiding phase of the Bullpup, a Phantom II is vulnerable as the pilot cannot be looking around for incoming enemy fire and must keep a visual on the target if they intend to guide it. A common tactic with the bullpups is to simply utilize them as if they were high-yield unguided rockets (forgoing any guidance input to turn the bullpups into rocket powered bombs); since they fly in a straight line, the F-4C pilot can easily line the nose up to the targets, fire the bullpups, and then immediately pull away. This is even more lethal with the AGM-12Cs as they have a 1000 lb warhead compared to the 250 lb warhead on the AGM-12B. Dogfighting in Ground Realistic battles is somewhat rare and nearly always limited to low altitude visual range (where the radar of the F-4C has trouble locking any target), as a result the Sparrows can usually be omitted for a performance improvement.\n\n==== Bait attack ====\nThe {{PAGENAME}} is a phenomenal aircraft to use in a group manoeuvre known as a baiting attack. This fighter can play both roles as either the bait or an attacking aircraft. For this to work, the Phantom II can be used as the bait aircraft, which flies in a way to attract the attention of an enemy fighter (or two), after closing in, the Phantom II should use its speed and acceleration to go into a climb, almost like setting up for a rope-a-dope manoeuvre. While the enemy aircraft are attempting to chase the F-4 in the climb the group buddies can swoop in and take out the distracted enemy aircraft. Due to the fast speed and acceleration of the F-4, it can also be used as the support aircraft in the manoeuvre as with its cannons and missiles; it can lunge in to take out the baited enemy fighters.\n\n==== Most dangerous enemies ====\nMiG fighters, Mirages, and [[VTOL]] aircraft tend to be the most dangerous enemies, especially the MiG-21 and Harrier variants, which are quite agile and can easily outmanoeuvre the F-4. The max speed of the MiG-21 and the Mirages are comparable with the F-4, whereas aircraft such as the earlier MiG-17 and MiG-19 will get left in the dust as they are almost half as fast. The early MiG-21 variants like the [[MiG-21F-13]] and [[J-7II]] can carry the R-3S/PL-2, missiles similar to the AIM-9B but inferior to the AIM-9E. They can also be equipped with rockets, and the 30 mm cannons can rip through the {{PAGENAME}} with careful aiming. The best bet against a MiG-21 is to attempt to first cripple the aircraft either during a head-on approach or through a missile, rocket or gun attack, once it is operating at less than 100%, it will be easier to manoeuvre around it and set up for the finishing blow. When facing a Harrier, Hunter, Mirage, or other Phantom variant the same strategy applies as they can be difficult to outmanoeuvre when in pristine shape. Although with the Phantoms and Mirages, it is best to avoid a head on approach due to the potential danger of a wall of fire from triple SUU-23/A gunpods (from the Phantoms) or taking a radar guided missile to the face (from both the Phantoms and the Mirages). Be wary of aircraft like the [[Mirage IIIC]], [[Mirage IIIE]], [[MiG-21SMT]], [[MiG-21MF (Germany)|MiG-21MF]], [[Yak-38 (Family)|Yak-38]], [[Hunter F.6]], and [[Harrier GR.1]] as they can carry up to four (two in the case of the Yak-38s and Mirages) high-performance missiles such as the [[R-60]] for the MiG-21s and Yak-38s, the [[SRAAM]]s for the Hunter and Harrier, and the [[Matra R550 Magic 1]] missile for the Mirages respectively. These are air-to-air missiles with high agility and high-aspect capability that are extremely difficult to dodge without countermeasures (something the F-4C lacks). Furthermore, foreign variants of the Phantom can match the F-4C in performance and often come equipped with later (higher-performing) variants of the Sidewinder and Sparrow missiles. \n\nIn Ground realistic battles, the most dangerous ground enemies are all SAM vehicles, but especially the radar SAM vehicles such as the [[FlaRakPz 1|FlaRakPz 1 Roland 2]] and [[2S6|2S6 Tunguska]] as they outrange the F-4C's Bullpups and on some maps can even immediately fire at the plane seconds after spawning. Due to the lack of countermeasures, the F-4C's only defense against any missile is maneuvering and/or the terrain so if using this aircraft while such threats are active, dive as low as possible to get below their radar horizon. Radar guided AAA is also prevalent at this rank, but can be much more easily worked around due to their limited range (especially when using the Bullpups).\n\nThe most common missiles to face are the SRAAM, AIM-9J, -9G, -9E, -9B, -7E, the R3-S, R-60 and Magics. In order to dodge a SRAAM, do not try turning. Instead, the F-4C must go fast and get separation from the SRAAM. The SRAAM relies on thrust vectoring, instead of control surfaces like most other missiles, and therefore cannot manoeuvre and will self destruct once the missile runs out of fuel, giving them very short ranges. AIM-9Gs have incredibly long ranges, so even if one is launched at the F-4C from 4 km, the plane must manoeuvre in order to lose it. An F-4C pilot can either attempt to outturn it (they have worse agility than an AIM-9J, Magic or R-60), or attempt to outspeed it. By waiting for it to run out of fuel (this only works at long ranges), the plane can do big barrel rolls and large turns (not too sharp as to lose speed), and since missiles are incredibly light and will not be able to propel itself once it runs out of fuel, it will lose speed and the F-4C will outrun it. for an AIM-9E, -9E, or R3-S, the F-4C can simply turn a bit to the side and it will quickly lose track. Against an R-60, AIM-9J or Magic however, it is a bit more complex: the most effective way to outmanoeuvre one without countermeasures is to roll 90 degrees so the F-4C's wings are perpendicular to the ground, turn, wait a bit, then begin rolling to the ground and keep pulling. this will usually outmanoeuvre most missile launched at the F-4C. However, a F-4C pilot should not turn to the sky as the plane will quickly drop speed and make it easier for a missile to hit.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n[[File:F 4 phantom commander drew.jpg|350px|thumb|right|Artistic rendition of a {{PAGENAME}} in a power climb]]\n\n'''Pros:'''\n\n* Impressive variety and maximum payload of ordinance, including: 20 mm cannon gunpods, bombs, rockets, and air-to-air and air-to-ground missiles\n** Can equip the AIM-7D Sparrow and AIM-9 Sidewinder air-to-air missiles at the same time (with a maximum of four each) in addition to five pylons for ground attack ordinance\n* Has BVR (Beyond Visual Range) engagement capability with the radar-guided AIM-7D Sparrow\n* Has a ballistic computer, which allows for accurate usage of unguided air-to-ground weapons and the cannon\n* Fantastic rate of climb\n* Good top speed \n* Great acceleration\n* Good roll rate for a large aircraft\n* M61 Vulcan has excellent fire rate, ballistics and damage, as well as a generous ammo pool\n\n'''Cons:'''\n\n* As it has no internal gun, some sort of weapon must be equipped on the pylons, meaning flight performance will always be lower than listed due to drag and/or G-limits\n* Large target profile compared to other fighters it flies against\n* Poor turning ability unless using minimum fuel\n* Manoeuvrability suffers greatly with fully loaded pylons\n* Using wing-mounted hardpoints will break wings at low altitudes while flying Mach 1.10+\n* Has a low negative G limit, meaning wings can snap easily\n* The gunpods are pointed slightly downwards (pilot must adjust aim to compensate)\n* No countermeasures\n* Radar has difficulty finding and locking aircraft, even in ideal conditions\n* AIM-7D Sparrow missiles are unreliable\n** Unlike the Soviet R3R or Matra R530E, the AIM-7D has a 1 km warm up time where it flies completely straight, and once it completes the \"warm up\", it can begin tracking, but if it is not within the missile's sights, it will automatically self destruct, requiring the F-4C to lead the missile. This also makes it less reliable in a short range head on as the closing distances may be too fast for the missile to react\n* AIM-9B and AIM-9E Sidewinder missiles perform poorly \n\n<br>\n{{Notice|Fun Fact: The {{PAGENAME}}'s air-intake splitters each have 12,500 small holes drilled into them to reduce incoming turbulence and allow the maximum amount of ram air available into the air-intakes for the engines.}}\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nMcDonnell Aircraft Corporation began operations in 1939, though it didn't produce any fighter aircraft for the second great war, it did make a name for itself manufacturing aircraft parts for other aircraft. Though the company worked on a prototype twin-engine, single-seat interceptor aircraft, the XP-67 \"Bat\" (also known as \"Moonbat\"), the destruction of the prototype due to an engine fire caused the project to be cancelled. However, starting in 1943, McDonnell began developing jet aircraft and successfully produced the FH-1 Phantom during the post-war era.<ref name=\"Hachette\" /> The success of the Phantom prompted other McDonnell aircraft to have similar features such as the dual engines placed forward under the fuselage and exiting just behind the wings, unlike many single-engine jet fighters which ran the rear length of the aircraft and exited out the rear. Follow on aircraft which shared the engine style of the Phantom was the F2H Banshee, F3H Demon and the F-101 Voodoo.<ref name=\"Hachette\" />\n\nThough McDonnell had initial success with the Phantom and Banshee, they started having problems with the Demon, though it was not because of the aircraft itself, however, it was because of the engines it was outfitted with. The aircraft was sound in its construction and aerodynamics. Later after the Westinghouse XJ40 turbojet was replaced with the Allison J71, the Demon saw greater success.<ref name=\"Hachette\" /> The F-101 Voodoo was an excellent performing aircraft which fulfilled its multi-role capability as an interceptor, fighter/bomber and reconnaissance aircraft, however, when going up against Vought Aircraft Company for a contract with the Navy, McDonnell lost out with the F-8 Crusader being the winner<ref name=\"Joiner\" />.\n\nMcDonnell's response to this failure was to task their design team to build a fighter aircraft that the Navy could not refuse, but they did not yet know they needed. Part of the time spent gathering information included interviews with pilots and their wives and one major find was that while the pilots loved to fly fast single-engine fighters, they felt safer in an aircraft which had two engines. With this and other information in hand, McDonnell knew that they needed a single-seat, long-range attack aircraft which manifested itself in a full-size mock-up as the F3H-H, looking noticeably like a combination of a shortened Demon with the swept wings of a Banshee, plus straight tailplanes and an aerodynamic fuselage. This fighter was outfitted with four internal 20 mm cannons plus numerous external payload pylons mounted under the wings and fuselage. The F3H-H was considered more than just an aircraft and was evolving into what would be known as a weapon system. The original engines specified for this aircraft were the Wright J65-W-2, but McDonnell was eyeballing the new General Electric J79 engines for this project.<ref name=\"Hachette\" />\n\nThe F3H-H was soon changed to the AH-1 (later the F4H-1) when it went into prototype status, but the aircraft was still having difficulty trying to find a place in the Navy as existing aircraft were already fulfilling the same roles. To make a fit, it was understood to the McDonnell engineers that major changes and modifications were needed to be made, the biggest of which was adding a second crew member.<ref name=\"Hachette\" /> Also, the Navy was willing to sit down and detail out all of the requirements they would need the aircraft to have before they would consider buying it.<ref name=\"Joiner\" /> Three other major requirements were that the aircraft was to be outfitted with the GE J79 engines, the aircraft was to be capable of Mach 2 and the internal 20 mm cannons were removed from the design. Upon the Navy committing to two prototypes, McDonnell knew they needed to undergo a major redesign of the flight surfaces. Through extensive wind tunnel testing the rear tailplanes ended up needing to be bent downward at a 23° anhedral while remaining clear of the jet exhaust. The wings needed to go through a similar change of a 5° dihedral, however, to save time and engineering, it was settled on just adjusting the outer most section of the wings at 12° dihedral which averaged to 5° across the entire wing.<ref name=\"Hachette\" />\n\nThough the first two test flights of the F4H-1 ran into issues (after the first one, the right engine needed to be replaced due to foreign object damage to the compressor blades), flights three and four went smoothly including exceeding Mach 1. The F4H-1 was then shipped to Edwards Air Force Base where it was tested against the Crusader III where after being tested to its full capabilities showed that is undeniably beat the Vought aircraft across the board. Following this McDonnell followed up with breaking a height record where an F4H-1 successfully reached 98,500 ft in altitude and successfully returned. After this, the name of the jet was agreed to be the \"Phantom II\" which was a nod to the Navy's first jet fighter, the FH-1 Phantom.<ref name=\"Hachette\" />\n\nThe United States Marine Corps had shown interest in the F-4 program since its inception as they were tired of the worn-out hand-me-downs that Navy tended to give them.<ref name=\"Roblin\" /> Impressed with the payload and range of the aircraft, the Corps went all in with this fighter to augment and enhance their current aircraft inventory. The United States Air Force, on the other hand, balked at the F-4, believing it to be a second-rate fighter having to be constrained to be built for carrier operations. However, the Air Force could not turn down a request to pit the Phantom II against their finest fighter, the Convair F-106 Delta Dart. During the endurance trials between the two aircraft, again it was shown that the F-4 excelled in just about every area tested (speed, payload, altitude, range and maintenance hours needed) over the F-106 and because of this, the Air Force requested two prototypes for further evaluation.<ref name=\"Hachette\" /> At this point the Navy was receiving the F-4B fighters and ultimately after further testing, the Air Force put in an urgent request for a transfer of 29 Navy F-4Bs while the Air Forces F-4C models were being built.<ref name=\"Hachette\" />\n\nAir Force versions of the F-4C differed from the Navy's F-4B in that the C version had additional ground-attack capabilities along with a full set of controls for the rear seat.<ref name=\"Joiner\" /> The rear-seater was typically a junior pilot nicknamed \"Wizzo\" or Weapons Systems Operator. Other changes included a reworking of the landing gear which led to lower pressure, but wider tires and an anti-skid assembly attached to the landing gear.<ref name=\"Hachette\" /> The refuelling probe was replaced with a receptacle in the spine of the fighter (for boom refuelling operations) and the cockpit was reconfigured to improve visibility for the guy in back. Updated SST-181X Combat Skyspot radar bombing system allowed the F-4s to accomplish bombing missions under complete cloud cover. Though, not essential to the Air Force, their F-4s did retain the Navy's folding wings, catapult hooks and arrestor hook.<ref name=\"Hachette\" />\n\nInitial deliveries of the F-4C delivered them in the standard non-combat grey and white paintwork; however, upon arriving in Vietnam at Udon RTAFB in Thailand, the aircraft was painted to the more appropriate green and brown tactical camouflage.<ref name=\"Hachette\" />\n\n===[[wt:en/news/6352-development-f-4c-phantom-ii-the-record-breaker-en|Devblog]]===\nIn the early 1950s, McDonnell Aircraft began work on a revised design of their F3H Demon naval fighter, in an effort to expand upon its capabilities and improve performance in general. By September 1953, the design was submitted for Navy consideration. Showing interest in the project, the U.S. Navy ordered the construction of a mock-up and expressed interest in potentially procuring the type.\n\nBy 1955, however, the U.S. Navy changed the requirements for the aircraft substantially. Instead of a multipurpose aircraft, the new design was now supposed to act as a two-seat, long-range, all-weather fleet interceptor. Having revised the design, orders were issued for the construction of two XF4H-1 prototypes as well as an additional five pre-production F4H-1s. Following comparative testing against other machines in service with the Navy at the time, the F4H proved itself as highly capable aircraft and was thus ordered into full-scale production as the F-4. The name 'Phantom II' was given to the aircraft at McDonnell's 20th anniversary celebration in July 1959.\n\nSome time after the Navy procured the F-4, other branches of the U.S. military also became interested in the aircraft. A result, the USAF also introduced a special \"army\" version of the F-4 into service during the mid 1960s under the designation F-4C.\n\nThe F-4 Phantom II would become one of the most produced and widely used American combat aircraft of the second half of the 20th century. With over 5,100 machines being built, the F-4 Phantom II saw service with several operators around the globe and remained in service until the 1990s, while some still serve to this day. Phantom II is widely known as a symbol of the US campaign in Vietnam, in particular.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=f-4c Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed\" heights=\"200\">\nFile:F 4 phantom news002.jpg\nFile:F 4 phantom news003.jpg\nFile:F 4 phantom news004.jpg\nFile:F 4 phantom news005.jpg\nFile:F 4 phantom news006.jpg\n</gallery>\n\n;Videos\n{{Youtube-gallery|aFj2LOWdj5o|'''The Shooting Range #166''' - ''Metal Beasts'' section at 00:32 discusses the {{PAGENAME}}.|d5k2T9FP0bQ|'''Avoid them in frontal attack!''' discusses the {{PAGENAME}} at 4:01 - ''War Thunder Official Channel''}}\n\n;Notable pilots\n\n[[File:Robin_Olds_portrait.jpg|thumb|none|300px|link=User:U64962917#Olds,_Robin.|During the Vietnam war [[User:U64962917#Olds, Robin|Robin Olds]] flew the F-4C and F-4D fighters and failed to claim aircraft kills after #4 to prevent attaining ace status to remain flying in the war as long as possible]]\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Aircraft of comparable role, configuration and era\n\n* Mikoyan-Gurevich [[MiG-21 (Family)]]\n* SAAB [[J35D]] Draken\n* Dassault [[Mirage IIIC]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/6352-development-f-4c-phantom-ii-the-record-breaker-en|[Development] F-4C Phantom II: The Record Breaker]]\n* [https://forum.warthunder.com/index.php?/topic/462647-f-4c-phantom-ii/ Official data sheet - more details about the performance]\n\n=== References ===\n\n;Citations\n<references>\n<ref name=\"Hachette\">Hachette Partworks LTD. (2019)</ref>\n<ref name=\"Joiner\">Joiner, S. (2015, March)</ref>\n<ref name=\"Roblin\">Roblin, S. (2019, April 17)</ref>\n</references>\n\n;Bibliography\n\n* Hachette Partworks LTD. (2019). McDonnell F-4 Phantom II - The Greatest Warplane in the West. (5th ed.). London: Hachette Partworks LTD. ISSN:[https://portal.issn.org/resource/ISSN/2517-259X# 2517-259X]\n* Joiner, Stephen. [https://www.airspacemag.com/military-aviation/what-couldnt-f-4-phantom-do-180953944/ \"What Couldn't the F-4 Phantom Do?\"], ''Air & Space Magazine'', On-line, March 2015. Retrieved on 27 September 2019.\n* Roblin, Sebastien. [https://nationalinterest.org/blog/buzz/why-you-need-respect-mcdonnell-douglas-f-4-phantom-ii-fighter-52862 \"Why You Need to Respect the McDonnell Douglas F-4 Phantom II Fighter\"] ''Nationalinterest.org website'', On-line 17 April 2019.  Retrieved on 27 September 2019.\n\n{{AirManufacturer McDonnell}}\n{{USA jet aircraft}}"}}