{"title":"F-4E Phantom II","pageid":9628,"wikitext":{"*":"{{About\n| about = American jet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = F-4 Phantom II (Family)\n}}\n{{Specs-Card\n|code=f-4e\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} American jet fighter {{Battle-rating}}. It was introduced in [[Update 1.97 \"Viking Fury\"]].\n\nThe mighty F-4E Phantom II is a famous US aircraft from the Vietnam War era and a reliable workhorse of many militaries around the world. Powered by two General Electric J79-GE-17 jets, each producing an incredible 8,010 kgf on maximum afterburner, the F-4E boasts high speed and a solid climb rate. Leading-edge \"Agile Eagle\" slats increase its turning capability and somewhat mitigate the reputation of the Phantom family as flying bricks. In the weapons department, the F-4E has access to AIM-7E-2 Sparrows for medium-to-long range combat, AIM-9J Sidewinders for close-in work, and an enormous array of ground attack ordnance including AGM-65 Maverick air-to-ground missiles and AGM-62 Walleye glide bombs. This multi-role vehicle is a supremely capable ground attacker and a competitive fighter, though in air combat pilots must account for its lack of a pulse-Doppler radar.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 12,192 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 2,097 || 2,074 || rowspan=\"2\" | {{Specs|ceiling}} || 26.5 || 27.5 || 160.8 || 151.2 || rowspan=\"2\" | 850\n|-\n! Upgraded\n| 2,202 || 2,140 || 25.5 || 26.0 || 221.6 || 190.0\n|-\n|}\n\n==== Details ====\n[[File:F-4E Phantom II deploying drogue chute.png|right|thumb|420x420px|A ROKAF F-4E Phantom II from to 153th Combat Squadron deploying its drogue chute for landing]]\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| ✓ || ✓ || ✓ || ✓ || ✓ || ✓     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 607 || 584 || 463 || ~11 || ~4\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 810 || < 750 || < 700 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"4\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | {{Annotation|Basic mass|Mass of the aircraft with pilot and engine oil, but no fuel or weapons load}} || colspan=\"2\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | General Electric J79-GE-17 || 2\n| colspan=\"2\" | 14,205 kg || colspan=\"2\" | 408 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"3\" | Mass with fuel (no weapons load) || rowspan=\"2\" | Max Takeoff<br>Weight\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 9m fuel || 20m fuel || 30m fuel\n|-\n| 1,750 kg || colspan=\"2\" | Afterburning axial-flow turbojet\n| 15,964 kg || 18,027 kg || 20,069 kg || 24,000 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB/SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"4\" | Thrust to weight ratio @ 0 m (WEP)\n|-\n! Condition || 100% || WEP\n! 9m fuel || 20m fuel || 30m fuel || MTOW\n|-\n| ''Stationary'' || 5,200 kgf || 8,010 kgf\n| 1.00 || 0.89 || 0.80 || 0.67\n|-\n| ''Optimal'' || 5,200 kgf<br>(0 km/h) || 10,170 kgf<br>(1,400 km/h)\n| 1.27 || 1.13 || 1.01 || 0.85\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\nThe survivability features of the {{PAGENAME}} have grown compared to its [[F-4C Phantom II|predecessor]] with an armour plate and missile countermeasures attached.\n\nBy this stage in the high-rank battles, all the fuel tanks are self-sealing. While this will assist with any fuel tank punctures from machine gun calibre weapons, the presence of fast-firing autocannons and missiles mean that these self-sealing tanks are only an accessory to the overall survival of the aircraft.\n\nThe addition of an armour plate is a minor benefit as it is only an 8.5 mm steel plate just below the forward fuel tank in the fuselage. This is only thick enough to block a glancing shot to the fuselage. Its most effective use seems to when the {{PAGENAME}} as it is pulling up from an attack run, as it is in that angle where the armour plate can potentially block any shot threatening the fuselage fuel tanks and engine. However, considering the small size it is made up of and the large plane overall, this armour plate should not be relied upon for the overall survival of the aircraft.\n\nThe biggest change from previous version is the countermeasure flares, which are greatly useful at deterring incoming infrared-homing missiles like the [[AIM-9J Sidewinder|Sidewinders]] or [[R-60]]s. To utilise the flares, one must turn off their engine afterburners to eliminate that as a significant source of heat, deploy the flares in a suitable manner, then bank away from the flares to that the missile lock onto the remaining heat source rather than the plane's engine.\n\nA survivability feature shared with its predecessor is the Radar Warning Receiver (RWR). The RWR will ping the player in the source of any incoming radar scans, and will also notify if the radar source have achieved a lock-on with the player. Keep an eye on this as it may signify to the player that an enemy semi-active radar homing missile may be launched soon and evasive actions should be taken.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | [[Ballistic Computer]]\n|-\n! CCIP (Guns) !! CCIP (Rockets) !! CCIP (Bombs) !! CCRP (Bombs)\n|-\n| {{Tick}} || {{Tick}} || {{Tick}} || {{Tick}}\n|-\n|}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M61A1 (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* A choice between two presets:\n** 1 x 20 mm M61A1 cannon, chin-mounted (640 rpg)\n** 1 x 20 mm M61A1 cannon + 90 x countermeasures\n\nDue to this cannon's high rate of fire, trigger discipline is a must.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|LDGP Mk 81 (250 lb)|LDGP Mk 82 (500 lb)|M117 cone 45 (750 lb)|LDGP Mk 83 (1,000 lb)|LDGP Mk 84 (2,000 lb)}}\n{{main|AGM-62A Walleye I (505 kg)|GBU-8 (2,000 lb)|GBU-15(V)1/B (2,000 lb)|AGM-12C Bullpup|AGM-65B}}\n{{main|AIM-7E Sparrow|AIM-7E-2 Sparrow|AIM-9E Sidewinder|AIM-9J Sidewinder}}\n{{main|BLU-27/B incendiary|FFAR Mighty Mouse|Zuni Mk32 Mod 0 ATAP|GAU-4 (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance presets:\n\n* Without load\n* 2 x AIM-9E Sidewinder missiles\n* 3 x 20 mm GAU-4 cannons (1,200 rpg = 3,600 total)\n* 24 x 250 lb LDGP Mk 81 bombs (6,000 lb total)\n* 24 x 500 lb LDGP Mk 82 bombs (12,000 lb total)\n* 19 x 750 lb M117 cone 45 bombs (14,250 lb total)\n* 13 x 1,000 lb LDGP Mk 83 bombs (13,000 lb total)\n* 3 x 2,000 lb LDGP Mk 84 bombs (6,000 lb total)\n* 4 x BLU-27/B incendiary bombs\n* 285 x FFAR Mighty Mouse rockets\n* 60 x Zuni Mk32 Mod 0 ATAP rockets\n* 4 x AIM-9E Sidewinder missiles\n* 4 x AIM-9J Sidewinder missiles\n* 4 x AIM-7E Sparrow missiles\n* 4 x AIM-7E-2 Sparrow missiles\n* 2 x AGM-12C Bullpup missiles\n* 6 x AGM-65B missiles\n* 4 x 505 kg AGM-62A Walleye I bombs (2,020 kg total)\n* 4 x 2,000 lb GBU-8 bombs (8,000 lb total)\n* 2 x 2,000 lb GBU-15(V)1/B bombs (4,000 lb total)\n\n==== Custom loadout options ====\n{| class=\"wikitable\" width=\"100%\" style=\"text-align:center\"\n|-\n! !! width=\"4%\" | 1 !! width=\"4%\" | 2 !! width=\"4%\" | 3 !! width=\"4%\" | 4 !! width=\"4%\" | 5 !! width=\"4%\" | 6 !! width=\"4%\" | 7 !! width=\"4%\" | 8 !! width=\"4%\" | 9 !! width=\"4%\" | 10 !! width=\"4%\" | 11\n| rowspan=\"20\" width=\"30%\" | <div class=\"ttx-image\">[[File:Hardpoints_F-4C_Phantom_II.png]]</div>\n|-\n! 20 mm GAU-4 cannons (1200 rpg)\n| 1 || || || || || 1 || || || || || 1\n|-\n! 250 lb LDGP Mk 81 bombs\n| 6 || 3 || || || || 6 || || || || 3 || 6\n|-\n! 500 lb LDGP Mk 82 bombs\n| 6 || 3 || || || || 6 || || || || 3 || 6\n|-\n! 750 lb M117 cone 45 bombs\n| 4 || 3 || || || || 5 || || || || 3 || 4\n|-\n! 1,000 lb LDGP Mk 83 bombs\n| 2 || 3 || || || || 3 || || || || 3 || 2\n|-\n! 505 kg AGM-62A Walleye I bombs\n| 1 || 1* || || || || || || || || 1* || 1\n|-\n! 2,000 lb GBU-8 bombs\n| 1 || 1* || || || || || || || || 1* || 1\n|-\n! 2,000 lb GBU-15(V)1/B bombs\n| || 1* || || || || || || || || 1* ||\n|-\n! 2,000 lb LDGP Mk 84 bombs\n| 1 || || || || || 1 || || || || || 1\n|-\n! BLU-27/B incendiary bombs\n| 1 || || || || || 2 || || || || || 1\n|-\n! FFAR Mighty Mouse rockets\n| 57 || 57 || || || || 57 || || || || 57 || 57\n|-\n! Zuni Mk32 Mod 0 ATAP rockets\n| 12 || 12 || || || || 12 || || || || 12 || 12\n|-\n! AGM-12C Bullpup missiles\n| || 1* || || || || || || || || 1* ||\n|-\n! AGM-65B missiles\n| || 3* || || || || || || || || 3* ||\n|-\n! AIM-7E Sparrow missiles\n| || || || 1 || 1 || || 1 || 1 || || ||\n|-\n! AIM-7E-2 Sparrow missiles\n| || || || 1 || 1 || || 1 || 1 || || ||\n|-\n! AIM-9E Sidewinder missiles\n| || || 1, 2* || || || || || || 1, 2* || ||\n|-\n! AIM-9J Sidewinder missiles\n| || || 2* || || || || || || 2* || ||\n|-\n| colspan=\"12\" | Maximum permissible weight imbalance: 1,500 kg\n|-\n| colspan=\"13\" | * Marked options for hardpoints 2/10 cannot be used in conjunction with air-to-air missiles on hardpoints 3/9 respectively\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe F-4E Phantom II is well-suited for any in-game situation. For attacking ground targets, the plane is armed with an assortment of bombs and rockets, and against air targets, players may employ the vehicle's deadly air-to-air missiles and frontal cannon. If desired, three externally-mounted gunpods may be equipped, but note that these may not be useful in certain situations. Although they will undoubtedly increase the vehicle's destructive capabilities, they also appreciably hinder flight performance through induced drag. In many situations, one front-facing cannon is all that is required to dispatch an opponent aircraft. As for the missiles, the ones used by this plane are average at its rank, comparable to the [[R-60]] missiles equipped by the [[MiG-21MF (Germany)]] and the [[MiG-21SMT]] (albeit with worse maneuverability). The AIM-9J missiles are most effective when fired from between 1 to 3 km away from the target. Any closer and they will struggle to track and likely veer off target for a miss.\n\nThe F-4E has one of the highest rates of climb out of any vehicle in the game. This is however where most of its performance advantages end. Due to its weight, the Phantom has rather mediocre acceleration, and not the best top speed. It is not advised to dogfight anything other than Starfighters and other Phantom variants, as the F-4 has a very poor turn rate. Although the aircraft has better energy retention than most of its opponents, it still bleeds considerable amounts of speed while turning, which can't be regained very quickly due to the aircraft's heavy weight. It also performs quite poorly at low speeds, which is also caused by its weight.\n\nIn air realistic battles, it is recommended to take a balanced fuel load of 20 or 30 minutes, depending on how aggressive you fly (this will also allow you to liberally use the afterburner without fear of premature fuel exhaustion). The most useful default Air RB armament for the F-4E are the 4 AIM-9Js or 4 AIM-7E-2s, though both missiles can be used under a custom loadout setting. As the F-4E's dogfighting abilities are rather lackluster, the Sparrows may prove more useful in the long run compared to the AIM-9J Sidewinders. The best strategy is to accelerate to a speed of roughly 900-1100km/h on the deck and then zoom climb to altitude (5km or higher), where the pilot should accelerate to the highest speed possible. Lock on to targets with your radar and use your Sparrows to shoot down enemy aircraft when in range; and remember to keep an eye on your RWR as being at altitude makes you an easy target for the long range missiles prevalent at this tier. Sparrows should ideally be launched above Mach 1 to take maximum advantage of their range and manoeuvrability. After using up all your Sparrows, return to base to rearm, with the Sidewinders (if brought along) used moreso for self-defense rather as a primary weapon. It is important to note that because of its poor flight characteristics, the Phantom will struggle in one-on-one fights, making it vital to keep your teammates around and to avoid dogfighting whenever possible. The Phantom should target enemies turnfighting its friendlies, as not only the enemy may be distracted and slow, but it provides you a chance to save your teammate, who in turn may down another enemy chasing you later in the match.\n\nTo reiterate, dogfighting should be avoided as much as possible. The Phantom was designed around missiles, so they will naturally be your main way of getting kills, with the gun being a backup weapon for opportune targets. Furthermore, most of the enemies you will face at 11.0 or above can and will be able to easily maneuver around you, if they haven't already fired a high performance AAM at you. Although if one has unlocked the triple SUU-23/A gunpods, that is an almost surefire way to earn at least one kill in the classic head-on (in addition to its usefulness in attacking ground targets, possibly being the best option in Air Realistic).\n\nNote that the F-4E can be quite useful in Ground Realistic Battles with the amount of options for guided weaponry available to the F-4E. To significantly make use of these guided weapons, climb atleast 5000 meters to give you time to properly aim, fire and pull away. Note that you have atleast 43 Chaff and Flares, which should be enough to ward off any SPAA wanting to shoot you out of the sky.\n\n;Notable Air RB enemies include:\n\n* [[MiG-21bis]]: the most advanced Soviet MiG-21, with amazing acceleration that can catch up to the F-4E quite easily and evade missiles with flares. The German [[MiG-21bis-SAU]] has access to all-aspect R-60MK missiles as well. Neither has competitive radar-guided missiles however.\n* [[JA37C|JA37C Viggen]]: a Swedish powerhouse that boasts high low-altitude speed, good turning performance, similar weapons to the F-4E, and a Pulse-Doppler radar.\n* [[Mirage IIIC]]/[[Mirage IIIE|IIIE]]: armed with two of the best infrared missiles in the game, the R.550 Magic, and a long-range radar-guided missile with similar performance to the AIM-7. Strong short-term turning capabilities make them dangerous in snapshots. The former does not have countermeasures, however.\n* [[Phantom FGR.2]]/[[Phantom FG.1|FG.1]]: British Phantoms with more powerful engines, can out accelerate and outrun the F-4E. They also have pulse-Doppler radars and are superior in BVR.\n* [[F-4EJ Kai Phantom II|F-4EJ Kai]]: Japanese Phantom with an excellent pulse-Doppler radar and the same armament as the F-4E.\n* F-4E Phantom II: This very aircraft, as a result you simply play around its weaknesses as described in the section below.\n* [[F-4J Phantom II]]: Later American Phantom variant, sacrifices ATGM/GBU capability for generally improved dogfighting performance/armaments over the F-4E.\n* [[F-14A Early]]: American successor to the F-4 with the ultra-long range and fire-and-forget Phoenix missiles, a superior radar, and overall better dogfighting performance.\n* [[MiG-23M]]/[[MiG-23MF (Germany)|MF]]/[[MiG-23MLD|MLD]]: swing-wing fighters with potent missiles, good avionics, and superior agility to the F-4E on lower sweep settings. Avoid dogfighting and keep an eye out for sneak attacks with the R-23T/24T missiles. The MiG-23M and MiG-23MF have very limited countermeasures, which the F-4E can exploit with its large missile capacity. The MiG-23MLD has excellent speed and climb performance that can match or exceed the F-4E.\n* [[J-7E]]: a light and nimble Chinese fighter with exceptional agility but no radar-guided missiles. Avoid dogfighting whenever possible.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Can carry up to eight missiles, allowing a total of four AIM-9Js and AIM-7E-2 (DF) for fighting either manoeuvring aircraft or at close-medium range head-on engagements respectively.\n* Equipped with flares and chaff for evading enemy missiles\n* Can carry a vast range of deadly ground attack ordinance (including fire-and-forget ATGMs)\n* Deadly frontal armament with high burst mass and high damage \n* Has a ballistic computer for assisting in the aim of cannons, rockets, and bombs\n* Better manoeuvrability than most other Phantoms due to slats\n* Has better CAS loadouts than any other Phantoms in the US tree.\n\n'''Cons:'''\n\n* Susceptible to wing rip, especially when doing negative G manoeuvres or rolls\n* Limited ammunition in the frontally-mounted cannon\n* Large target for aircraft and AA alike\n* Despite having slats, it is still a heavy aircraft which will struggle in dogfights versus lighter fighters\n* Two engines make for a strong heat signature, making it harder to dodge missiles\n* Flight performance suffers immensely when carrying large amounts of ordnance\n* Radar lacks pulse-Doppler or look-down capabilities, meaning it is difficult to lock and engage enemies below the horizon and/or at low altitudes\n* In Air Battles, is often uptiered to top-rank where it can become outclassed in armament and maneuverability\n* Has a high repair cost compared to contemporary aircraft\n* Has low battlefield endurance in ground realistic battles due to the prevalence of SAMs and/or radar guided AAA\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n[[File:F-4E Phantom.jpg|thumb|400x400px|An F-4E of Holloman Air Force base.]]\nThe F-4E was initially designed as an incremental upgrade to the standard F-4C airframe used by the US Air Force. The aircraft carried a new radar in a redesigned radome, and more importantly, an internal M61 cannon mounted in the nose. As well, later-production aircraft featured the Agile Eagle upgrade, which gave the Phantom leading edge slats which improved manoeuvrability at the expense of top speed. The addition of an internal cannon was a highly anticipated upgrade, as it fixed a problem that F-4C squadrons faced when operating over Vietnam.\n\nThe first F-4Es entered service in the 1960s and were dispatched to serve in Vietnam, where they complemented the existing inventories of F-4C and D variant aircraft. The aircraft type was credited with 21 kills in Vietnam, most of which were achieved using the AIM-7E-2 'Dogfight Sparrow'. Several pilots achieved Ace status while flying the F-4 in Vietnam, including Charles B. DeBellevue, who was the highest-scoring American ace in Vietnam. The F-4 went on to form the backbone of the US fighter force for the bulk of the 1960s and 70s. As well, F-4E was flown by the USAF Thunderbirds Demonstration Team between 1969 and 1974. The large, noisy Phantom performed around the world until 1974, when rising fuel costs forced the Thunderbirds to convert to the smaller T-38 Talon.\n\nThe F-4E was exported to a variety of countries. Israel was the largest foreign user of the F-4 Phantom, having purchased 124 F-4 Phantoms from the United States betwen 1971 and 1974; the Israelis were credited with at least 115 kills using the F-4 Phantom during various conflicts. As well, Germany and Japan both procured modified versions of the F-4E, being the F-4F and F-4EJ, respectively. Other notable foreign users of the F-4E include Australia (24 aircraft), Egypt (35 aircraft), Greece (34 aircraft), and Turkey (40 aircraft).\n\nDuring service, the Phantom gained a number of nicknames, including \"Rhino\" (referencing its titanium construction and long nose), \"Double-Ugly\", and even \"The world's largest distributor of MiG Parts\", referencing the 277 MiGs downed by the Phantom during various conflicts. The USAF retired the aircraft in 1996, and the aircraft was used as a target drone until 2016. The aircraft remains in service with Iran, Japan, South Korea, Greece and Turkey, 62 years after its maiden flight.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicleCountry=usa&vehicleType=aircraft&vehicleClass=fighter&vehicle=f-4e Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|TWT-ETcU_No|'''The Shooting Range #198''' - ''Metal Beasts'' section at 00:33 discusses the F-4E Phantom II.}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n\n* [[F-4 Phantom II (Family)]]\n\n;Aircraft of comparable role, configuration and era\n\n* Mikoyan-Gurevich [[MiG-21 (Family)]]\n* SAAB [[J35D]] ''Draken''\n* Dassault [[Mirage IIIC]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''encyclopedia page on the aircraft;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/479889-f-4e/ Official data sheet - more details about the performance]\n\n{{AirManufacturer McDonnell}}\n{{USA jet aircraft}}"}}