{"title":"F-5A (China)","pageid":14580,"wikitext":{"*":"{{About\n| about = jet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = F-5 (Family)\n}}\n{{Specs-Card\n|code=f-5a_china\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese jet fighter {{Battle-rating}}. It was introduced in [[Update \"Ixwa Strike\"]].\n\nDesigned from the N-156 prototype of Northrop Corporation (now Northrop Grumman), F-5A is the first-comer of the long-lasting family of F-5 series lightweight fighter; which is still widely used by various military powers throughout the planet with ROCAF (currently F-5E/F Tiger II) being the largest operator among them. In-game, the F-5A is a highly versatile aircraft courtesy of its many loadouts. In a relatively clean configuration with only a pair of AIM-9P Sidewinders, it serves as a wonderfully agile dogfighter that can hold its own against much larger and heavier opponents. It can also be loaded up with a deceptively large amount and variety of ordnance for ground attacking. Pilots valuing pleasant handling characteristics and lethal weaponry can enjoy the F-5A as worthy capstone for the ROCAF fighter line.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nBeing a lightweight supersonic jet fighter, the F-5A is a really manoeuvrable aircraft: the aerodynamic design and the structure of this fighter can sustain high-G manoeuvres even around 1,000 km/h at around 11 G of overloading without losing much energy. Try to stay above 800 km/h, if you go below that your speed starts dropping rapidly. You don't really have to care about ripping your wings. At lower speeds, the F-5A stand amongst the best jets in terms of manoeuvrability. The angle of attack in a turn stays really low, as it does not have delta wings and is really light. However, the aircraft does not have a high top speed and the acceleration is subpar compared to same-tier jets due to the limitations on the J85 engines.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 10,668 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 1,430 || 1,422 || rowspan=\"2\" | {{Specs|ceiling}} || 27.1 || 28.3 || 112.5 || 99.3 || rowspan=\"2\" | 850\n|-\n! Upgraded\n| 1,461 || 1,444 || 26.9 || 27.0 || 160.0 || 135.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| ✓ || ✓ || ✓ || ✓ || X || ✓     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 926 || 559 || 555 || ~11 || ~4\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 680 || < 750 || < 700 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"5\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | {{Annotation|Basic mass|Mass of the aircraft with pilot and engine oil, but no fuel or weapons load}} || colspan=\"3\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | General Electric J85-GE-13 || 2\n| colspan=\"2\" | 4,051 kg || colspan=\"3\" | 365 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"4\" | Mass with fuel (no weapons load) || rowspan=\"2\" | Max Takeoff<br>Weight\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 11m fuel || 20m fuel || 30m fuel || 37m fuel\n|-\n| 271 kg || colspan=\"2\" | Afterburning axial-flow turbojet\n| 4,580 kg || 4,992 kg || 5,462 kg || 5,814 kg || 9,000 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB/SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"5\" | Thrust to weight ratio @ 0 m (WEP)\n|-\n! Condition || 100% || WEP\n! 11m fuel || 20m fuel || 30m fuel || 37m fuel || MTOW\n|-\n| ''Stationary'' || 960 kgf || 1,426 kgf\n| 0.62 || 0.57 || 0.52 || 0.49 || 0.32\n|-\n| ''Optimal'' || 1,200 kgf<br>(1,400 km/h) || 2,459 kgf<br>(1,400 km/h)\n| 1.07 || 0.99 || 0.90 || 0.85 || 0.55\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\nThere is no armour at all on the F-5A. As such, all of the modules, control surfaces, and the pilot are exposed to any projectiles that connect.\n\nThe F-5A has two self-sealing fuel tank located in the rear fuselage right besides the engine. While this minimizes fuel strikes to a small portion of the plane, the issue comes in that the fuel tanks are overlapping each other closely. A cannon round or two fired in a volley by an enemy can easily strike both fuel tanks at the same time, leading to both tanks leaking fuels, or worse case both tanks catching on fire which would severely hamper the F-5A's survival chances.\n\nThe engines are mounted all the way towards the fuselage rear, contained around the area of the tail. This means the engine are in one of the least likely areas to be hit when attacked by an enemy in a high-deflection attack. This also means that if the enemy aims for the F-5A's rear end via guns or missiles, both the tail control and the engines are liable to be knocked out at the same time, leading to gravity taking over and dooming the aircraft.\n\nThough it is possible to lose a wing and still maintain enough lift to fly back to base, this is a very situational case of the wings tearing off from excessive G-force (also a rare case) and if the enemy shoots it off with their armaments and damaging nothing else. The prevalence of missiles at top-rank jet battles mean this is a very unlikely situation and the F-5A most likely would not survive a direct hit by a cannon round or missile.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nPart of the F-5A's forte in the air is its manoeuvrability, as such there should be an emphasis towards unlocking the modifications in the ''Flight Performance'' and ''Survivability'' category to boost engine power, flight speed, and turning rate.\n\n''Weaponry'' can be prioritized depending on the intent of use of the F-5A. IF one requires a more reliable and flexible cannon armament, the ''Offensive 20 mm'' and ''New 20 mm cannons'' should be considered, though the default belt is already sufficient for knocking out both enemy aircraft and ground AI target in Air Realistic battles. If trying to take down enemy aircraft more reliably, the ''AIM-9P'' module should be prioritized, though this requires unlocking the ''LAU-3/A'' and ''AGM-12B Bullpup'' modules to get to. If trying to attack ground targets in Ground Realistic battles, the ''AGM-12B'' is also a good place to go while unlocking the ''AIM-9P'' as it will unlock four Bullpup missiles ready to be mounted on the F-5A.\n\nThe research priority of the bombs is up to the user's preference and ability to skillfully put bombs onto target, as the F-5A does not comes with a ballistic computer to help guide where the bombs will drop. User's intuition and skill are relied upon for an accurate drop, which can be harder to do in Ground Realistic battles due to the likely contested airspace the F-5A would find themselves in when the enemy team begin deploying SPAAs.\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* A choice between two presets:\n** 2 x 20 mm M39A2 cannons, nose-mounted (280 rpg = 560 total)\n** 2 x 20 mm M39A2 cannons + 60 x countermeasures\n\nThe F-5 can make short work of enemy jet fighters thanks to its fairly accurate cannons, the generous amount of rounds and the directional controllability of the aircraft. The two nose-mounted autocannons  are not as fast-firing as many of the top-rank vehicles like the [[M61 (20 mm)|M61 Vulcan]] on Phantoms or the [[GSh-23L_(23_mm)|GSh-23L]] on MiG-21s. However, the M39A2 cannon shells are of similar nature to the M61, so the same effect on enemy targets can be expected if the shots land onto target. One benefit of the lower rate of fire is the longer time of firing available to a F-5A pilot. So if the pilot aims carefully, the F-5A can deliver devastating effects with their 20 mm M39A2 for a longer period of time.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|LDGP Mk 81 (250 lb)|LDGP Mk 82 (500 lb)|M117 cone 45 (750 lb)|LDGP Mk 83 (1,000 lb)|LDGP Mk 84 (2,000 lb)}}\n{{main|AGM-12B Bullpup|AIM-9P Sidewinder|FFAR Mighty Mouse|BLU-1 incendiary}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x AIM-9P Sidewinder missiles\n* 18 x 250 lb LDGP Mk 81 bombs (4,500 lb total)\n* 5 x 500 lb LDGP Mk 82 bombs (2,500 lb total)\n* 5 x 750 lb M117 cone 45 bombs (3,750 lb total)\n* 3 x 1,000 lb LDGP Mk 83 bombs (3,000 lb total)\n* 1 x 2,000 lb LDGP Mk 84 bomb (2,000 lb total)\n* 76 x FFAR Mighty Mouse rockets\n* 4 x AGM-12B Bullpup missiles\n* 2 x AIM-9P Sidewinder missiles + 18 x 250 lb LDGP Mk 81 bombs (4,500 lb total)\n* 2 x AIM-9P Sidewinder missiles + 5 x 500 lb LDGP Mk 82 bombs (2,500 lb total)\n* 2 x AIM-9P Sidewinder missiles + 5 x 750 lb M117 cone 45 bombs (3,750 lb total)\n* 2 x AIM-9P Sidewinder missiles + 3 x 1,000 lb LDGP Mk 83 bombs (3,000 lb total)\n* 2 x AIM-9P Sidewinder missiles + 1 x 2,000 lb LDGP Mk 84 bomb (2,000 lb total)\n* 2 x AIM-9P Sidewinder missiles + 76 x FFAR Mighty Mouse rockets\n* 2 x AIM-9P Sidewinder missiles + 2 x AGM-12B Bullpup missiles\n* 2 x AIM-9P Sidewinder missiles + 76 x FFAR Mighty Mouse rockets + 6 x 250 lb LDGP Mk 81 bombs (1,500 lb total)\n* 2 x AIM-9P Sidewinder missiles + 2 x AGM-12B Bullpup missiles + 3 x 500 lb LDGP Mk 82 bombs (1,500 lb total)\n* 2 x AIM-9P Sidewinder missiles + 2 x AGM-12B Bullpup missiles + 3 x 750 lb M117 cone 45 bombs (2,250 lb total)\n* 2 x AIM-9P Sidewinder missiles + 76 x FFAR Mighty Mouse rockets + 1 x 1,000 lb LDGP Mk 83 bomb (1,000 lb total)\n* 2 x AIM-9P Sidewinder missiles + 76 x FFAR Mighty Mouse rockets + 1 x 750 lb M117 cone 45 bomb (750 lb total)\n* 2 x AIM-9P Sidewinder missiles + 38 x FFAR Mighty Mouse rockets + 3 x 750 lb M117 cone 45 bombs (2,250 lb total)\n* 2 x AIM-9P Sidewinder missiles + 2 x AGM-12B Bullpup missiles + 38 x FFAR Mighty Mouse rockets + 1 x 750 lb M117 cone 45 bomb (750 lb total)\n* 2 x AIM-9P Sidewinder missiles + 2 x AGM-12B Bullpup missiles + 38 x FFAR Mighty Mouse rockets + 1 x 500 lb LDGP Mk 82 bomb (500 lb total)\n* 2 x AIM-9P Sidewinder missiles + 2 x AGM-12B Bullpup missiles + 38 x FFAR Mighty Mouse rockets + 1 x 1,000 lb LDGP Mk 83 bomb (1,000 lb total)\n* 5 x BLU-1 incendiary bombs\n* 5 x BLU-1 incendiary bombs + 2 x AIM-9P Sidewinder missiles\n* 3 x BLU-1 incendiary bombs + 2 x AIM-9P Sidewinder missiles + 2 x AGM-12B Bullpup missiles\n\nThe F-5A has a bewildering array of loadouts, but the vast majority are dedicated to ground attack. Once AIM-9P missiles are unlocked, your attack capability is vastly increased and F-5A becomes an effective dogfighter provided it is not carrying too much ordnance.\n\nFor a pure air-to-air role, the 2x AIM-9P loadout is the best, as the F-5A cannot carry more than two air-to-air missiles and everything else causes unnecessary weight and drag during combat. Most of the other loadouts still include the twin AIM-9Ps as a supplement to combinations of rockets, AGMs, and bombs. For mixed battles, these multirole loadouts are generally best option as they allow the F-5A to cause plenty of havoc to ground targets while still having air-to-air missiles for countering enemy aircraft. The one loadout lacking missiles that may be worth considering consists of 4x AGM-12B Bullpup AGMs and nothing else; Bullpups are very lethal against player controlled tanks but the multirole loadouts are limited to only having two of them.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nF-5A was designed to be a lightweight fighter at the first place, so one thing players may find is the better manoeuvrability over most jets at the same tier, also another traits of this aircraft is its directional controllability (that is, the nose points to whether your mouse pointed at without much corrections); but you will also suffer from a major drawback of it- the subpar thrust of the pair of J85 on the it, which provides lower-than-average acceleration to fighters of the same tier, unless necessary or 1-on-1 battles, DO NOT have the airspeed lower than 800kph which the speed drops even significantly.\n\nOne way to cope with the lack of acceleration is to use the directional controllability to bait enemies during head-on, being one of the smallest size jet at 11.0, players can dodge devastating cannons with relatively ease and use that manoeuvrability to turn back on the enemy; or trick their shots then immediately point the nose back onto the enemy during head-on albeit risky.  Another safer option is pick those fighters with lower energy and make quick and short work of them with those pair of M39A2 cannons; until players unlock AIM-9P with exceptional accuracy and long range; with missiles, try to keep the target at around 2km where the missiles can track with more accuracy but keep in mind that you only have 2 chances as F-5A has no underwing pylon for AAMs. Do remember to check six for any surprise attacks from the enemies, RWR and countermeasures certainly improved its survivability at top tier.\n\nFor Ground (RB):\n\nOne thing that makes F-5A different from most ROCAF and PLAAF aircraft is the surprising amount of variety of CAS configs ranging from 250-2000 lbs LDGP bombs, FFARs or 4 AGM-12B AGMs that proves lethal to ground vehicles. But lacks of ballistic computers (not even a gyroscope gunsight) makes it struggles on pin-point bombings against your targets, so experience on jet ground-attacks is very essential for this aircraft; alternatively, if you prefer AGMs, these 4 AGM-12B can make really short work to any ground targets; in case of the existence of enemy jets, you can also bring 2 AIM-9P at the cost of some payload.\n\nThe key to ground attack in a F-5A is keep on track of SPAAGs or other multirole fighter jets as they can be lethal to players, having RWR and countermeasures are good; but most of all, avoid being detected then strike the targets at the first place is the key to success. \n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Many payload options\n* AIM-9P missiles are quite effective\n* Highly manoeuvrable\n* Amazing energy retention, even in high-G manoeuvres\n* Hard to rip the wings\n* Can be used in many roles, such as fighter, attacker and base bomber\n* Competitive speed at sea level, on par with MiG-21s\n* Reasonable ammo pool for the cannons\n\n'''Cons:'''\n\n* No radar or rangefinder\n* No extra protection on the aircraft\n* Low top speed, acceleration, and climb rate compared to its counterparts\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nAs a supersonic fighter born in late 1950s, Northrop F-5 series fighters were a popular choice for many countries, as well as being a famous star in USAF's Exercise Red Flag, where it performed well even against 3rd generation fighters such as F-14 Tomcat. Although the US Air Force only used a limited number of F-5C \"Skoshi Tiger\" in the Vietnam War, both F-5A \"Freedom Fighter\" and F-5E \"Tiger\" were involved in many wars and conflicts around the world, such as the Iran-Iraq war in the 1980s, in which one of the Iranian F-5E fighter jets shot down a MiG-25 flown by an Iraqi ace pilot with the M39 autocannons!\n\n=== \"Freedom Fighters\" and \"Tigers\" in Taiwan ===\nIn an effort to replace the outdated F-86F Sabre fighter jets, the ROCAF placed an order of 60 F-5A and B fighters to the United States, the first tranche of a total requirement for 115 aircraft.\n[[File:F-5A in a military prade.jpg|thumb|382x382px|F-5A \"Freedom Fighter\" in a military parade.]]\nThe 115 aircraft were aided through the Foreign Military Sales (FMS) and the Military Aid Program (MAP), while some sources claim that the total amount of F-5A was 72 with an additional batch of 11 F-5Bs.\n\nThe first batch of Freedom Fighters was delivered in 1964, which equipped three squadrons of 1st Tactical Fighter Wing. Subsequently, a total of four squadrons were equipped with the F-5A/B fighters and the military aid program was codenamed \"Yu Shan\" (\"玉山\", One of the main mountain ranges in Taiwan). Followed by the requirement for updating weaponry and equipment for the Republic of Vietnam Air Force, 48 of the ROCAF's Freedom Fighters were to be leased to the Vietnamese ally and then be sent to Southeast Asia as quickly as possible. During this period, air defense missions over the Taiwan Strait were mainly carried out by the U.S. Air Force. The US Air Force drew two F-4C fighter squadrons from Kadena Air Force Base, and a total of 48 Phantom II fighters were stationed at Ching-Chuan-Kang Air Force Base in Taichung. In return for ROC's aiding military equipment to the Republic of Vietnam, the ROCAF received 28 F-5E Tiger from Northrop in 1975, and it is believed that part of the F-5A transferred to South Vietnam was later returned to the ROCAF, even including an F-5C used by USAF in Vietnam for evaluation, at which time the F-4 Phantom II fighter squadrons and the supporting T-38 trainers returned to Kadena Air Force Base.\n\n=== The Domestic \"Tiger\" jets: Peace Tiger Program ===\nOn February 9, 1973, the ROC authorities and the US government reached an agreement for the co-production of 100 F-5E \"Tiger\" fighter jets. This program was given the codename \"Hu An\" (\"虎安\", Peace Tiger) and was to be undertaken jointly by Northrop and Aerospace Industrial Development Corporation of Taiwan (AIDC) (then a research institute of the ROCAF).\n\nThe first AIDC-built F-5E was rolled out on October 30, 1974, one day before the late President Chiang Kai Shek's 88th birthday, and was thus christened \"Chung Chen\", an alias of President Chiang. Production of all 100 aircraft was completed by November 1977.\n\nLater 208 more aircraft were added to the production run in five batches, lasted from \"Peace Tiger No. 2\" through \"Peace Tiger No. 6\". Complexity of the production work by AIDC also evolved in several phases. The whole \"Peace Tiger\" program was completed on December 9, 1986, when the final aircraft was rolled of the production line.\n\nThe Peace Tiger No. 6 stands out among these programs, for it was the only batch approved after the US authorities led by President Carter established diplomatic relations with Communist China in 1979. The succeeding Reagan administration denied Taiwan's request to purchase the more advanced F-16 and F-20 in early 1982, for fear of angering mainland China.\n[[File:F-5E firing AGM-65.jpg|left|thumb|338x338px|ROCAF F-5E firing AGM-65 air-to-surface missile.]]\nMore than denying following military aids, the US government signed the 817 Communique with China on August 17, 1982, pledging to gradually reduce military sales and aid to Taiwan. However, in an effort to assure the security of the Taiwan Strait and curb the offensive attempts of mainland China, the Reagan administration submitted the proposed sale of 60 F-5E/F to Republic of China to Congress after two days. As a result, the US $240-million sale was made of the license production of 30 F-5E and 30 F-5F and was later named as Peace Tiger 6.\n\nAt its peak in 1990, the ROC Air Force had a total of 5 Tactical Fighter Wings (The 401 Wing in Taoyuan, the 455 Wing in Chiayi, the 443 Wing in Tainan, the 828 Wing in Hualien, and the 737 Wing in Taitung), a total of 15 squadrons were equipped with F-5E/F fighters. A portions of F-5E/F (such as some aircraft of 443 Wing stationed in Tainan) were able to use AGM-65 \"Mavericks\" air-to-surface missiles, 500 and 2000 lbs \"Paving Stone\" laser-guided bombs in the later stages of their service.\n\n''The US-Sino August 17th Joint Communiqué, also known as \"中美就解決美國向台出售武器問題的公告\" (China-US Announcement on Solving the Issue of US Arms Sales to Taiwan), aimed to cease the arms sales and any form of military aid that the US provides to Republic of China.''\n\n=== End of the era of \"Freedom Fighter\" ===\nAfter nearly 30 years of active service, the F-5A fighter was officially decommissioned from the Republic of China Air Force on June 30, 1987, while the F-5B fighter was decommissioned on June 30, 1996. In fact, before the last F-5A/B was ever decommissioned from service, most of these fighters had been converted into unmanned drones or disassembled to provide spare parts for the successor fighter jets.\n\n=== [[wt:en/news/7060-development-f-5a-freedom-fighter-bring-em-hell-en|Devblog]] ===\nIn the mid-50's, a group of specialists from the Northrop Corporation began developing a light multi-role short-range support fighter  on their own initiative that could take off and land on short runways. The idea did not receive much appreciation from the military authorities, as the main stake was then placed on high-tech expensive fighters, for which the length of the runway did not play a decisive role. However, within Northrop Corporation, the project continued to develop. While research, construction and testing of prototypes were going on, the strengthening of the NATO and SEATO alliances required the United States to supply a cheap multi-role fighter to allies.\n\nThis is where the work of the Northrop engineers came in handy. With minor modifications, the experimental aircraft went into production under the designation F-5A. Very easy to assemble and maintain, without modern navigation and guidance systems, the aircraft was able to carry a huge arsenal of suspended weaponry and effectively carry out missions to destroy various types of ground targets, as well as successfully participate in air battles, often against more expensive and advanced enemy aircraft.\n\nThe F-5A Freedom Fighter was first put in service by the Norwegian Air Force in 1964, later she was supplied to a large number of US allies and was actively used in many conflicts around the world, including Vietnam, the Iran-Iraq conflict and the War of Ogaden.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=f-5a_china Skins and camouflages for the F-5A from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed\" heights=\"150\">\nFile:F-5A WTWallpaper 01.jpg|\nFile:F-5A WTWallpaper 02.jpg|\nFile:F-5A WTWallpaper 03.jpg|\nFile:F-5A WTWallpaper 04.jpg|\nFile:F-5A WTWallpaper 05.jpg|\nFile:F-5A WTWallpaper 06.jpg|\n</gallery>\n\n;Videos\n{{Youtube-gallery|pFRi6Bg08Ts|'''It's Finally Here! - F-5A Freedom Fighter''' - ''DEFYN''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/7060-development-f-5a-freedom-fighter-bring-em-hell-en|[Devblog] F-5A Freedom Fighter: Bring 'em Hell!]]\n* [https://forum.warthunder.com/index.php?/topic/519024-f-5a/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Northrop}}\n{{China jet aircraft}}"}}