{"title":"F-86F-40 (China)","pageid":10580,"wikitext":{"*":"{{About\n|about= jet fighter '''{{PAGENAME}}'''\n|usage= other variants\n|link= F-86 (Family)\n}}\n{{Specs-Card\n|code=f-86f-40_china\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese jet fighter {{Battle-rating}}. It was introduced in [[Update \"Starfighters\"]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\nWhile the F-86F-40's acceleration and top speed are lacking compared to its contemporaries, the F-86F-40's slats allow the plane to have an outstanding manoeuvrability. That said, one must be aware of their speed as pulling high manoeuvres at high and max speed can put the plane under great stress which leads to the wings falling apart. The outstanding manoeuvrability comes at the cost of speed. Pulling hard turns will bleed your air speed.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 0 m - sea level)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 1,095 || 1,088 || rowspan=\"2\" | {{Specs|ceiling}} || 24.4 || 24.9 || 38.8 || 36.3 || rowspan=\"2\" | 750\n|-\n! Upgraded\n| 1,115 || 1,106 || 22.1 || 23.0 || 55.8 || 46.5\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| ✓ || ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 1,170 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || 590 || 550 || 350 || ~11 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 850 || < 600 || < 650 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"4\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | Empty mass || colspan=\"2\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | General Electric J47-GE-27 || 1\n| colspan=\"2\" | 5,490 kg || colspan=\"2\" | 232 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"3\" | Mass with fuel (no weapons load) || rowspan=\"2\" | Max Takeoff<br />Weight\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 7m fuel || 20m fuel || 26m fuel\n|-\n| 1,150 kg || colspan=\"2\" | Axial-flow turbojet\n| 5,848 kg || 6,490 kg || 6,786 kg || 9,530 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB / SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"4\" | Thrust to weight ratio @ 0 m (100%)\n|-\n! Condition || 100% || WEP\n! 7m fuel || 20m fuel || 26m fuel || MTOW\n|-\n| ''Stationary'' || 2,626 kgf || N/A\n| 0.45 || 0.41 || 0.39 || 0.28\n|-\n| ''Optimal'' || 2,626 kgf<br />(0 km/h) || N/A\n| 0.45 || 0.41 || 0.39 || 0.28\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 6.35 mm - Fore-cockpit steel plates\n* 38 mm - Bulletproof windscreen\n* 12.7 mm - Steel plate behind pilot's seat\n* 20 mm - Steel plate in pilot's headrest\n\nThe plane is equipped at the front with 2 steel plates, each 6.35 mm thick. The cockpit has a 38 mm bullet proof glass that protects the pilot's torso and head. The backseat is made of 12.7 mm of steel which protects the pilot's back while his head is further protected by another 20 mm steel plate. This protection will help against smaller calibre rounds, however, cannot sustain many direct hits with 20 mm rounds or higher.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M3 Browning (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 6 x 12.7 mm M3 Browning machine guns, nose-mounted (300 rpg = 1,800 total)\n\nThe F-86F-40 (China) offered the same offensive armament of many of its Sabre brethren, namely the 6 x M3 Browning 12.7 mm/.50 calibre machine guns. These machine guns are similar in performance to their predecessor, the M2 Browning; however, they excelled with a significantly higher rate of fire. The total ammunition count for this aircraft is 1,800 rounds, divided up with 300 rounds per gun. Ammunition belts for this aircraft are conventional 12.7 mm belts found on US aircraft, and typically the tracer belts permit for the quickest correction of aim. Other belts may be utilised as necessary and depending on playstyle such as the Stealth belts; however, these should be used by skilled pilots who already understand the firing aspects of the M3 Brownings and bullet performance. One challenge with the Stealth belts is the lack of tracers, making it much harder to correct aim when solely relying on visual clues.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|AN-M65A1 Fin M129 (1,000 lb)|AIM-9B Sidewinder|HVAR}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 16 x HVAR rockets\n* 2 x 1,000 lb AN-M65A1 Fin M129 bombs (2,000 lb total)\n* 2 x AIM-9B Sidewinder missiles\n\nThe unguided rockets out-fitted on this aircraft are the familiar American HVARs, which can be used against slow-moving bombers or ground target vehicles and anti-aircraft guns. Since the HVARs are a fire-and-forget rocket, they work best against either stationary targets or against slow-moving targets which may not be able to avoid inbound rockets. Another option for suspended ordnances includes bombs, namely the 1,000 lbs AN-M65A1 bombs. Two of these bombs is all that this aircraft can safely carry, but these bombs will do considerable damage against ground units, ships and bases. While performing bombing runs, always be on the lookout for enemy fighters attempting to swoop in and eliminate the F-86F-40 which may be flying slower and lower than typical. For air-to-air combat, using the Aim-9B missiles to complement the M3 Browning machine guns makes for a deadly combination. These missiles are best used in close quarters, anywhere from 600 - 800 m which minimizes the opportunity for the enemy pilot to evade or out-fly the missiles. It is quite possible for the enemy to avoid the in-bound missile; however, this provides the attacking aircraft with the opportunity to manoeuvre in and take out the fighter with its machine guns. Hopefully, the enemy fighter has bled any energy advantage it may have had presenting itself as an ideal target for the machine guns.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nTry to climb up before engaging the enemy to ensure you have enough energy to get out of a sticky situation. Hopefully, there will be a jets fighting underneath you where you would be able to pounce on low-energy fighters with your guns or the AIM-9B. One advantage the F-86 has over the jets of other nations is the large ammo count of its 6 x .50 cals (1,800) although it would be wise to hit most of your shoots. Try staying above 500 km/h as any slower and you would lose a significant amount of energy in a prolonged turn.\n\n=== Air Realistic Battles ===\nIn air realistic battles, the F-86F-40 (China) is not the fastest jet at its BR when it comes to top speed. The thrust output is below average and without an afterburner, and the jet does not accelerate fast either. It is best to take off and do a slight side climb while paying attention to aircraft like Harriers that could try to fly over the team. It is important to maintain at least 600 km/h IAS because any slower the Sabre will struggle to dodge enemy missiles. Once a furball is started, proceed into it and pick targets that are low on energy. The F-86F-40 should take advantage of its wings and good energy retention. Combined with a good roll rate, no enemy should be able to shake you once you are on their tail. Watch for attempts by enemies to force you to overshoot. In late game air realistic battles, there will be more freedom to how slow a fight can get. If you know where the enemy is, you can afford to stall climb and get a missile off to a climbing enemy F-104A.\n\n=== Ground Realistic Battles - CAS ===\nIn mixed ground battles, the F-86F-40 (China) is a good all-round aircraft. In ground attack, the HVAR rockets are a good option against lightly armoured SPAAGs or light tanks. The 1,000 lb bombs are good but both drop at the same time only giving chance for one attack round per landing. In an air superiority role, the Sabre is a good helicopter hunter with 1,800 rounds of .50 cal, which is enough to take care of any amount of enemy UHT or Apache helicopters. Enemy fighters should be engaged with care: keep away from the battlefield before climbing to avoid enemy SAMs. It is however the better air-to-air fighter compared to other options for China at this BR, as the Q-5 early has better climb and top speed but no missiles.\n\n=== Air Simulator Battles ===\nIn air simulator battles, the F-86F-40 (China) is an excellent turn fighter. While the wings with slats do give a lot of angle of attack before stalling, they're also great for turn fights. This Sabre will be able to outturn most jets it can face, at anywhere between 400 and 800 km/h IAS. It is recommended to stay above 600 km/h IAS because any slower the Sabre will struggle to dodge enemy missiles. The AIM-9B should be able to deal with any running/climbing enemy. However, enemies with RWR will get notified if the rangefinding radar is turned on and may drop flares. It is best to keep the radar off when launching a missile attack against aircraft like the German Starfighter or the Mirage III. In battle, stay low and fast and by the time you are up close to your enemy they would not be able to outrun the missiles or outturn the Sabre.\n\n=== Ground Simulator Battles CAS ===\nIn ground simulator battles, F-86F-40 can be a multirole fighter depending on the task to complete. In ground attack, the HVAR rockets will struggle with most targets at the top simulator bracket, but do offer better accuracy per 100 m when compared to the Bombs. The 1,000 lb bombs are very reliable against all levels of protection but take a higher approach for a accurate drop (lack of bomb sight). In an air superiority role, the Sabre will preform even better than it did in air simulator battles. The 6 x .50 cal MGs will make quick work of any enemy helicopter, even if they try to manoeuvre, the Sabre's roll rate should allow for last second adjustments. Turnfighting enemy fighter also got easier as the chances of them carrying bombs/rockets are up, thus limiting their performance. Tree-top level flying should be practiced to avoid SAMs. -->\n\n=== Radars ===\n<!--{{main|AN/APG-30}}-->\nThe F-86F-40 is equipped with an AN/APG-30 rangefinding radar, located in the nose of the aircraft.\nIt will automatically detect other planes within the scanning area and display the range to the closest target. It is linked with a gyro gunsight and can help with aiming at close range. Note that this Radar will trigger RWR of enemy helicopters and jets and may lead to them using flares which will defeat the AIM-9B.\n\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"4\" | AN/APG-30 - Rangefinding radar\n|-\n! {{Annotation|Maximum<br/>Tracking<br/>Range|The maximum range at which a target can be tracked}}\n! {{Annotation|Minimum<br/>Tracking<br/>Range|The range below which targets cannot be tracked by the radar}}\n! {{Annotation|Azimuth Tracking<br/>Angle|How far to each side the radar can track a target}}\n! {{Annotation|Elevation Tracking<br/>Angle|How far up and down the radar can track a target}}\n|-\n| 2,750 m || 300 m || ±9° || ±9°\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Outstanding manoeuvrability\n* Can wield air-to-air missiles\n* Good guns: the 12.7 mm MGs have lots of ammo, straight bullet trajectory, and adequate velocity\n* Air-to-ground armament, such as bombs and missiles\n* Excellent roll rate\n* Great dive acceleration makes it a nice diver\n* Good energy retention in a climb\n* Stable shooting platform during high speeds\n* Air brakes and flaps allow for tight manoeuvres and enemy overshoots at the cost of reduced speed\n\n'''Cons:'''\n\n* Mediocre acceleration\n* Mediocre top speed\n* Weak one-second burst mass of the armament\n* High speed manoeuvres can lead to wings breaking apart\n* Slower turn rate than many contemporaries\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nIn the 1950s, after the Korean War was over, the US government decided to send more modern military equipment to Taiwan to counter the increasing threat of the mainland Chinese Army, especially the PLAAF's MiG-15 Fagot fighter which was supplied by Soviet Union and saw action during the Korean War.\n\nAt this time, the straight-wing design version of the F-84 Thunderjet fighters of the ROCAF could no longer effectively counter the MiG-15 fighter with the swept-wing design. As for the solution, the US government had officially decided to supply more than 500 F-86 Sabre fighters to Taiwan in early 1950s (some sources claim that this number is just an estimate, not the actual number of Sabre fighter fleet because many of them were delivered in the mid to late 1950s, and some sources also confirm that Taiwan received 415 F-86F fighters, 18 F-86D interceptors and 7 RF-86F reconnaissance aircraft in total). This Military Assistance Program (MAP) was named 4F343, and started in 1954, about 320 F-86F Sabre fighters and 7 RF-86 Sabre reconnaissance aircraft were delivered to ROCAF. Apart from that, ROCAF also received about 18 F-86D-36 Sabre Dog interceptors from US Air Force in 1960 too.\n\n=== Sabre in the ROCAF ===\nThe first Sabre fighter delivered to the ROCAF was an F-86F-1, series number 51-2893. By June 1956, 171 F-86s had been delivered, including 38 F-86F-1s, 9 F-86F-5s, and 23 F-86F-10s. The 26th Fighter Squadron from the 5th Fighter Wing stationed at Taoyuan Air Base was the first combat unit to receive the new Sabres in late 1954.\n[[File:Twin ROCAF F-86F with AIM-9B underwing.png|thumb|360x360px|Twin F-86F Sabre fighters of 5th Fighter Wing of ROCAF armed with two AIM-9B Sidewinder air-to-air missiles underwing.]]\nThe ROCAF also received some F-86F-30s, but it is unknown whether they received actual F-40 variants because at that time, North American Aviation company not only produced the F-86F-40 , but also produced modification kits for countries that received the F-30 variants to help them upgrade their Sabres to the newest version. One F-86F-30 that was captured by the PLAAF in the 1950s is displayed in the Beijing Aviation Museum, and has leading-edge slats which was re-added to the Canadian CL-13 Mk.6 and American F-86F-40s, which gives solid evidence to the theory that the ROCAF had upgraded some F-30s to the newest F-40 version.\n\nIn the 1950s, the PLAAF often sent aircraft to the Taiwan Strait for provocations in order to intimidate Taiwan. The ROCAF showed no fear, sending fighters to intercept the intruding PLAAF aircraft. The ROCAF also sent aircraft to the mainland for reconnaissance missions as a form of counterattack. The PLAAF scrambled their new MiG-17s, MiG-17Fs, and J-5s against the ROCAF's Sabres, with the latter usually reigning victorious in air combat.\n\nOn paper, the F-86F Sabre's maximum level flight speed was less than MiG-17 and MiG-17F \"Fresco\", with the latter's climb rate at sea level also being slightly higher than F-86F. However, the early versions of F-86F's maximum climb rate was almost the same or even higher than MiG-15bis and MiG-17s. The Sabres could also out-turn MiG-15s and MiG-17s in both instantaneous and sustained turn fights. Apart from that, the F-86Fs had an A-4 gun/rocket/bomb calculating gunsight which worked with the AN/APG-30 ranging-radar, which were more advanced than the avionics equipped on the PLAAF's MiGs. (Note that the J-5 didn't have the ranging radar mounted on the later version of MiG-17F).\n\nFrom a training point of view, the PLAAF's pilots usually lacked the necessary combat experience compared to the ROCAF pilots at the time, with this being a glaring issue during the Matsu air battle on July 21, 1956. ROCAF pilots even shot down several PLAAF MiG fighters with older F-84s which were loaded with HVAR rockets and had a numbers disadvantage.\n\n=== AIM-9B \"Black Magic\" ===\n[[File:F-86F with AIM-9B underwing.png|left|thumb|396x396px|The F-86F \"357\" 52-4673, with AIM-9B underwing.]]\nOn August 18th, 1958, under the secret project \"Black Magic\" (codenamed \"明星計劃\" in Chinese, Operation Bright Star), a C-124 transport plane landed in Taiwan with some American technical officers and the new GAR-8 Sidewinder infrared-guided air-to-air missile, which is better known as AIM-9B. To teach the ROCAF pilots how to operate the new Sidewinder missiles, the US pilots flew F-100 Super Sabres to simulate PLAAF MiGs, while the ROCAF pilots flew F-86s to conduct simulated attacks on the F-100s with their Sidewinder missiles. During this, the technical officers collected data of the Sidewinder missiles in combat to find flaws and areas where they could be improved.\n\nOn July 29th, 1958, a PLAAF MiG-17 shot down a ROCAF F-84G and heavily damaged another (the pilot successfully bailed out in Magong). A few weeks later, ROCAF F-86s shot down four MiG-17s. At that time, the ROCAF had received 40 Sidewinders and 40 launchers in total, and on September 10th, 1958, two batches of ROCAF pilots returned to their squadron after completing training on the use of the Sidewinder missile.\n\n=== Sidewinder over the Taiwan Strait, battle debut ===\nOn September 24th, 1958, the ROCAF sent nine RF-84F Thunderflash reconnaissance aircraft to the mainland for a surveillance mission. The commander saw it as an opportunity to test the combat effectiveness of the new GAR-8 Sidewinder missiles, so the 11th Fighter Group was ordered to undertake an escort mission for the RF-84s. The initial plan was that the Sabres would be divided into four squadrons, the first squadron had four Sabres equipped with Sidewinders while two more squadrons without missiles were to assist the missile-equipped squadron if they were to have trouble with PLAAF MiGs in a close-range battle.\n\nThe fourth squadron was ordered to stay to stay at 45,000 feet to act as a decoy, using the condensation trail of the J47 engine at high altitude to attract the attention of the PLAAF MiGs, so that the other squadrons could attack them while they were climbing.\n\nAt 10:30 am, the attack group led by Lieutenant Colonel Li Shuyuan arrived in the sky over Wenzhou. One minute later, a message came from Shimen Battle Control Center said that PLAAF MiG fighters were taking off from Luqiao Airport to intercept those ROCAF reconnaissance aircraft. As the original plan expected, the MiGs' attention was drawn to the Sabres at high altitude. Unfortunately, the first squadron couldn't identify whether the condensation trail was friendly or foe, so Lieutenant Colonel Li Shuyuan ordered the Sabres of the fourth decoy squadron to bank right, which allowed him to identify them.\n[[File:Gun camera of shooting down MiG.png|thumb|352x352px|Gun camera image of shooting down PLAAF MiG. The image shows the tail cloud of the MiG and a flying AIM-9B missile.]]\nAt the beginning of the battle, Li Shuyuan and Qian Yiqiang each fired one Sidewinder and shot down one MiG-17. One of MiG-17s managed to evade a Sidewinder fired by Qian Yiqiang, but was hit by another missile fired by another Sabre. The last MiG-17 was shot down by another missile fired by the fourth F-86F Sabre fighter of the first squadron. After suffering severe losses, the remaining MiG-17s decided to withdraw from the battle.\n\nLater, four Sabres from the commander squadron ambushed a MiG-17 formation which had just taken off from the airfield and successfully shot down one. After that, the fourth squadron scored two more kills and another squadron led by Ma Dapeng successfully shot down another two.\n\nThe ROCAF's F-86s had successfully shot down a total nine PLAAF MiG-17s, four of which were Sidewinder kills and the remaining five by gun.\n[[File:Sabre ace pilot Lee.jpg|left|thumb|247x247px|Lieutenant Colonel Li Shuyuan, the first man in history to shoot down aircraft with homing missiles in air combat.]]\nFrom the point of view of the PLAAF: At 8:47 am, twelve J-5/MiG-17s from the 46th Regiment of the 16th Division took off to intercept eight Sabres. At 9:06 am, eight MiG-15bis from the 5th Regiment and eight MiG-17Fs from the 6th Regiment of the 2nd Division spotted four Sabres flying at 13,000 m at 9:30 am. The enemy then tried to turn to avoid the engagement (which was the same as the description of ROCAF's combat report, but one hour earlier). The commander of the 2nd division ordered the formation of 5th Regiment to pull back in order to attract the enemy aircraft to the mainland, but when they tried to bank right at Wenzhou Bay, the fourth plane suddenly lost control and began to dive steeply. Others saw this and told the pilot to bail out, but no response was received. In general, PLAAF claimed that they only lost one fighter due to a Sidewinder.\n\nThe F-86F Sabre remained in ROCAF service until 1977, and was retired when its flight performance and endurance was considered outdated and unsuitable for active service. It was replaced by the more advanced F-100A Super Sabre and F-5A Freedom Fighter.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=f-86f-40_china Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n* Canadair [[F-86 (Family)|Sabre]] (those Sabres manufactured with the designator \"CL\")\n* North American [[F-86K (France)|F-86D]] Sabre\n* North American [[F-100D|F-100]] Super Sabre\n* North American [[FJ-4B|FJ-4]] Fury\n\n;Aircraft of comparable role, configuration and era\n* Grumman [[F9F-8|F9F]] Cougar\n* Lavochkin [[La-15]]\n* Mikoyan-Gurevich [[MiG-15]]\n* Mikoyan-Gurevich [[MiG-17]]\n* Hawker [[Hunter F.1|Hunter]]\n* Dassault [[Super Mystere B2|Super Mystère]]\n* Saab [[J29D|J29]] Tunnan\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/392644-north-american-f-86f-40-sabre/ Official data sheet - more details about the performance]\n* [http://www.joebaugher.com/usaf_fighters/p86_13.html <nowiki>[joebaugher.com]</nowiki> North American F-86F-40-NA]\n\n{{AirManufacturer NAA}}\n{{China jet aircraft}}"}}