{"title":"F6F-5 (France)","pageid":694,"wikitext":{"*":"{{About\n| about = fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = F6F (Family)\n}}\n{{Specs-Card\n|code=f6f-5_france\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} French fighter {{Battle-rating}}. It was introduced in [[Update 1.73 \"Vive la France\"]].\n\nThe F6F Hellcat is well known for serving the United States Navy in World War 2. This French-operated example is identical to the US [[F6F-5]] and is among the first of the many lend-lease US aircraft in the French aviation tree. The Hellcat is a bulky fighter supported by a powerful R-2800 Double Wasp radial engine. In the air-to-air role, it is best used as a boom-and-zoom aircraft to take advantage of its good speed and diving capabilities, but it can also turn quite well in a pinch. The Hellcat is also an excellent strike fighter for mixed battles; a pair of 1,000 lb bombs and a salvo of HVAR rockets can make short work of enemy ground vehicles, and those looking for a challenge can try their luck with the Tiny Tim anti-ship rockets. The Hellcat has something for everyone and is a good introduction to Rank 3 of French aviation. Succeeding the F6F-5 is the [[SB2C-5 (France)|French SB2C-5 Helldiver]], another export US naval aircraft.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\nAs with many other US aircraft, the Hellcat combines heavy weight with high engine power. The R-2800-10w variant of the mighty Double Wasp can produce over 2,000 horsepower on WEP, but this does not fully compensate for its bulk. The climb rate is nothing special compared to other aircraft at its BR. It will climb roughly 17 m/s on average, which is not enough to keep up with German Bf 109s and other aircraft known for their climb rates. The top speed of 647 km/h at altitude is respectable but not lightning fast. At sea level, it tops off at around 570-80 km/h, which is better than most of its contemporaries. Its weight grants it good horizontal energy retention but below average vertical and manoeuvring energy retention; it is not great in stall climbs and sustained turning will bleed energy. The instantaneous turn rate is good at moderate to high speeds (>300 km/h) courtesy of its large wings, especially if combat flaps are used. The roll rate is rather poor, especially at low speeds. Diving performance is good, as it picks up speed quickly and does not compress as much as most of its contemporaries. Pulling out of a dive is rarely difficult.\n\nKeep in mind that the Hellcat only has 8 minutes of WEP, so it should be used sparingly. The difference between full military power and WEP is about 400 horsepower, which is nothing to scoff at.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 5,730 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 620 || 599 || rowspan=\"2\" | {{Specs|ceiling}} || 21.6 || 22.4 || 8.9 || 8.9 || rowspan=\"2\" | 239\n|-\n! Upgraded\n| 681 || 647 || 19.4 || 20.5 || 17.7 || 12.6\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || ✓     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 487 || 458 || 310 || ~12 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 432 || < 420 || < 420 || > 420\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Compressor\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n! Setting 1\n| 518 m || 2,000 hp || 2,398 hp\n|-\n! Setting 2\n| 4,724 m || 1,800 hp || 2,158 hp\n|-\n! Setting 3\n| 6,400 m || 1,650 hp || 1,978 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 38 mm Bulletproof glass in front of the pilot\n* 6.35 mm Steel plates behind the pilot\n* 3 mm Steel plates on fuselage top in front of the cockpit\n* 3 mm Steel plate on the top front of oil cooling system\n* 3 mm Steel plates on the bottom of the engine\n* Self-sealing fuel tanks are located in the wing roots and underneath the pilot's seat\n\nThe Hellcat is a durable and well-protected fighter. The bulletproof glass is sufficient to avoid instant pilot-knockouts in head-ons and the armour throughout the engine compartment further serves to protect the pilot and reduce damage to critical components. The fuel tanks are hidden in the lower fuselage and are typically difficult to hit. The pilot protection from the rear is somewhat disappointing with only slightly over 6 mm of steel.\n\nKeep in mind that the Hellcat is not invincible and it's still much better to avoid enemy fire if possible. It does not qualify as a \"flying tank\" like the [[IL-2M type 3|IL-2]], so do not sit idly when enemies are on your tail and be wary of SPAAs in mixed battles.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M2 Browning (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 6 x 12.7 mm M2 Browning machine guns, wing-mounted (400 rpg = 2,400 total)\n\nThe six machine guns are arranged in bundles of three mounted in both wings. Each is armed with the same amount of ammunition, which means that all guns will fire with each other until empty. These M2 Brownings are equipped with mid-war belts and the Universal belt is the best option for setting enemies on fire. They have a generous ammo load, which can be refreshing for those used to previous French fighters, and one can afford to spray-and-pray in manoeuvring engagements or unload hundreds of rounds into heavy targets. Note that gun convergence needs to be accounted for, anywhere from 400 to 600 m should work fine.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|AN-M65A1 (1,000 lb)|HVAR|Tiny Tim|Mk.13-1 Case (1,927 lb)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 6 x HVAR rockets\n* 2 x Tiny Tim rockets\n* 2 x 1,000 lb AN-M65A1 bombs (2,000 lb total)\n* 2 x 1,000 lb AN-M65A1 bombs + 6 x HVAR rockets (2,000 lb total)\n* 1 x 1,927 lb Mk.13-1 Case torpedo\n\nThe Hellcat has a good array of ground attack ordnance, surpassing the previous [[A-35B (France)|A-35B]] despite not being a dedicated attacker. The twin 1,000 lb bombs drop together, have a generous combined blast radius, and can clear out a capture point in ground battles. They are the most reliable option for destroying tanks or finishing off a base. The HVAR rockets rely on explosive power and can penetrate 36 mm of armour upon a direct hit. They are best used in salvos to destroy soft targets like light tanks and SPAAs either with a direct hit or an indirect hit by overpressure. Medium and heavy tanks will typically require a hit to the roof armour, which is difficult to score consistently considering the unimpressive ballistics of the HVAR. The Tiny Tim rockets, fired individually, are exceptionally powerful and will obliterate most targets at its BR upon a direct hit or near miss. They need practice to use properly as they have an unusual launch method: the Tiny Tim is first dropped from the hardpoint, and shortly afterwards the motor ignites and it sails towards its target. Lastly, the Mk.13/44 torpedo should be disregarded. It is useful against ships and only ships, but there are currently no French naval units to pair the Hellcat with.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe key to both surviving and owning in the F6F is to keep your speed up and try to be even marginally higher than your opponents. Below 300 km/h (186 mph) it is very sluggish. As with most American fighters, Boom & Zoom is the preferred combat mode for the Hellcat, while its average high-speed manoeuvrability can be used to add in a high yo-yo. It has a lot of ammo, but a good aim is still important since boom-n-zoom only allows you a small window of opportunity to hit your target before you have to climb back to altitude. Still, this is an excellent plane to practice your aim and tactics with because it's more forgiving than most boom-n-zoom fighters. If you don't have particularly good aim, a good tactic is to open up at 500 m (0.31 mi), starting with your aim on the aircraft, and then slowly move your aim in front of the target. You won't require as much lead when diving on your target at 600+ km/h (373+ mph).\n\nWith dual 1,000 lb bombs and six HVAR rockets armed, the Hellcat is a stable game-ending platform in a pinch when the rest of your team is not ground-attacking. The two Tiny Tim anti-tank rockets can also be useful for taking out more massive targets. Sometimes, it is useful to save the Hellcat as your last plane just for that.  You can always jettison the rockets and bombs if you're suddenly forced to dogfight.\n\nIt is incredibly important to use Manual Engine Controls while piloting the Hellcat in Realistic or Simulator Battles. The Hellcat has access to three Supercharger gears, each tailored for a different altitude, and each will significantly improve your performance at their appropriate altitudes.\n\n'''Keep in mind:'''\n\n* It has a lot of engine power, but at anywhere between 5.7 and 7 tonnes, getting up to altitude isn't very easy.\n* Resist the temptation to get into low-altitude turning fights. This is a heavy aircraft and it will lose a massive amount of speed in turns.\n* While it has plenty of explosive armament options, in Realistic and Simulator battles the added weight and drag will usually make you an easy target for other fighters. Since most air battles are basically dogfights, you're often better off without the extra weight.\n* This thing will perform reasonably well at low altitudes, but it's still recommended to stay at an altitude of 3 km or higher.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Controllable<br>3 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Can carry a lot of payload for a rank III aircraft\n* One of the few fighters that can carry a torpedo\n* Very effective in either air-to-air or air-to-ground, very versatile\n* Bombs are mounted directly under the fuselage, very accurate when dive bombing\n* Good climb rate\n* Excellent dive rate\n* Good cockpit visibility\n* Extremely efficient cooling system\n* Lots of ammo\n* Can take some hits\n* Decent at energy fighting, although not as good as the [[Bf 109 F-4]]\n\n'''Cons:'''\n\n* You have to fly at a very low altitude at a deficient speed to drop the torpedo, which is impractical\n* Only three salvos of HVAR rockets\n* Carrying the 2 x 1,000 lb bombs and the 6 x HVAR rockets also adds a worse climb rate\n* Slower top speed compared to other contemporary US fighters\n* Higher stall speed than its Japanese counterparts\n* Control stiffening above moderate speeds\n* Poor roll rate\n* Large fuselage cross-section makes it an easy target\n* Guns mounted further on the wings making it harder to aim at a target that is smaller than you\n* Despite its formidable reputation as the Zero killer, a Zero could still easily kill it if you are forced to fight on the Zero's terms\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n[[File:F6F-5 landing on CV Arromanches, Gulf of Tonkin, 1953.jpg|thumb|A French F6F-5 lands on the \"Arromanches\" carrier during the Indochina War, circa 1953. The F6F's ruggedness and reliability made it an effective aircraft for the Asian theatre.]]\nThe F6F-5, as a battle-hardened veteran of the Second World war, was chosen as a potential carrier-based naval fighter and strike aircraft by the French Aéronavale, in the process of rebuilding France's military. Thus, the Air Ministry procured a total of 124 F6F-5 and 15 F6F-5N aircraft from Grumman between 1950 and 1953. The aircraft were based on the French aircraft carriers CV Arromanches (formerly HMS Colossus), CVL Lafayette (formerly USS Langley) and CVL Bois-Belleau (formerly USS Belleau Wood).\n\nThe aircraft served during the first Indochina war, between 1951 and 1954. The aircraft served with the 11F and 12F combat squadrons as well as the 54S, 57S and 59S training squadrons. The aircraft was complemented by F4U Corsairs of the Aéronavale, and later on, the F8F Bearcat. However, the relative obsolescence of the aircraft made its service life short - most units were withdrawn from service after the Indochina war, and almost all aircraft had been scrapped by 1960.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=f6f-5_france Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|CYmfouOb72k|'''Realistic: F6F-5 Hellcat [French Lend-Lease]''' - ''Jengar''}}\n\n== See also ==\n<!--''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''-->\n\n* [[F6F-5]] - American variant\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/341957-f6f-5-hellcat/ Official data sheet - more details about the performance]\n* [http://www.ffaa.net/aircraft/hellcat/hellcat.htm [French Fleet Air Arm<nowiki>]</nowiki> F6F-5/ N HELLCAT]\n\n{{AirManufacturer Grumman}}\n{{France fighters}}"}}