{"title":"Fw 190 D-9","pageid":232,"wikitext":{"*":"{{About\n| about = German fighter '''{{PAGENAME}}'''\n| other\n| usage-1 = the Soviet version\n| link-1 = Fw 190 D-9 (USSR)\n| usage-2 = other versions\n| link-2 = Fw 190 (Family)\n}}\n{{Specs-Card\n|code=fw-190d-9\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} German fighter {{Battle-rating}}. It was introduced in [[Update 1.37]].\n\nThe Fw 190 D-9 is considered by many to be the best prop plane Germany has at 6.0 battle rating and below, and for good reason. The 190 D-9 is one of the few planes where its advantages are in extreme excess of its disadvantages. With its outstanding climb, high speed, crisp controls and tight firepower it is able to zoom in, get shots on target, and then escape in the blink of an eye. It may have mushy manoeuvring at low speeds, and may not be the best aircraft to take into the high vertical while slow, but it is by and large a top-tier aircraft in good hands.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\nThe Fw 190 D-9 is definitely in the top 3 list for Germany's piston-engine fighter lineup. Thanks to the new inline engine, this Fw has a massive power upgrade from the radial versions of the Fw 190. The Fw 190 D-9 has a unique and powerful list of traits that set it apart from the pack and have solidified it as one of the deadliest battle rating fighters in the game.\n\nThe engine and airframe characteristics are the major area where the new inline engine of the 190 Dora series benefits. Not only is the Jumo 213A smaller and more aerodynamically clean than a BMW radial, but it also has more power. Acceleration is extremely good across the entire speed range, but most notably at low-medium speeds and likewise for altitudes, being competitive against the vaunted [[La-7B-20]] at low altitudes. The D-9 goes a blazing 621 km/h at sea level, which is 20 or so km/h faster than the Bf 109 K-4! Maximum speed at 2,200 m is 660 km/h (TAS) and rises from there, at 5,500 m it is 710 km/h, and 680 km/h at 8,000 m, steadily dropping off from there. Those are all extremely competitive numbers, beating out most of its opposition. Climb rate is equally good, taking 90 seconds to hit 2,000 m, 192 to 4,000 m, 297 to 6,000 m, and 430 to 8,000 m. Again, this is an outstanding performance that is better than most aircraft it faces. Dive acceleration and maximum diving speed are both extremely strong traits of the D-9. This plane redlines at about 880 km/h IAS, which is insanely high comparing to other planes it faces. At the start of an RB match, you can WEP for about 5-6 minutes before engine heat will give you trouble. The engine overheats at 120°C and the oil at 90°C. Engine heat decreases at a relatively slow rate while at 100% throttle and the MW-50 lasts for a total of 30 minutes.\n\nIt is widely considered that manoeuvrability is how well a plane can turn, which is the D-9's case as its turning is generally poor. The D-9's turn rate is at its best above 450 km/h, where it can swing its nose around at alarming speed. At speeds below 320 km/h, the D-9 is one of the worst turners in the game. It is important to keep speeds relatively high to maximise your turn rate and manoeuvring potential. Energy conserving manoeuvres like yo-yos should be utilised to make the most out of your precious energy reserve. Never get in sustained turning engagements, always disengage early if you find yourself losing too much speed. While the D-9 may be a bad turner, it more than makes up for it with its extremely responsive and high rate of roll. The Fw 190's have always been known to dominate in this area, and the D-9 continues the 190 traditions of crushing the opposition here. The rate of roll is sadly best utilised by more experienced pilots, but it is one of the most important traits for fighter aircraft. Try to think of manoeuvres that best utilise your roll rate advantage when on the defensive. The 190's manoeuvring traits suit a more Boom & Zoom/slash attack style of play; keeping crisp controls up to breakneck speeds combined with the roll rate and instantaneous turn ability makes it one of the best Boom & Zoom planes in the game. It is for this reason the D-9 is the preferred ride for veterans and newbies alike.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,800 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 680 || 655 || rowspan=\"2\" | {{Specs|ceiling}} || 21.6 || 22.4 || 11.3 || 11.3 || rowspan=\"2\" | 453\n|-\n! Upgraded\n| 745 || 710 || 19.3 || 20.4 || 22.0 || 15.8\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| X || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || N/A || 700 || 310 || ~13 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 420 || < 300 || < 550 || > 320\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 3 mm Steel - Engine cowl armour\n* 8 mm Steel - Under cockpit/fuel tank armour\n* 5 mm Steel - Rear fuel tank armour\n* 8 mm Steel - Pilot's seat armour\n* 6 mm Steel - Pilot's seat armour\n* 12 mm Steel - Headrest armour\n* 57 mm Bulletproof Glass\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|MG 151 (20 mm)|MG 131 (13 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 20 mm MG 151 cannons, wing-mounted (250 rpg = 500 total)\n* 2 x 13 mm MG 131 machine guns, nose-mounted (400 rpg = 800 total)\n\nThe Fw 190 D-9 carries a strong weapon set with two 20 mm MG 151/20 cannons in the wing roots and two 13 mm MG-131 in the cowling. Like all 190s, the D-9 has a very generous ammunition load, packing 250 rounds per cannon and 475 rounds per MG. However, this combination has very slow muzzle velocity, thus shooting at closer ranges should be a priority unless in a head-on. The best MG 151 belt is the \"Air Targets\", as it's a good mix between tracers and stealth ammo, plus it features mine shells in a 2/3 ratio. The best MG 131 belts are either IAI, which contain an explosive filler and can be used as tracers, or Stealth. The bulk of the firepower here are the cannons, so maximizing your Mineshell (Minengeschoß) count is important. The best combination overall is Air Targets for the MG 151s and Stealth for the MG 131s. Stealth belts for the 13 mm make your 20 mm hard to see from far, as the tracer component of the Air Targets belt is very low, but at the same time it also makes it easier for you to track your 20 mm shots, as the tracers help a lot. The MG 151s feature higher fire rate than its contemporaries, but a slower muzzle velocity, so therefore you should lead your shots further. As a whole, the D-9's weapons allow good snapshot ability while retaining a lot of firing time, making it a well rounded yet powerful package.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|SC50JA (50 kg)|SC250JA (250 kg)|SC500K (500 kg)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 1 x 500 kg SC500K bomb + 4 x 50 kg SC50JA bombs (700 kg total)\n* 1 x 500 kg SC500K bomb (500 kg total)\n* 1 x 250 kg SC250JA bomb + 4 x 50 kg SC50JA bombs (450 kg total)\n* 1 x 250 kg SC250JA bomb (250 kg total)\n* 8 x 50 kg SC50JA bombs (400 kg total)\n* 4 x 50 kg SC50JA bombs (200 kg total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe Fw 190 D-9 should utilise its great climb rate to reach high altitudes in order to perform Boom-n-Zoom runs on enemy fighters or to hunt bombers. Although it has the powerful cannons mounted close to the centre of the aircraft, head-on engagements are not recommended due to the unprotected and fragile engine. Instead, try to use the aircraft's great energy retention and engine power to outclimb your opponent's aircraft. Despite its reasonably good turn rate, it would be unwise to turnfight with enemy fighters, however you should be able to outmanoeuvre most strike aircraft.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Auto control available || Not controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Combined || Not controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent top speed along with great climb rate and energy retention\n* Excellent roll rate\n* Very good low altitude performance\n** Good acceleration at low altitude\n** Great energy retention at low altitude\n* Good armament with plenty of ammo\n* Can go into dives with impunity, without compressing (the speed limit is around 920 km/h IAS)\n* Great at Boom & Zoom manoeuvres\n* Very powerful flaps with a high rip speed (700 km/h), can reduce turn rate by half fully deployed\n* WEP is pretty much infinite and MEC is not necessary\n\n'''Cons:'''\n\n* Very sluggish vertical turn rate\n* Bad high altitude handling: after 4,800 m, the plane starts losing engine power and manoeuvrability\n* Mediocre horizontal turn rate at medium speeds\n* Poor low-speed manoeuvrability\n* Bad stall control\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nKurt Tank, the designer of the venerable Fw 190 line-up quickly realised by 1943 that the field of aerial warfare was changing rapidly. The world had moved on beyond dive bombers, and the allies had begun forming massive, four-engine bomber wings that devastated Axis ground troops and factories. At the time, Fw 190's played similar roles to the American P-47 Thunderbolts, serving as ground attack planes and low altitude interceptors. Fw 190's retained air superiority over allied forces all the way up to the introduction of the British [[Spitfire F Mk IX]]. Despite this impressive service record, Fw 190's had one flaw, which would soon usher in the need of the \"Dora\" series. Their performance was hindered drastically at higher altitudes, where aerial warfare was now moving towards. Germany, in desperate need of fighters to engage and stop these massive bomber raids had turned to Messerschmitt and Focke-Wulf to produce a high altitude interceptor, and Kurt Tank's response was the Fw 190 D-9.\n\nUnlike previous models, the \"Dora\" series boasted an improved engine. Specifically, a Jumo 213A bomber engine, more commonly used in the Ju-88. This much larger engine required for the hull of the Fw 190 to also be extended in the front, and for balancing reasons, the tail as well. The D-9 also sacrificed its 4 x 20 mm MG 151 cannons previously used in previous Fw-190's for two 20 mm MG 151 cannons, and a twin set of 13 mm's over the previous models' MG 82's. With an impressive 700+ km/h top speed, the D-9 proved to be one of the fastest interceptors to be rolled off a German assembly line. Despite this, the D-9 was instead used for ground attack roles and fighter interception, using its speed to drop its payload and vanish long before enemy flak had the time to line up a shot.\n\n=== In-game description ===\nThe Great Patriotic War had already ended when the Soviet Air Forces Research Institute (SAFRI) began testing the German piston-engine aircraft in service with the Luftwaffe at the culmination of the war. To begin with, Soviet engineers studied an Fw 190 D-9 with the assembly number W.Nr.210251.\n\nOn the model D-9, the Jumo 213A liquid-cooled in-line engine replaced the BMW 801D air-cooled engine. This slightly increased the aerodynamics of its engine-propeller unit and increased the plane's length by 80 cm. The more powerful engine promised to make the new vehicle superior to the Fw 190 A in speed and climbing rate.\n\nAccording to leading specialists at the SAFRI, the modified FW.190D-9 could not go up against the Soviet Yak-3, Yak-9U and La-7 on equal terms at low and medium altitudes. The Focke-Wulf's low-altitude speed was inferior to theirs by at least 24 km/h, and at 5,000 m, by more than 10 km/h. The German fighter's insufficient horizontal and vertical manoeuvrability also put it at a disadvantage.\n\nThe Soviet Union was interested in manufacturing the plane mainly due to its convenient arrangement of engine and powertrain parts, high maximum oil temperature during engine operation and well-designed automatic water temperature regulator. It was also noted that over its entire testing period from the 11th to the 26th of May 1945, all of the parts in the German plane's special equipment remained operational.\n\nIt could fire all its weapons at once without this affecting its trajectory, and the pilots could barely feel the weapons' recoil. It could fire the cannons and machine guns separately. The extensive electrically-powered equipment made the pilot's work easier.\n\nA mock aviation battle between the Fw 190 D-9 and La-7 fighters showed the full superiority of the Soviet aircraft. SAFRI pilots came to the conclusion that the new German fighter's ability to go up against the Lavochkins was no greater than that of its predecessor, the Fw 190 A-8. Having begun the \"battle\" on a head-on course, the Soviet fighter easily got on the German plane's tail after three banked turns or two chandelles. It's worth noting, however, that these \"battles\" took place without using the engine's methanol-water injection WEP system.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=fw-190d-9 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n[[File:Fw 190 D-9 Gertrud Barkhorn.mp4|thumb|\"Gertrud Barkhorn\" collaboration camouflage|none]]\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.ru/index.php?/topic/94910-fw-190-d-9/ Official data sheet - more details about the performance (Russian Forum)]\n\n{{AirManufacturer Focke-Wulf}}\n{{Germany fighters}}"}}