{"title":"G.50 AS serie 7 (Germany)","pageid":219,"wikitext":{"*":"{{About\n| about = fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = G.50 (Family)\n}}\n{{Specs-Card\n|code=fiat_g50_seria7as\n|images={{Specs-Card-Image|GarageImage_G.50_AS_serie_7.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a gift rank {{Specs|rank}} German fighter {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27 in the German aviation tree. In [[Update 1.69 \"Regia Aeronautica\"]], the G.50, as well as the other Italian planes in the German tech tree, were moved to the new Italian tree, although it still exists in the German tree for those who unlocked it prior to Update 1.69.\n\nThe Fiat G.50 is the oldest of the ''Series 0'' planes, its fellow stablemates are the M.C 200 and Re 2000, both built around the same 860 HP radial engine and having the same armament.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 5,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 451 || 435 || rowspan=\"2\" | {{Specs|ceiling}} || 15.9 || 16.6 || 7.4 || 7.4 || rowspan=\"2\" | 318\n|-\n! Upgraded\n| 492 || 470 || 14.1 || 15.0 || 14.1 || 10.3\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 535 || 450 || 260 || ~13 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 360 || < 270 || < 500 || > 300\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.''\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Breda-SAFAT (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 12.7 mm Breda-SAFAT machine guns, nose-mounted (300 rpg = 600 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|GP 50 (50 kg)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x 50 kg GP 50 bombs (100 kg total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nIn general, it is a slightly worse version of the M.C 200, and as such, it very much flies the same, albeit a little bit slower. With its decent rate of climb, it's generally best to ensure you have proper altitude to play around with first. Generally for low tier planes like the G.50, 3,000 - 4,000 m is generally enough, from there, the way of flying should be dedicated by the situation and opponents. Its good acceleration in dives and respectable dive speeds means it can be used as a pure Boom and Zoomer, especially when you realise its energy retention is better than that of many other planes at its BR. However, it is a decent turn-fighter, barring the poor acceleration so it can be used as such as well. Be careful against regular biplanes and Japanese monoplanes, both of which are considerably better, bar high speeds, where the stiffness of controls on the G.50 are less than on either biplanes or Japanese planes.\n\nThe Fiat G.50 Freccia is a typical Italian pre-war design, it's fairly sturdy, has modest speed and poor armament consisting of 2 Breda SAFAT 12.7 mm guns mounted in the upper cowling, which means it has the distinctive low rate of fire (roughly 400 rounds per minutes). However it does have its merits as well, it's fairly agile, it has no trouble dogfighting Hurricanes it will commonly face, and if things become too hectic, the G.50 can quickly escape by going into a dive, and exploit its surprisingly good dive acceleration to gain separation. Furthermore, it pays to be aware of its modest acceleration and overheating, as such, it's generally advised to maintain an eye on your speed and use WEP sparingly.\n\nFor the armament, the same applies to all other Italian aircraft; generally, you want to use Tracers, Air targets or Stealth since they are the belts that deal the most damage. Shell velocity is low, hence they suffer above 300 m, so only fire at or below that range for best effects. Furthermore, much like the other Italian fighters, the armament is woefully inadequate to deal with bombers, hence it is best to avoid them entirely, or focus on taking out the engines. The only exceptions are the very early biplane bombers, such as the [[Swordfish Mk I|Swordfish]], [[Po-2]] and the likes.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Good visibility from the cockpit\n* Decent rate of climb\n* Good acceleration in a dive\n* High maximum dive speed\n* Decent high-speed handling\n* Good dogfighter\n\n'''Cons:'''\n\n* Modest armament\n* Poor acceleration in level flight\n* Overheating is an issue\n* Guns deal very little damage at long range\n* Modest speed\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n=== In-game description ===\nThe Fiat G.50 \"Freccia\" (\"Arrow\") was the first Italian all-metal monoplane fighter to be adopted by the Regia Aeronautica. Development of the fighter began in 1936, at the request of the Italian Air Force, and ended with the creation of an easy-to-manage and extremely manoeuvrable interceptor. The \"Arrow\" used such modern technology as a constant-speed all-metal propeller and variable pitch, as well as retractable landing gear. The Fiat G.50 competed with a number of contemporary Italian designs like the [[C.200 (Family)|Macchi C.200 \"Saetta\"]]. It was a clear step above the [[CR.42|CR.42 \"Falco\"]] biplane fighters that had equipped the Italian military at the time: the all-metal monoplane construction with retractable landing gear and an enclosed cockpit gave it superior speed to the outdated Falco. The development process was complicated, however, and the G.50 underwent many revisions in response to changing specifications and design flaws uncovered by testing. For example, the enclosed cockpit was abandoned after the first production series. Though it arrived and began production earlier than the C.200, the overall performance of the Freccia was somewhat inferior, especially in terms of speed. The \"Arrow\" however, could not take advantage of the monoplane design because its engine was too weak (at 840 hp). The aircraft's limited armament was also a weakness - it had two synchronous large-calibre machine guns with 150 rounds of ammunition. It was retained since retooling the Fiat factories to produce Saettas would take too much time, effort, and resources. The basic G.50 was produced from 1937 to 1940. It saw considerable service during World War II, but due to the rapid pace of aircraft technological development, it was outdated even at the start of the war. The first series of 45 G.50s, production of which began in late 1937, had a closed cockpit, and while it provided relatively good visibility, the pilots were not very enthusiastic about it, so the second series of planes (200 aircraft) were built with an open cockpit. All in all, 833 G.50s were build (including all variants). The Fiat G.50's Slow speed, poor armament, limited range, and a complete lack of armour protection did it no favors. The [[Hurricane (Family)|Hawker Hurricane]], itself not a cutting-edge fighter, at times outclassed the Freccias during their deployment in the Battle of Britain. The G.50 had somewhat more success in North Africa against British aircraft. They were eventually relegated to fighter-bomber roles, which they fulfilled well. Other users of the Freccia included the Independent State of Croatia and Finland. The latter used their G.50s to surprisingly good effect against the Soviet Union, but they were ill suited for the freezing northern climate and were held in lower regard than other foreign aircraft obtained by the Finnish Air Force. \n\nThe '''G.50 AS''' ('''A'''frica '''S'''ahariana) was a modified variant of the G.50 for use in desert conditions. It appears to have been based on the G.50 bis, an improved mark of the original G.50 that became the production standard from 1940 onwards. The -''bis'' added a fuel tank to the rear fuselage behind the pilot, revised the aerodynamics of the rear fuselage and control surfaces slightly, and made the tail wheel retractable. This fixed the Freccia's issue with range, the flight time being extended to two hours, but performance was very similar. The issues with speed and firepower still remained and it was not quite a satisfactory fighter for 1940-1943. The changes specific to the AS were quite simple: a dust filter was installed on the engine air intake, bomb racks were installed, and the landing gear was tweaked again for better sand resistance. The filter was a very important addition since the G.50 had initially been deployed to Libya without any special modifications and the sand unsurprisingly took its toll on the aircraft. Engine life was still markedly reduced with the filters installed but the improvement was welcome. The bomb racks allowed the Freccia to attack ground targets, leaving most air-to-air combat to higher performing Macchi fighters like the [[C.202|C.202 \"Folgore\"]].\n\nThe G.50 was not the greatest of the wartime Italian fighters, being outperformed by most of its opponents, and its rival from Macchi was generally a better aircraft despite having the same engine and a superficially similar design. Its best combat experiences were in ground attack roles or in the hands of the Finnish, who had skilled pilots and largely fought against similarly outdated Soviet aircraft. The G.50 still deserves credit for being the first modern aircraft of its class to enter Italian service. And the Freccia's design heritage would eventually make its way to the [[G.55 (Family)|Fiat G.55 \"Centauro\"]], a superb design deemed by the Luftwaffe as \"the best fighter in the Axis\" that arguably snatched the crown back from Macchi.\n\nBesides Italy and Germany, the plane served in Finland, Croatia, and Spain as well.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=fiat_g50_seria7as Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n* [[G.50 (Family)]]\n** [[G.50 AS serie 7]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''\n\n{{AirManufacturer Fiat}}\n{{Germany fighters}}"}}