{"title":"Golovachev's Yak-9M","pageid":416,"wikitext":{"*":"{{About\n| about = premium gift Soviet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = Yak-9 (Family)\n}}\n{{Specs-Card\n|code=yak-9m\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\n'''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} Soviet fighter {{Battle-rating}}. It was introduced as a [[wt:en/news/3071--en|premium pack]] in [[Update 1.49 \"Weapons of Victory\"]] and was removed from the Gaijin store in [https://forum.warthunder.com/index.php?/topic/311904-clearance-sale-50-off-various-packs33 May 2016]. It has since been brought back on occasion, such as the [[wt:en/news/4527-shop-special-discounts-en|2017 \"Special Discounts!\"]], the [[wt:en/news/7154-shop-may-sale-in-the-gaijin-store-en|2021 May sale]], and the [[wt:en/news/7674-shop-may-sale-en|2022 May sale]].\n\nThe plane is painted after the camouflage scheme of Soviet pilot Pavel Y. Golovachev in the 900th fighter squadron from February 1945 onward, where he piloted a Yak-9M plane during the Battle of Berlin.\n\nThis vehicle, as with all Yaks, is a decent fighter when used properly. Climbing to ~ 2000 m will ensure that the fighter will have enough energy to engage targets. With flaps, the Yak-9M is a decent turner, though this should not be relied on as it quickly loses energy when fighting in the horizontal.\n\nGolovachev's Yak-9M is the only Yak-9M in the game. It features a distinct camouflage with pre-applied decals and text along the fuselage, setting it apart visually from its contemporaries. With a nose-mounted 20 mm and a 12.7 mm Berezin machine gun, it has a fairly effective armament for a Soviet fighter at this tier, though it is lacklustre compared to other nations.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 614 || 604 || rowspan=\"2\" | {{Specs|ceiling}} || 17.7 || 18.4 || 15.6 || 14.6 || rowspan=\"2\" | 350\n|-\n! Upgraded\n| 633 || 617 || 17.5 || 18.0 || 18.7 || 16.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| X || X || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 720 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || N/A || N/A || 280 || ~12 || ~9\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 380 || < 420 || < 490 || > 340\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\nThe Yak-9M isn't the worst protected aircraft, but it isn't great either. It has some armour protection, and the fuel tanks are self-sealing. Most of the fuel tanks are located in the wings, and one is located beneath the pilot's seat in the fuselage, along with the oil cooler. All of the important modules are located in the inner wings or the front half of the fuselage. You can not rely on the armour of the Yak-9M, although it may save you on a rare occasion.\n\n* 64 mm Bulletproof glass - Windscreen\n* 64 mm Bulletproof glass - Behind pilot's head\n* 8 mm Steel - Behind pilot's seat\n* Self-sealing fuel tanks\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|ShVAK (20 mm)|Berezin UB (12.7 mm)}}\n\n'''''{{PAGENAME}}''''' is armed with:\n\n* 1 x 20 mm ShVAK cannon, nose-mounted (120 rpg)\n* 1 x 12.7 mm Berezin UB machine gun, nose-mounted (200 rpg)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nA distinct Boom & Zoom aircraft, it is important to have the altitude advantage over your opponents. Though this plane has quite a bit of power flight wise, it is lacking in the ability to sustain itself in prolonged fights, especially in turning engagements.\n\nJapanese fighters will out-turn you in both the horizontal and vertical, though they, for the most-part, lack the punching power at this BR to quickly destroy you. As long as you keep your energy up, engaging any aircraft at this tier is no issue unless their have rear gunners.\n\nMany will head-on this aircraft if you give them the opportunity. Since the Yak-9M doesn't have a particularly heavy armament, it is inadvisable to rely on sniping them in this type of engagement. Bomber gunners will shred your engine if you give them the opportunity, so engaging them from directly above or from the sides is preferable to ensure survival.\n\n=== Naval and Ground Battles ===\nThe Yak-9M cannot be equipped with bombs or any secondary ordnance, it should only be used an areal denial fighter to fight off enemy fighters and knockout bombers which pose a threat to the team capping the zones.\n\n==== Ground Battle ====\nOne of the advantages is the Yak-9M has a 20 mm shVAK cannon it can penetrate up to 27 mm, which is enough to knock out most enemy tanks by shooting at the roofs which are normally between 5-25 mm thick.\n\n==== Naval Battle ====\nIn a naval battles, the Yak-9M's armament is enough to reap havoc upon the enemy patrol ships. The important factour is not to come in straight by instead climb and dive upon them like Zeus throwing a lighting bolt into the ground, when that bolt hits the ground it explodes! Make sure to lead the enemy ship and aim for the bridge, a few shots here with its 20 mm shVAK will sink the ship, if not cause major damage and knockout most of its crew.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Auto control available || Controllable<br>Auto control available || Separate || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* The nose mounted cannon and machine gun allow for excellent aiming, even when convergence is set to close range\n* Decent acceleration and energy retention\n* Great elevator authority at most speeds\n\n'''Cons:'''\n\n* Low amount of ammo\n* The singular Berezin UB is a lacklustre secondary\n* Engine is vulnerable to anything bigger than a 7.7 mm\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n[[File:Pavel_Golovachev.jpg|thumb|300px|right|Hero of the Soviet Union twice, Pavel Golovachev was credited with 31 aerial victories.]]\n=== Pavel Golovachev ===\nPavel Golovachev was born on 15 December 1917 in the village of Koshelovo, in present-day Belarus. He entered trade school in 1933, graduated in 1935, and began working at a timber processing plant directly afterwards. He attended the Gomel aeroclub and graduated in 1938. He then went on to graduate from Odessa Military Aviation School of Pilots in 1940, after joining the military. His first assignment was to the 168th Fighter Aviation Regiment in Crimea.\n\nGolovachev was stationed at Iași when the Germans began Operation Barbarossa on 22 June 1941. He flew a number of ground attack missions in a Polikarpov I-16 until October of the same year, when he was transferred to the 69th Fighter Aviation Regiment (renamed to 9th Guards Fighter Aviation Regiment in March 1942).\n\nOn one mission that year, Golovachev flew a mission that resulted in his hospitalization. He and his wingman were engaged by four Bf 109s. Golovachev shot down one of the enemy fighters before his cockpit glass and instruments were shot out by the others. Golovachev successfully completed a belly landing upon returning to base, as his landing gear had been damaged. Surgeons were able to remove all but five pieces of shrapnel.\n\nOn 23 August, Golovachev was hospitalized after another mission went wrong. In the engagement that day Golovachev shot down one Ju 88, but then lost consciousness after being hit by enemy cannon fire. When he regained consciousness his LaGG-33 was in a spin, but Golovachev was able to get his aircraft back into level flight. The tail then fell off, causing the aircraft to crash into the Don River.\n\nAfter his recovery and subsequent release from the hospital, Golovachev was retrained to fly the Yak-1. As a lieutenant, Golovachev's assignment was as a flight commander in the 3rd Squadron; the squadron was then commanded by Amet-khan Sultan, a flying ace. While flying for the squadron, Golovachev participated in a large number of engagements against German aircraft - many of the times the Germans had an advantage in numbers. He became a member of the Communist Party in 1943 and was awarded the title Hero of the Soviet Union for shooting down 17 enemy aircraft in November. He had by then participated in 92 dogfights and flown 225 sorties.\n\nHe was promoted to Captain in the summer of 1944, and was assigned as the deputy squadron commander. During a mission over East Prussia on 30 December 1944, Golovachev ran out of ammunition whilst attempting to down a German Ju-188, so he rammed the aircraft. As a result of the ramming his aircraft entered a dive, but he was able to pull out and make it back to the airfield. For this action he was awarded the Order of the Red Banner.\n\nGolovachev became the commander of the first squadron in February 1945. On 25 April 1945, he scored his two last aerial victories when he shot down two German FW-190s. His total at the end of the war was 31 aerial victories, one group aerial victory, 457 sorties, and 125 aerial battles. On 29 June 1945, he was again awarded the title Hero of the Soviet Union.\n\nHe remained in the Air Force after the end of the war, graduating from the Red Banner Air Force Academy in 1951, and in 1959 he graduated from the Military Academy of General Staff. He held several senior positions in the Air Force, becoming a General-Major of Aviation in 1957. He died in Belarus in 1972.\n\n=== Yak-9M ===\nThe first Yak-9M began testing at the Air Force Research Institute on 17 December 1944, and testing ended on the 27th of the same month. Production of the Yak-9M had actually started ten months earlier at factory #153; production lasted between May 1944 and June 1945, with a total of 4239 Yak-9Ms produced.\n\nThe Yak-9M was an improvement of the Yak-9D, and it featured a new VK-105PF2 engine and VISh-105SV-01 propeller. Additionally, the cockpit was moved 400 mm (40 cm) towards the rear of the fuselage. The Yak-9M incorporated a jettisonable canopy, automatic water temperature control unit, and a pneumatic rather than mechanical armament control - the Yak-9M was the first Yak-9 to include these features. The performance of the Yak-9M was comparable to that of the Yak-9D, but with the large number of improvements listed above.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=yak-9m Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/235707-yakovlev-yak-9m/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Yakovlev}}\n{{USSR fighters}}\n{{USSR premium aircraft}}"}}