{"title":"He 219 A-7","pageid":311,"wikitext":{"*":"{{Specs-Card\n|code=he_219a_7\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium rank {{Specs|rank}} German strike aircraft {{Battle-rating}}. It was introduced in [[Update 1.59 \"Flaming Arrows\"]]. The He 219 A-7 is unique as it is the first user-created vehicle to be featured in the game as part of the [[Affiliate_Program_Revenue_Share|Revenue Share Program]], created by Daniil ''\"Joy_Division__\"'' Zaitsev, inspired by ''\"NovA29R\"''. The plane texture was created by Arthur ''Pacifica'' Carley. The He 219 A-7 is purchasable in-game with {{ge}} and a percentage of the sale goes back to the model author who created it under the Revenue Share Program.\n\nThe Heinkel He 219 A-7 Uhu was produced by the legendary Heinkel company, which was renowned for making excellent aircraft. He 219 A-7 Uhu, is a powerful German Night Fighter, with less than 300 aircraft created during the war. It has a very distinct external appearance, the design of the aircraft resembles a \"Tasman beaked whale\". He-219-A7 features a pressurised cockpit, one pilot and one radar operator; who operates the plane. The plane offers a powerful twin \"Daimler-Benz DB 603 E\" engines. Each engine offers up to 1,774 metric horsepower with a top speed of 388 mph with WEP. The plane is able to climb up to altitudes of 8,000 m (26,248 feet) within 18 minutes and 22 seconds without using WEP.\n\nThe He 219-A7 has three different types of weaponry installed, with a grand total of six cannons.\n\nIn the fuselage, it has two Mk 103 30 mm cannons, given 200 rounds, with another pair of MG 151 20 mm cannons with 600 rounds. In the wings it has two Mk 108 30 mm cannons, with a total of 200 rounds. The total of all the ammunition, which it carries is 1,000 rounds.  It can not be equipped with bombs, rockets, torpedoes or any other type of secondary weapons.\n\nThe unique ground-pounding capability of this aircraft makes it a true force to be reckoned with, if left alone. The \"Armoured targets\" belt for the Mk 103s, consisting of only {{Annotation|HVAP-T|High-velocity armour-piercing tracer}} bullets, is easily able to kill medium tanks from the sides and rear. While the Mk 108s or MG 151s can be left to deal with AAA or Artillery targets, or any fighters that dare to take it head-on.\n\nDo note that the engines seem to overheat rather quickly when running at full WEP.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 6,700 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 602 || 584 || rowspan=\"2\" | {{Specs|ceiling}} || 32.2 || 33.4 || 8.4 || 8.3 || rowspan=\"2\" | 444\n|-\n! Upgraded\n| 648 || 624 || 29.4 || 30.7 || 13.7|| 10.8\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 470 || 444 || 310 || ~11 || ~7\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 440 || < 420 || < 490 || > 280\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 8 mm Steel - pilot seat\n* 8 mm Steel - radar operator seat\n* 12 mm Steel- aircraft nose\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|MK 103 (30 mm)|MK 108 (30 mm)|MG 151 (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 30 mm MK 108 cannons, wing-mounted (100 rpg = 200 total)\n* 2 x 30 mm MK 103 cannons, belly-mounted (100 rpg = 200 total)\n* 2 x 20 mm MG 151 cannons, belly-mounted (300 rpg = 600 total)\n\nThe six cannons are arranged two groups with the two 30 mm MK 108 cannons mounted in the wing roots, while the two Mk 103 and two MG 151 cannons are clustered in the belly of the fuselage. Each of the 30 mm cannons are armed with the same amount of ammunition, which means that all guns will fire together until empty. The 20 mm cannons on the other hand have three times as much ammunition and will continue to be able to fire when the 30 mm ammunition is depleted.\n\nNote: The belly mounted 30 mm MK 103 cannons count as 'additional armament'. Be sure that they are keybound properly.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe below tactics, can be used in all games modes:\n\nClimb to a high altitude, make sure the enemy aircraft is below you, descend and stay on their tail. Since most of your cannons are mounted in the fuselage you don't need to set convergence. However you will still have to set it, since your two Mk 108 30 mm cannons are mounted in the wings, set it for 600 m. Since this will allow them to help with main fuselage cannons to cause critical damage and/or to destroy the enemy plane.\n\n'''Bombers'''<br>\nOnce you locate the enemy bombers, perform an irrational and fast descent however do not lose your energy and speed, in the process. Once you are closing in, fire a short burst to get your attack angles right. As you start closing on your target, your target's gunners may start firing. The rugged airframe of the He-219 should be able to withstand hits.\n\nThis does not mean you should only stay only on the bombers six o'clock during the attack, just staying on the six o'clock will result in your untimely death. You need to keep moving around erratically and being unpredictable, if the gunners on the target aircraft have not been neutralised.\n\nUse WEP and fire two to three second bursts; this will bring the bomber down. Once the bomber is down, ascend and find your next prey. For tougher bombers such as the B-25 Mitchell, you will need to fire a longer burst if aiming for the fuselage, this should be about five seconds. However, you could always aim for the engines and wings and fire a much shorter burst of about two seconds, this will cause major damage to the engine, wing spar, flaps and ailerons, often causing the target aircraft to catch alight and/or lose control and crash which will award you with a kill.\n\n'''Fighters, interceptors & strike aircraft'''<br>\nAs long as you stay on its tail and are undetected, a fighter aircraft will be a easy kill.\n\nStay on its tail and do not let it escape. Do not lose your energy: do not turn fight, this is how you will lose the energy you require to escape. Fire above or below the direction it is going to go; as soon as it starts to turn, disengage and use WEP to get away from that enemy aircraft.\n\nYou should really watch out for the following planes, these are able to outperform and eliminate you from the battle: P-61 Black Widow, Yak 9UT including all the Yaks, the P-51 Mustang, includes all American fighters and British Spitfires.\n\n'''How to perform defensive fighting:'''<br>\nWhen you are being engaged by an enemy fighter, make sure you push the engines to WEP and push the plane into a very steep dive of about 70 degrees. You will reach about 470 mph in this dive, do not perform sharp movements this will result in you causing structural damage and often will rip your wings clean off. To get out of this speed make small improvements to the dive angle of attack, you can keep the speed and energy gained from this evasive dive, then commence your climb back to a high altitude.\n\n'''Ground-pounding'''<br>\nFrom the very start of the game, dive down to very low altitude, perhaps choosing a bearing away from the expected flight path of any enemy fighters. Try to let them pass and engage the fighters on your team before engaging any of the ground targets.\n\nMedium tanks can be killed very easily with the Mk 103s \"Armoured Targets\" belt, aim for the sides of the tanks, or the back of the tanks.\n\nTry your best not to over-extend, as the flight characteristics of the He 219 are not forgiving if you dip too low.\n\nAfter killing a target from the side, fly a bit away before turning around to re-engage other targets, as you want the best possible chance to strike the tanks with a single shot of the Mk 103s, which ''can'' kill tanks easily.\n\nAAA and Artillery can be left alone, or killed easily with the Mk 108s or MG 151s, as you probably want to save the Mk 103s for heavier targets.\n\n===Radars===\n{{main|FuG 202}}\nThe He 219 A-7 is equipped with a [[FuG 202]] search radar, located in the nose of the aircraft; a control box which is part of the radar damage model is located in the rear of the cockpit.\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"4\" | [[FuG 202]] - Target Detection Radar\n|-\n! {{Annotation|Maximum<br/>Detection<br/>Range|The maximum possible range at which a target can be detected}}\n! {{Annotation|Guaranteed<br/>Detection<br/>Range|The range, below which, detection of a target is practically guaranteed}}\n! {{Annotation|Max Azimuth<br/>Scan Angle|How far to each side the radar can scan (widest search mode)}}\n! {{Annotation|Max Elevation<br/>Scan Angle|How far up and down the radar can scan (widest search mode)}}\n|-\n| 4,000 m || 4,000 m || ±30° || ±30°\n|-\n|}\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Auto control available || Controllable<br>Auto control available || Controllable<br>Auto control available || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Armament\n** Very powerful gun armament with a high one-second burst mass\n** Powerful 30 mm MK 108 cannons\n** MK 103 are devastating to ground target, especially with HVAP-T rounds with excellent 77 mm of armour penetration\n** High burst mass means the plane excels in bomber hunting\n* Airframe, performance and handling\n** Decent climb rate with WEP\n** Tough and sturdy airframe\n** Landing gear is strong, can take a fast hard landing\n** Can make it back to the airfield with one engine \n** Can put wing fuel tank fires out in a dive as longed as the engine is throttled back\n** Engines cool down quickly\n* Has access to radar\n\n'''Cons:'''\n\n* Armament\n** 30 mm MK108 cannons have low velocity\n** No defensive or additional armament\n* Airframe, performance and handling\n** Below average manoeuvrability \n** Hard to evade enemies if they are on your tail\n** Can start to overheat quickly when using WEP\n** Subpar top speed of 388 mph (624 km/h)\n** Mediocre climb rate performance without WEP\n** Can stall easily, if you put it in a steep climb\n** Long landing distance \n** Heavy airframe makes it a subpar dogfighter \n** Fuselage fires cannot be put out \n** Can be hard to control at low speed and steep angles\n** At an 85-90 degree roll in a turn, the plane will flip over; this can be very hard to recover from at low altitude\n** Impossible to land without landing gear as the tail section will snap off upon impact with the ground \n** Massive ballistic performance difference between your three different cannons, making it in most scenarios impossible to fully utilize the full firepower of all 3\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe He 219 'Uhu' (\"Eagle-Owl\") was a German prototype night fighter of the Second World War. Designed to counter strategic bombers such as the [[Lancaster B Mk I|Avro Lancaster]], the He 219 was fitted with a radar and Schräge Musik upwards-firing weapons. The aircraft was also the first German aircraft to be fitted with a tricycle landing gear arrangement, and the first production aircraft to be fitted with ejection seats.\n\nThe design and development of the He 219 was long and delayed due to rivalries within the Luftwaffe. Following repeated design changes and delays, the first prototype began construction in February of 1942 funded entirely by Heinkel, as the RLM (German air ministry) was unwilling. After the prototype engine choice was changed to the Daimler DB 603C (the same engine used on the Fw 190 C high-altitude fighter), the prototype was finally completed and flown in November of 1942. The aircraft impressed German night fighter commander Josef Kammhuber, and as a result, the aircraft was ordered into production against the wishes of the RLM. After more internal conflicts, the He 219 was ordered into production.\n\nThe He 219 A-0 was the first production model of the He 219 and was powered by two DB 603 A engines. The aircraft was followed by the He 219 A-2 with extended fuel tanks. The He 219 A-1, A-5 and A-6 were prototypes for various purposes and were not completed. The He 219 A-7 was the last production model of the He 219, featuring upgraded DB 603E engines.\n\nIn terms of design, the He 219 featured a high-mounted wing with two engine nacelles each housing a DB 603E engine and was capable of 670 km/h at 7,000 m altitude. The landing gear was arranged in a tricycle configuration, each rear landing gear leg mounted in the nacelle. The He 219 had a crew of two in a pressurized cockpit, both crew members having access to ejection seats. In terms of armament, the He 219 had four 20 mm MG 151/20 autocannons firing forward and two 30 mm MK 108 cannons firing upwards in a Schräge Musik configuration: these weapons proved to be very effective against bombers.\n\nIn service, the He 219 proved to be quite effective against allied bombers: the aircraft could be directed to the general area by ground control, then locate and engage enemy bombers using their radars. In total, 210 He 219 A-7 aircraft were ordered, but the actual number completed is not known. In total, roughly 300 He 219 aircraft were built; following the war, three aircraft were acquired by the USAF for testing. One He 219 survives today, an A-2 variant, at the Smithsonian National Air & Space museum in Washington DC.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=he_219a_7 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|L04Bp-FkBhA|'''The Shooting Range #4''' - ''Pages of History'' section at 06:09 discusses the He 219 A-7.}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n* [[Ta 154 A-1]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/3746-development-he-219-the-night-hunter-en/|[Devblog] He 219: The Night Hunter]]\n* [[wt:en/news/2799--en/|[News] Revenue Share Program]]\n* [http://forum.warthunder.com/index.php?/topic/315760-heinkel-he-219-a-7/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Heinkel}}\n{{Germany strike aircraft}}\n{{Germany premium aircraft}}"}}