{"title":"Hurricane Mk I/L","pageid":444,"wikitext":{"*":"{{About\n| about = British fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = Hurricane (Family)\n}}\n{{Specs-Card\n|code=hurricane_mk1\n|images={{Specs-Card-Image|GarageImage_Hurricane_Mk_I_L.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} British fighter {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27.\n\nThe Hurricane Mk I/L is one of the first monoplane fighters you will come across within the British tree. The aircraft is powered by a Rolls-Royce Merlin III engine and comes equipped with eight Browning 7.7 mm machine guns, with four situated in each wing.\n\nWhilst not quite as manoeuvrable or as fast as its [[Spitfire (Family)|Spitfire]] brethren, the Hurricane Mk I/L is still very agile for its rank and can hold its own very effectively in dogfights. One of the Hurricane's true strengths is in its durability and sheer robust nature which makes it a favourite among the virtual pilots of War Thunder as it was during the Battle of Britain almost 75 years ago. You will find your Hurricane able to withstand a very high amount of damage before it will give in as it is a largely fabric covered aircraft.\n\nIt is also a very stable gun platform which makes aiming and shooting a very easy task to do. In general the Hurricane is a joy to fly in all modes. A great and forgiving fighter aircraft for beginners to fly!\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!--''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.''-->\nThe Hurricane Mk I/L is a bit more sluggish in movement and turning than its brethren the [[Spitfire (Family)]] but is not an plane to take lightly because its not as agile as the [[Spitfire (Family)]] it's still a very manoeuvrable plane and a good dogfighter, having a top speed of 550/525 km/h (AB/RB) makes it not the fastest fighter of its BR, but combined with its manoeuvrability makes it a plane to be wary of when facing it in combat. Its manoeuvrability and speed is not the greatest, it can feel a bit sluggish at low speed and can lock up quite easily at high speed, but when it's at an average speed it can perform very well for a plane, it can hold its own against enemies. Its strength is that it can get up to a decently speed and it can turn very well compared to other some of the other nations fighters.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 3,962 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 503 || 486 || rowspan=\"2\" | {{Specs|ceiling}} || 15.9 || 16.4 || 7.4 || 7.4 || rowspan=\"2\" | 350\n|-\n! Upgraded\n| 551 || 525 || 14.7 || 15.0 ||16.0|| 10.9\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 268 || 246 || 202 || ~12 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 370 || < 250 || < 380 || > 410\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 4,953 m || 1,030 hp || 1,355 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 6.35 mm Steel - Armour plate in front of the control panel\n* 12.7 mm Steel - Armour plate behind pilot seat/headrest\n* 38 mm Bulletproof glass - Armoured windscreen\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Browning .303 (7.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 8 x 7.7 mm Browning .303 machine guns, wing-mounted (350 rpg = 2,800 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe strong, sturdy wings on the Hurricane make for an excellent gun platform for pilots. So whilst it may lack the punch of cannons or heavier machine guns, you will find the Hurricane's agility and ability to put accurate fire on targets to be in your favour. The standard \"Hawker\" style wide track landing gear present on most, if not all of their monoplane fighters is, of course, found on the Hurricane Mk I/L as well, making this aircraft much more appealing to newer players when landing due to its stability.\n\nIn combat the Hurricane Mk I/L allows pilots to engage almost any aircraft comfortably. Many of the fighters you will face do not have the agility to outmanoeuvre the Hurricane, which will only be surpassed by any biplanes or Japanese fighters you may face. Lone fighter-bombers, attackers, heavy fighters and bombers should also present little threat to the Hurricane as its 8 machine guns provide a dense spread of fire at a fast rate, whilst the rigidity and durability of the airframe will cope with the return fire of the opposing aircrafts' gunners.\n\nThe Hurricane Mk.I have eight .303 calibre machine guns, four in each wing. However, unlike the [[Spitfire Mk Ia|Spitfire]], the Hurricane's guns are all in a single group, so it provides a better firing platform than the Spitfire by allowing its firepower to be concentrated.\n\nHurricane's armament distribution:\n\n         []\n ---IIII-[]-IIII---\n         []\n         []\n        ----\n\n[[Spitfire_Mk_Ia|Spitfire]]'s armament distribution:\n\n         []\n -I-II-I-[]-I-II-I-\n         []\n         []\n        ----\n\nFor Realistic and Simulator Battles, the rate of fire and the subsequent lack of ammo are an important issue to keep in mind. It is easy to deplete the entire ammo with a long burst. Trigger discipline is the key here! Furthermore, the Hurricane's heavy weight, due to its old-fashioned tube chassis (unlike the more modern Spitfire with its nutshell chassis design), results in good vertical energy retention, allowing the plane to perform Boom & Zoom manoeuvres with great success. Utilise them as the standard form of fighting in both modes, as unlike in Arcade, regaining energy and speed after a turn fight takes rather long, leaving you vulnerable to fighters who didn't join the conflict earlier.\n\n====Counter-tactics====\n<!--What to expect, if it would be in command of the enemy and how to counter it. (i.e. They will most likely BnZ, etc.)-->\nCountering the Hurricane almost completely depends on what kind of plane you are flying. If you see a Hurricane there are three things to remember: It is extremely good at turning, very durable and it has 8 machine guns, which despite their small calibre are extremely deadly. It will be able to place you in its crosshairs very quickly and saturate you with rounds. The Hurricane Mk I/L is not without its weaknesses, however. It isn't particularly fast, doesn't dive very well and performs poorly at high altitude.\n\nWhen countering the Hurricane, you must take these strengths and weaknesses into account and also your own. If your plane is faster than the Hurricane but does not turn as well, you should boom and zoom, diving on the Hurricane from altitude and strafing it as you speed by. In a successful attempt, you will destroy the Hurricane in one pass. However, if you miss or only cause minor damage you may need to make another pass. In no situation should you try to turn fight the Hurricane at this stage. You will bleed energy and it will easily out turn and destroy you. Instead, you should use the speed gained in the dive to climb away, leaving the Hurricane behind. When you have achieved an appropriate altitude and speed you can then turn back and make another pass. This kind of manoeuvre takes patience but is worth it when it comes to fighting the Hurricane. Impatience will only get you out-paced by the Hurricane and shot down. If you want to have a higher success rate with boom and zoom tactics, it is good to choose a well-armed plane. Something with cannons or high calibre machine guns should suffice. Planes like the [[Bf 109 E-3|Bf 109]], [[MiG-3-34|MiG-3]], [[LaGG-3-8]], [[P-36G]] and even attackers like the [[IL-2 (1941)|IL-2]] are effective at boom and zoom tactics on the Hurricane.\n\nSome planes can also turn fight the Hurricane. Most biplanes should have equal or better turning capabilities than the Hurricane. An inexperienced/impatient Hurricane pilot may try to out turn a biplane, usually resulting in disaster. However, biplanes are slower. They will often find experienced Hurricane pilots performing tactics like the above-mentioned boom and zoom where the Hurricane can use its higher speed to climb away after a pass. There are also some monoplanes that can out turn a Hurricane. The [[I-16 (Family)|I-16]] will definitely challenge the Hurricane and so will the Japanese [[Ki-27 otsu]] and [[A5M4]]. However, similar to biplanes, they are slow and in the case of the Japanese very poorly armed.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil\n! Water\n! Type\n|-\n| Controllable || rowspan=\"2\" | Controllable<br>Not auto controlled || rowspan=\"2\" | Not controllable<br>Not auto controlled || rowspan=\"2\" | Controllable<br>Auto control available || rowspan=\"2\" | Combined || rowspan=\"2\" | Not controllable<br>1 gear || rowspan=\"2\" | Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n[[File:FighterImage_Hurr2.jpg|thumbnail|right|The Hurricane's wings make a sturdy platform for the 8 wing-mounted 7.7 mm machine guns]]\n\n'''Pros:'''\n\n* Exceptional manoeuvrability: on par with biplanes, perfect for dogfighting\n* High number of guns (8)\n* Plenty of ammo\n* Quick reload speeds for MGs (Arcade only)\n* Takes off very quickly\n* Can also perform Boom & Zoom once altitude is achieved\n* Half of Tracer belt is AP-I ammunition which can start fires\n* Excellent over-the-nose visibility ensures easy tracking and leading in cockpit view\n* Is a stable gun platform with very smooth handling with simulator controls\n\n'''Cons:'''\n\n* Slower than most planes at its rank (especially at higher altitudes)\n* Still only .303 calibre (7.7 mm) machine guns\n* Does not accelerate quickly in a dive\n* Mediocre roll rate\n* Machine guns can run out of ammo quickly without trigger discipline (critical for realistic and simulator battles)\n* .303 ammunition relatively ineffective against larger bombers with a sturdy airframe\n* Combat flaps have a very low rip speed\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/ History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicles's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n[[File:FighterImage_Hurr3.jpg|thumbnail|right|The Hurricane has a very agile, yet durable airframe.]]\nWhilst the iconic Supermarine Spitfire is commonly associated with the RAF's role in the Battle of Britain, its stablemate and fellow frontline fighter at the time is often overlooked. The rugged and reliable Hawker Hurricane, first flown in November of 1935, claimed some 60% of the RAF's aerial victories in the summer of 1940 above Britain against the Luftwaffe's [[Bf 109 E-3|Bf 109 E]], [[Bf 110 (Family)|Bf 110]], [[He 111 (Family)|He 111]], [[Ju 87 (Family)|Ju 87]], [[Ju 88 (Family)|Ju 88]] and [[Do 17 (Family)|Do 17]] types to name a few.\n\nSydney Camm, who designed the Hurricane, based it off the successes of the Hawker Fury biplane and when placed side by side, the family resemblance is clear to see. As the Hurricane was an evolution of the Fury, so too was its Rolls-Royce Merlin V-12 power plant, derived from the Fury's Rolls-Royce Kestrel engine. Entering service in December 1937 with No.111 Squadron the Hurricane soon spread to many frontline squadrons across the RAF's theatres of operation. Many of the RAF's leading pilots and squadrons in the Battle of Britain owe their success to the Hurricane Mk I, such as the Czechoslovakian No.310 Squadron based initially at RAF Duxford in 1940 or the famous Polish No.303 Squadron who ended the battle with 126 destroyed, 13 probable and 9 damaged during the Battle of Britain.\n\n=== In-game description ===\nThe RAF's first eight gun monoplane fighter, the Hawker Hurricane was revolutionary when it first entered service in December 1937. The Hurricane was the result of Hawker Aircraft Ltd's efforts to create a monoplane fighter based on one of the best biplane fighters of the time, the Fury. The fuselage required minimal changes to install an enclosed cockpit; the tail unit was taken from the aircraft's predecessor and the landing gear was made retractable using a hydraulic drive. The engine selected was a 1030 HP Rolls-Royce Merlin II, and the new fighter was armed with eight 0.303 inch Browning machine guns.\n\nThe Hurricane was a robust, reliable, easy to maintain and agile fighter with a good rate of turn at low level. Its survival rate was high, and it became well-loved by its pilots. By the outbreak of the war, the Hurricane's original two blade fixed pitch propeller was replaced by a three bladed variable pitch design; early combat experience in France also highlighted a requirement to replace the fabric covered wing with a stressed metal skin, plus the addition of a bullet proof windscreen and armour for the pilot and the more powerful Rolls Royce Merlin III. The Hurricane Mk I achieved legendary status during the Battle of Britain, where it equipped 32 of RAF Fighter Command's squadrons, compared to only 19 squadrons of Spitfires. Whilst not as fast or agile as the Spitfire, the Hurricane had a greater ability to tolerate battle damage and possessed a more stable firing platform for its armament; for this reason, a standard Fighter Command tactic was, where possible, for Spitfires to deal with German fighters whilst the Hurricanes tackled the bombers. RAF Fighter Command's sole Victoria Cross was honoured upon a Hurricane pilot; on 17th August 1940, Flt Lt JB Nicholson of 249 Squadron received severe burns when he gallantly remained at the controls of his blazing Hurricane to shoot down a Messerschmitt 110.\n\nAll in all, 14,533 of these aircraft were built (including all of the various modified designs).\n\n=== Notable pilots ===\n\n<div><ul>\n<li style=\"display: inline-block;\"> [[File:Douglas_Bader_profile.jpg|thumb|none|220px|User:U64962917#Bader,_Douglas_R.S.B.|[[User:U64962917#Bader,_Douglas_R.S.B.|Douglas Bader]] flew the Hurricane Mk I during 1940 as the squadron commander of No. 242 Squadron, shooting down several German Ju 88, Do 17 and Bf 110 aircraft.]] </li>\n</ul></div>\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=hurricane_mk1 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed-hover\" heights=\"150\">\nImage:FighterImage_SEAC Hurricane.jpeg|<small>SEAC Hurricane skin</small>\n</gallery>\n\n;Videos\n{{Youtube-gallery|uRCNDW1ydFE|'''Realistic: Hurricane Mk I/L [For Queen and Country]''' - ''Jengar''|IvleTjrrsQI|'''Hurricane Mk I.''' - ''DigitalDigging''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n''Paste links to sources and external resources, such as:''\n\n* ''topic on the official game forum;''\n* ''other literature.''\n\n{{AirManufacturer Hawker}}\n{{Britain fighters}}"}}