{"title":"Hurricane Mk IV","pageid":446,"wikitext":{"*":"{{About\n| about = British strike aircraft '''{{PAGENAME}}'''\n| usage = other versions\n| link = Hurricane (Family)\n}}\n{{Specs-Card\n|code=hurricane_mk4\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} British strike aircraft {{Battle-rating}}. It was introduced in [[Update 1.51 \"Cold Steel\"]]. A ground-attack variant of the Hurricane, the Mk IV can carry an arsenal of high-calibre cannons, rockets, or bombs.\n\nSome players feel that this plane is overpowered in Arcade Mode with its twin 40 mm cannons. Since the planes are relatively slow in this rank it is easier to shoot them down. However, the weight of the cannons makes the plane difficult to handle, making it an awkward turn fighter, and like any other Hurricane it is not as well suited to Boom & Zoom due to its slow climb rate, made worse by the weight of the cannons. Additionally, players at this rank rarely have the skill and accuracy necessary for this plane to reach its potential. It is recommended to go for ground targets like light and medium tanks, AAA and armoured cars. This is how you would help your team succeed in battle. However, equipping Air Target rounds and turning enemy planes into aerosol can be infinitely more fun.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,115 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 483 || 465 || rowspan=\"2\" | {{Specs|ceiling}} || 15.9 || 16.7 || 6.5 || 6.5 || rowspan=\"2\" | 360\n|-\n! Upgraded\n| 543 || 511 || 14.8 || 15.0 || 17.6 || 11.1\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 268 || 246 || 202 || ~11 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 370 || < 250 || < 380 || > 410\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 3,352 m || 1,200 hp || 1,724 hp\n|-\n! colspan=\"3\" | Setting 2\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 5,638 m || 1,150 hp || 1,653 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 4.7 mm Steel - Various armour plate protecting the underside of the aircraft's engine\n* 4.7 mm Steel - Armour plating around liquid cooling system\n* 12.7 mm Steel - Armour seat and headrest\n* 38 mm Bulletproof glass - Armoured windshield\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Browning .303 (7.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 7.7 mm Browning .303 machine guns, wing-mounted (338 rpg = 676 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|G.P. 250 lb Mk.IV (250 lb)|G.P. 500 lb Mk.IV (500 lb)|RP-3|Vickers S (40 mm)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* 2 x 40 mm Vickers S cannons, wing-mounted (15 rpg = 30 total)\n* 8 x RP-3 rockets\n* 2 x 250 lb G.P. 250 lb Mk.IV bombs (500 lb total)\n* 2 x 500 lb G.P. 500 lb Mk.IV bombs (1,000 lb total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe Hurricane Mk IV fits into an interesting niche in the British tech tree. It takes the usual Hurricane airframe, removes the usual large number of machine guns (except two), adds armour plates around the engine and cockpit. Then there is the armament. Two 40 mm guns on the wings, which can equip high explosive or armour piercing rounds. You also have the choice to swap these guns for rockets or bombs depending on your targets/play style. This makes the Hurricane most suitable for two roles. These are:\n\n'''Ground Attack''': Being a little more agile than the usual attacker, but still very well armed, the Hurricane Mk IV makes a good ground attack aircraft. The 40 mm cannons can penetrate most vehicles from a steep angle or from the side with armour piercing ammunition. However, they cause very little post penetration damage and are inaccurate. Against light vehicles they can be very effective, but heavily armoured vehicles like [[KV-1 (Family)|KV-1s]] and even [[T-34 (Family)|T-34s]] can usually shrug off the 40 mm rounds. Beware that the cannons are very hard to score hits when aiming for smaller targets, unless you zero the guns to a short distance. The guns also have a very large recoil which makes them furthermore inaccurate. The RP-3 rockets are another good option. A direct hit with one of these rockets to the side/rear/top of an enemy tank will cause serious damage. They cause good explosive damage and can penetrate around 60 mm of armour, but are quite inaccurate and hard to aim for inexperienced players. You also have access to 250 lb and 500 lb bombs, which are ideal for taking out singular high value targets.\n\n'''Bomber Hunting''': The two 40 mm cannons can be deadly against any aircraft they hit. Bombers particularly fit into the category. They are generally big, slow targets that are easy to hit with the otherwise inaccurate and difficult to aim 40 mms. Usually it only takes one or two hits and BOOM! The HE rounds in the air targets belt work particularly well, but for certain targets, the AP rounds are more suitable. Heavily armoured aircraft like the B-25 or the IL-2 can sometimes shrug off the HE rounds, due to their low penetration values, but the AP round can be deadly. For particularly large targets like the BV 238, you can even use rockets, which are sure to cause massive damage.\n\nDespite its heavy handling and only two 7.7 mm machine guns, some more experienced players use the Hurricane as a fighter. If you can get the 40 mms on target, they are deadly. The two 7.7 mms can come in reasonably handy too if you're accurate with them, but they are not suitable for prolonged combat. There are a few ways to use the Hurricane in this way:\n\nBoom & Zoom is the main tactic to use for this Hurricane. The turn rate of this aircraft cannot compete with most other nations, and it has very poor energy retention. The best thing to do in this aircraft is to climb at the start of the round and go bomber hunting, as it is extremely efficient at shooting down the slow, less manoeuvrable targets it will be pitted against at its battle rating. Take your time when taking a shot, tank calibre guns are not meant to be wing mounted and are very inaccurate as a result, so if a shot doesn't look good to you, '''do not fire'''. Boom and zoom is the tactic that should always be employed with this aircraft. Climb, find your target, dive, fire, then using the speed gained in the dive, climb away. Rinse and repeat. Under no circumstances should you attempt to turn fight with this aircraft. Almost any other plane will be able to out turn you. If you do find yourself with an aircraft on your 6, dive and gun the throttle. You should be able to out dive most aircraft. In a ground attack role, this aircraft can be used in much higher battle ratings, where the rockets / 40 mm's remain effective, even against heavy tanks.\n\nIf using the Hurricane Mk IV in higher rank matches, beware of enemy fighters. Almost anything will be able to catch you and easily destroy you. To avoid being obliterated by enemy aircraft, try to spawn only when you have air support or good SPAA coverage. Your twin 7.7 mm will not be enough to deter enemy fighters, but if you are a good shot, the twin 40 mm (with air targets belt) can take out even the most heavily armoured fighters.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Not controllable<br>Not auto controlled || Controllable<br>Auto control available || Combined || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Exceptional stopping power, capable of downing bombers with only one shot from the 40 mm cannon\n* Good dive rate\n* Decent max speed\n* The first aircraft in the British tree to carry the deadly ''Air Targets'' belt\n* Machine guns help aiming the cannons\n* Rockets allow for quicker destruction of targets compared to the 40 mm, but you get less ammunition and can be less accurate\n* Excellent ground attack capability in Realistic and Simulator battles\n* The cannons are great for causing fires on ground targets\n* The rockets, though inaccurate, can destroy heavy tanks\n* Well armoured compared to other Hurricanes, making it more suited to a ground attack role. Can shrug off small calibre rounds relatively easily\n* Small compared to other ground attack aircraft\n* Good at hunting low flying bombers with the 40 mm\n* Rockets or 40 mm can be used on big targets like the BV-238\n* Excellent over-the-nose visibility ensures easy tracking and leading in cockpit view\n* Is a stable gun platform with very smooth handling with simulator controls\n\n'''Cons:'''\n\n* Extremely poor climb rate\n* 40 mm cannons are wing mounted and are somewhat inaccurate and shells will often splice targets at long range\n* Poor turn rate\n* Only 15 rounds per 40 mm gun and only two 7.7 mm Browning's as backup\n* Terrible energy retention\n* Default ammo belts are mixed with AP shells, making it so that shots can cripple rather than destroy\n* Requires an exceptionally good aim in order to be effective due to the 40 mm cannons slow rate of fire\n* Significant recoil from the 40 mm cannons will make follow up shots difficult\n* Continuous fire with the 40 mm cannons will cause them to fire asynchronously, resulting in extremely poor accuracy due to recoil\n* 40 mm AP rounds cause mainly puncturing damage, destroying enemies can be difficult\n* Using WEP at the start of takeoff can cause a nose-over\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nThe Hawker Hurricane Mk IV was the last major production modification of the Hurricane series. The main feature was a new wing design, which could mount eight RP-3 rockets or two 40 mm Vickers S guns for attacking ground targets. The Hurricane Mk IV may have been equipped with more powerful Merlin 24 or 27 engines, but it is disputed. The Mk IV Hurricane received an additional 350 lb (159 kg) of armor protection for the pilot, radiator, and fuel tanks. A dust filter was added for operation in desert environments.\n\nThe Hurricane Mk IV was used as a ground attack aircraft in the European theater until being replaced by the Hawker Typhoon in 1944. It was noted that the top speed of the Hurricane when armed with RP-3 rockets was reduced significantly, and the Hurricane had high losses against German anti-aircraft batteries. One example of this occurred on 20 December 1943, when No. 184 Squadron RAF attacked a German V-1 flying bomb launch site. The squadron of four aircraft was equipped with Hurricanes, and only 1 plane survived the flak long enough to attack the target, with the other three being shot down before they had the chance.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=hurricane_mk4 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|ObEcMPqFBbE|'''The Shooting Range #259''' - ''Tips & Tricks'' section at 09:11 discusses the {{PAGENAME}}.|vhTZXYk6eao|'''Tank busters''' discusses the {{PAGENAME}} at 0:30 - ''War Thunder Official Channel''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n''Paste links to sources and external resources, such as:''\n\n* ''topic on the official game forum;''\n* ''encyclopedia page on the aircraft;''\n* ''other literature.''\n\n{{AirManufacturer Hawker}}\n{{Britain strike aircraft}}"}}