{"title":"I-153P","pageid":414,"wikitext":{"*":"{{About\n| about = premium Soviet biplane '''{{PAGENAME}}'''\n| usage = other uses\n| link = I-15 (Family)\n}}\n{{Specs-Card\n|code=i-153p\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_i-153p.jpg\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium rank {{Specs|rank}} Soviet fighter {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27.\n\nThere is one thing you need to know about the I-153; you will out turn everything it fights. Not a single plane the Chaika fights will win against the I-153P in a turn fight. At a BR of 3.0, however, the Chaika's once moderate speed is now very bad. Nearly every plane will be faster; especially due to how the Chaika locks up at high speed, making it extremely difficult to manoeuvre at high speed. However, plenty of people underestimate the lowly Chaika, and attempt to turn with it. If you notice someone is trying to turn fight you, simply out turn them and light them up with 2 x 20 mm. However, bear in mind the Chaika is also more fragile than most planes in the game; a single 20 mm shot on it is almost always death.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,850 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 425 || 411 || rowspan=\"2\" | {{Specs|ceiling}} || 13.7 || 14.4 || 11.4 || 11.4 || rowspan=\"2\" | 274\n|-\n! Upgraded\n| 466 || 444 || 13.1 || 13.3 || 19.7 || 15.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| X || X || X || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || N/A || N/A || N/A || ~13 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 180 || < 240 || < 380 || > 250\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 8 mm Steel - Plating behind pilot's seat\n* No armour glazing\n* Critical components located at front of aircraft (fuel, pilot, engine, controls)\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|ShVAK (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 20 mm ShVAK cannons, nose-mounted (150 rpg = 300 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|FAB-50sv (50 kg)|RS-82|RBS-82}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 4 x 50 kg FAB-50sv bombs (200 kg total)\n* 8 x RS-82 rockets\n* 8 x RBS-82 rockets\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nUnlike other I-15 that are armed with 7.62 mm machine guns, the {{PAGENAME}} with its 20 mm calibre has comparatively few shells in the gun's magazine, so while the 20 mm can be used to easily destroy enemies, it will require good shot accuracy to make the most of the limited ammunition.\n\nThe I-153 can be used in turnfighting, bomber intercepting and ground pounding. Like in AB and RB, it is excellent in turning tightly and continuously, and it has lovely low-speed handling and low stall speeds (unlike its successor I-16), making it a great starter plane for Sim. However it does have its drawbacks: the rather large nose blocks the visibility a lot, offering very poor over-the-nose visibility which is a disadvantage in a turn fight, because when leading a shot the enemy will always get obstructed by the engine, forcing the player to guess the shot. Also its upper wings will get in the way when you look aside.\n\nNote: it is recommended to set the convergence within 300 m, with vertical convergence on, because the majority of turnfights happen at that range or closer.\n\nBefore engaging a fight, it is better to have an altitude advantage first. When approaching the fight try to figure out which is your teammate and which is the enemy, to avoid going for a second pass, as the energy retention of the I-153 is rather slow. Also pick your target carefully. For easier aiming, you want to go for those unmanoeuvrable twin engine aircraft like [[Ju 88 (Family)|Ju 88]] or [[Ki-45 (Family)|Ki-45]], or bombers if there are any. Given the bad forward visibility of the I-153, these are the best options as they are quite slow and sluggish, and are a bigger target to hit. However getting hits on them doesn't mean good damage, so you must be patient. When dealing with fighters, it is way harder to aim. The elevator control of the I-153 is extremely sensitive, giving it good manoeuvrability, but at the same time, bad handling. The I-153 will respond in a very fast turn upon moving your stick/mouse by a little bit, which makes tracking nimble planes quite hard. But once you get used to it, try to lure every enemy into a turnfight, as that is where the I-153 shines. A few hits with the ShVAK will be enough to critically damage the enemy. If you find an enemy at your six, utilise your great roll rate to do defensive manoeuvres like scissors to make them overshoot. Or you can simply do tight turns, most monoplanes won't be able to cut inside your turn and they might disengage.\n\nIf you are not very experienced in Sim, you can also go for even bigger targets (bombers) for easier aiming. However you want to be more careful when hunting bombers, since with the Sim control (whether it be mouse joystick or a real stick) the plane will manoeuvre much more gently, making itself a great target for the bomber's gunners. DO NOT follow behind a bomber's six unless you are sure that its tail gunners are unconscious. Chasing behind a bomber makes yourself stationary for the tail gunners, and you will be showered with bullets. Your big radial engine will usually get damaged. Instead, before attacking, get an altitude advantage over the bomber by flying around 2 km above it. The best position for an attack is from the bomber's high six so you can adjust the lead much easier. Dive at the bomber, but not directly at it, try to predict where you two will crash by imagining yourself as a missile, that's where you should aim at (deflection shooting). To maximise the damage it is better to aim for their wings and engines, as the fuselage usually soaks up quite some bullets. Only fire when the bomber passes in front of your guns. This short window might seem inadequate to do anything, but with an accurate burst on the engine the twin ShVAK can damage it badly. With an engine damaged most bombers cannot go far. Remember that it also has 8 x RS82 rockets, and when fired in a volley at a bomber, one of them is bound to make impact. All it takes is one to bring down even the mighty [[BV 238]].\n\nGround pounding ability is average as there is only light bombs and rockets. The 8 rockets, with accurate aiming, can destroy 4 targets, whether they be tanks or pillboxes. The small 50 kg bombs can be used on light pillboxes. Once the suspended armaments are gone, the 4 MGs are good for killing soft targets like trucks, artillery and AA cars.\n\n'''Enemies worth noting:'''\n\n[[Ki-27 otsu|Ki-27]], [[N1K1]], [[He 51 (Family)|He 51]], [[Gladiator (Family)|Gladiator]], etc:\n\nThose commonly seen planes are equally good at turnfights and will be a hard target to down since they are very small and agile. To deal with them you need to practice leading and deflection shots, plus manoeuvres like barrel rolls and scissors. Fortunately they can be damaged easily by your ShVAK.\n\n[[Do 17 Z-2|Do 17 Z]]:\n\nThis early twin engine plane always shows up as an AI controlled recon aircraft that you have to down, which is good news as AI won't manoeuvre aggressively. However this plane is extremely durable even for the twin ShVAK. When it shows up as an AI, deflection shots are not recommended as the small shooting windows really does nothing. Instead, try disabling its 2 gunners first, then just sit behind it and burst on its wings and engines. When attacking the gunners try to not get your engine damaged by pulling evasive manoeuvres as soon as the bullets come close, since the Do 17 can outrun the I-153 in a level flight.\n\n[[He 111 H-6]]:\n\nThis bomber is not only quite durable, but also pretty fast. In level flight it can outrun the I-153 rather easily. Avoid being on its six as it will have at least 2 x 7.92 mm MG facing its tail, and their rapid firerate and good penetration is a big threat. Either go for a head-on or use deflection shooting and aim for its engines. If you cannot keep up with it, disengage. If it flies far higher than you, change your target.\n\n[[Sunderland Mk IIIa|Sunderland]]:\n\nThis flying boat is like a low-tier [[Be-6]]. Its huge fuselage is very spacious and can absorb lots of bullets and shells. It also has lethal defensive firepower: two 7.7 mm in the nose, four forward-facing, two on the top and four at the tail, so attacking from behind, in front or above aren't the best options. Dive under it and suddenly pull up to shoot its defenceless underpart. Aim at the large wings and engines, avoid shooting the fuselage.\n\n[[He 100 D-1|He 100]], [[Bf 109 E-1|Bf 109 E]]/[[Bf 109 F-1|F]], [[A6M2]]:\n\nThese planes might not be able to out-turn the I-153, but they can easily outrun it as the I-153 is slower. These fighters will usually BnZ you, so you must constantly look above and behind you. If they are diving on you, do what you do in realistic: use your roll rate and dodge under their negative G areas. Most players will try to follow up, if not immediately losing track of you. Several dodges might make them impatient and if they really start to turn with you, they are already dead.\n\n====Counter-tactics====\n<!--What to expect, if it would be in command of the enemy and how to counter it. (i.e. They will most likely BnZ, etc.)-->\nShould you be facing an I-153P, whatever you do, do not attempt to engage in a turn fight. The little biplane is more than capable of out turning even the A6M2 Reisen. Calmly deploy Boom & Zoom tactics against it; fly in from above, light it up, and fly away. Try not to keep yourself level for too long, as there is a chance it will be able to hit you if you speed away. It has a moderate climbrate too and will climb after you with relative effectiveness if you fly back up after the \"zoom\".\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Low stall speed\n* Good roll rate\n* Great turn speed\n* Great armament consisting of 2 x 20 mm cannons\n* Easily underestimated\n* Thanks to great agility and suspended armaments, the Chaika can work as very nimble CAS\n\n'''Cons:'''\n\n* Slow\n* Very vulnerable against enemy guns it faces\n* Poor energy retention\n* Good climb rate against biplanes, but not against advanced monoplanes\n* Less effective belts for ShVAKs (An issue shared by I-16s type 27 and 28.)\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n=== In-game description ===\nThe I-153P Chaika (Seagull) was a Soviet biplane fighter of the 1930s and 1940s. It was created by the Polikarpov Design Bureau in 1938. It is a modification (3rd variant) of the earlier I-15 fighter, as shown in the designation. The Chaika was considered to be the fastest biplane in the world. However, at the start of hostilities between the Soviet Union and Germany, the I-153 could not compete on equal terms with the German Messerschmitt Bf-109 and therefore was mainly used in ground attack roles.\n\nFor many years, Soviet pilots considered the I-16 to be the most dangerous aircraft in a spin. Therefore, when flight testing the I-153 with the M-25 engine in March and April of 1939, the VVS Command paid special attention to its spin characteristics. Initially, the matter remained unresolved. However, in the summer of 1939, when the new aircraft saw action against the Japanese in Mongolia, NII VVS returned to this crucial point. Test results were disappointing. By the third full rotation the I-153 would go into a flat spin; the engine would cease by the fifth formation, after which spin recovery would become extremely difficult. Lowering the landing gear in order to shift the center of gravity did not help. The Chaika still took a significant amount of time to recover.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicleCountry=ussr&vehicleType=aircraft&vehicleClass=fighter&vehicle=i-153p Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|1WIdbHr_adc|'''Premium Series. {{PAGENAME}}. Quick Defeat!''' - ''Joseph 2000''|7d-Kop_sGt8|'''The Shooting Range #162''' - ''Pages of History'' section at 04:44 discusses the I-153.|diDr1Delr-E|'''Premium Review: {{PAGENAME}}'''  - ''Jengar''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n\n* [[I-15 (Family)]]\n\n;Aircraft of comparable role, configuration and era\n\n* [[I-16 type 17 (China)]]\n* [[I-16 type 27]]\n* [[I-16 type 28]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/2768/current|[Vehicle Profile] Polikarpov I-153]]\n* [[wikipedia:Polikarpov_I-153|[Wikipedia] Polikarpov I-153]]\n* [https://www.airvectors.net/avpkpv.html#m2 <nowiki>[Air Vectors]</nowiki> Polikarpov Fighters - I-15 / I-152 / I-153]\n\n{{AirManufacturer Polikarpov}}\n{{USSR fighters}}\n{{USSR premium aircraft}}"}}