{"title":"I-15bis (China)","pageid":7337,"wikitext":{"*":"{{About\n| about = fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = I-15 (Family)\n}}\n{{Specs-Card\n|code=i-15bis_china\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese fighter {{Battle-rating}}. It was introduced in [[Update 1.91 \"Night Vision\"]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 368 || 356 || rowspan=\"2\" | {{Specs|ceiling}} || 10.9 || 11.7 || 10.6 || 10.6 || rowspan=\"2\" | 125\n|-\n! Upgraded\n| 394 || 380 || 10.3 || 10.5 || 19.1 || 14.2\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| X || X || X || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || N/A || N/A || N/A || ~14 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 180 || < 360 || < 260 || > 309\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 2,900 m || 750 hp || 830 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 8 mm steel: behind pilot\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|PV-1 (7.62 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 4 x 7.62 mm PV-1 machine guns, nose-mounted (1,100 rpg upper + 425 rpg lower = 3,050 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|FAB-50sv (50 kg)|RBS-82|RS-82}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x 50 kg FAB-50sv bombs (100 kg total)\n* 6 x RS-82 rockets\n* 6 x RBS-82 rockets\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe I-15 can be used in turnfighting, bomber intercepting and ground pounding. It is excellent in turning tightly and continuously, and it has lovely low-speed handling and low stall speeds (unlike its successor I-16), making it a great starter plane for sim. However it does have its drawbacks: the rather big nose blocks the visibility a lot, offering very poor over-the-nose visibility which is a disadvantage in a turn fight, because when leading a shot the enemy will always get obstructed by the engine, making the player guess the shot. Also its upper wings will get in the way when you look aside. Plus, it has an awful telescope-like gunsight, so when zoomed in the I-15's nimbleness is magnified, making the aim super wobbly. You cannot see anything around which greatly reduces your situational awareness.\n\nNote: it is recommended to set the convergence within 300 m, with vertical convergence on, because the majority of turnfights happen at that range or closer.\n\nNote 2: in a turnfight you must get used to shooting without zooming in, as you really can't see anything with its awkward scope when zoomed it. However when tailing a straight-flying plane that scope doesn't seem that bad\n\nBefore engaging a fight, it is better to have an altitude advantage first. When approaching the fight try to figure out which is your teammate and which is the enemy, to avoid going for a second pass, as the energy retention of the I-15 is rather slow. Also pick your target carefully. For easier aiming, you want to go for those unmanoeuvrable twin engine aircraft like [[Ju 88 (Family)|Ju 88]] or [[Ki-45 (Family)|Ki-45]], or bombers if there are any. Given the bad forward visibility of the I-15, these are the best options as they are quite slow and sluggish, and are a bigger target to hit. However getting hits on them doesn't mean good damage, so you must be patient. When dealing with fighters, it is way harder to aim. The elevator control of the I-15 is extremely sensitive, giving it good manoeuvrability, but at the same time, bad handling. The I-15 will respond in a very fast turn upon moving your stick/mouse by a little bit, which makes tracking nimble planes quite hard. But once you get used to it, try to lure every enemy into a turnfight, as that is where the I-15 shines. Quite a bit of bullets are required to effectively damage the enemy so you must be patient. If you find an enemy at your 6, utilise your great roll rate to do defensive manoeuvres like scissors to make them overshoot. Or you can simply do tight turns, most monoplanes won't be able to cut inside your turn and they might disengage.\n\nIf you are not very experienced in sim, you can also go for even bigger targets (bombers) for easier aiming. However you want to be more careful when hunting bombers, since with the Sim control (whether it be mouse joystick or a real stick) the plane will manoeuvre much more gently, making itself a great target for the bomber's gunners. Do not follow behind a bomber's 6 unless you are sure that its tail gunners are unconscious. Chasing behind a bomber makes yourself stationary for the tail gunners, and you will be showered with bullets. Your big radial engine will usually get damaged. Instead, before attacking, get an altitude advantage over the bomber by flying around 2 km above it. The bomber should only fill up about 1/6 of your gunsight. The best position for an attack is at the bomber's high 6 so you can adjust the lead much easier. Dive at the bomber, but not directly at it, try to predict where you two will crash by imagining yourself as a missile, that's where you should aim at (deflection shooting). To maximise the damage it is better to aim for their wings and engines, as the fuselage usually soaks up quite some bullets. Only fire when the bomber passes in front of your guns. This short window might seem inadequate to do anything, but with a accurate burst on the engine the 4 MG can at least damage it. With an engine damaged most bombers cannot go far.\n\nGround pounding ability is average as there are only few bombs and rockets. The 6 rockets, with accurate aiming, can destroy 3 targets, whether them be tanks or pillboxes. The small 50 kg bombs can be used on light pillboxes. Once the suspended armaments are gone, the 4 MG are good for killing soft targets like trucks, artillery and AA cars.\n\n'''Enemies worth noting:'''\n\n[[Ki-27 otsu|Ki-27]], [[N1K1]], [[He 51 (Family)|He 51]], [[Gladiator (Family)|Gladiator]], etc. - Those commonly seen planes are equally good at turnfights and will be a hard target to down since they are very small and agile. To deal with them you need to practice leading and deflection shots, plus manoeuvres like barrel rolls and scissors. They still need plenty of bullets to get damaged, so these kind of targets are the hardest to kill and requires great skills from the player.\n\n[[Do 17 Z-2]] - This early twin engine plane always shows up as an AI controlled reconnaissance aircraft that you have to down, which is a good news as AI won't manoeuvre aggressively. However this plane is extremely durable for the I-15's weak MGs. When it shows up as an AI, deflection shots are not recommended as the small shooting windows really does nothing. Instead, try disabling its 2 gunners first, then just sit behind it and burst on its wings and engines. When attacking the gunners try to not get your engine damaged by pulling evasive manoeuvres as soon as the bullets come close, since the Do 17 can outrun the I-15 in a level flight.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Not controllable<br>Not auto controlled || Not controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Combined || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Extreme turning abilities: one of the best turn-fighters in-game, able to turn tightly and continuously with other biplanes\n* Firepower is rich with 4 x 7.62 mm MG, moderate damage and plenty of ammo\n* Good rate of climb\n* Small silhouette meaning you are harder to hit\n* 2 x 50 kg bombs allow you to have some ground-pounding abilities in ground battles\n* Fixed gear is convenient for quick landings and takeoffs\n* Very short take off distance\n* Low stall speed, beginner friendly to land and manoeuvre\n* Open cockpit allows you to easily hear nearby aircraft in Simulator\n* Nose-mounted MGs means no need to worry about convergence distances\n\n'''Cons:'''\n\n* Very slow speed: cannot keep up with early monoplane fighters (eg [[He 112 (Family)|He 112]]) or even some bombers such as [[Do 17 E-1]]\n* Will quickly lose speed gathered in a dive\n* Average roll rate\n* Open cockpit can usually get the pilot sniped\n* Small 50 kg bombs require very accurate aiming\n* Telescopic gunsight offers very limiting field of view in Simulator\n* Big engine blocks the visibility over the nose, a disadvantage in a turnfight in Simulator\n* Side views are obstructed by the upper wings and supporting structures\n* Very wobbly with Simulator controls, making it hard to aim precisely\n* Vulnerable to heavy machine gun fire (e.g. [[Browning M2 (12.7 mm)|.50 cal M2 Browning]], [[Breda-SAFAT (12.7 mm)|12.7 mm Breda-SAFAT]])\n\n== History ==\n<!--''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).''-->\n\nOn the 7th July 1937, fighting broke out between Chinese and Japanese forces, starting the Second Sino-Japanese War. When the war began the Chinese air force was using many obsolete aircraft, such as the [[Hawk III]], which were no match for the Japanese A5M fighters.<ref name=\"PolikarpovAces\">Maslov and Postlethwaite 2013</ref> China rapidly signed the Sino-Soviet Non-Aggression Pact with the USSR, and as part of the agreement the Soviets began Operation Zet to secretly supply China with aircraft and pilots.\n\nBetween October 1937 and September 1939 the USSR delivered 885 aircraft (rising to 1,250 by 1941) to China, including 215 Polikarpov I-15 aircraft delivered very soon after the deal was agreed (eventually rising to 347 I-15s). At first the Soviet pilots would have to fly the aircraft over 1,500 miles across China to get them to their destination of Lanzhou, however this was a risky journey and so future batches of aircraft would be disassembled and transported to Hami (closer to Lanzhou), before final assembly and delivery to Lanzhou.<ref name=\"PolikarpovAces\" /> The Soviets also sent 250 volunteer pilots to fly the I-15s for China. The fist I-15s were delivered in November 1937. In Chinese service the I-16 became known as the \"Chizh\" or \"Siskin\".<ref name=\"PolikarpovAces\" />\n\nA number Chinese aces flew the I-15bis; among them Liu Chi-Sheng who achieved 6 of his 10 kills while flying the I-15bis.<ref name=\"ChinaAces\">Cheung and Davey 2015</ref>\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=i-15bis_china Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|rpp-GqXiaKg|'''The Shooting Range #214''' - ''Air Triathlon'' section at 09:59 discusses the {{PAGENAME}}.}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!--''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''-->\n\n* [https://forum.warthunder.com/index.php?/topic/272053-polikarpov-i-15bis/ Official data sheet - more details about the performance]\n* [[Wikipedia:Polikarpov_I-15|[Wikipedia] Polikarpov I-15]]\n* [http://surfcity.kund.dalnet.se/china_chi-sheng.htm Biplane fighter aces China - Major General Liu Chi-Sheng]\n* [http://www.century-of-flight.freeola.com/Aviation%20history/WW2/aces/Liu%20Chi-Sheng.htm Aviation during World War 2 - Major General Liu Chi-Sheng]\n\n=== References ===\n;Citations\n<references />\n\n;Bibliography\n* Cheung, R., & Davey, C. (2015). Aces of the Republic of China Air Force. United Kingdom: Bloomsbury Publishing.\n* Maslov, M., & Postlethwaite, M. (2013). Polikarpov I-15, I-16 and I-153 Aces. United Kingdom: Bloomsbury Publishing.\n\n{{AirManufacturer Polikarpov}}\n{{China fighters}}"}}