{"title":"I-16 type 24","pageid":336,"wikitext":{"*":"{{About\n| about = Soviet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = I-16 (Family)\n}}\n{{Specs-Card\n|code=i-16_type24\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Soviet fighter {{Battle-rating}}. It was introduced in [[Update 1.39]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nThe I-16 is a famous turn fighter that can turn in a blink of an eye. It has a small engine which can't reach great speeds. It's slow, can't climb and has poor energy retention. The 95 octane fuel helps a lot for the performance.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,400 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 440 || 424 || rowspan=\"2\" | {{Specs|ceiling}} || 17.4 || 17.9 || 15.0 || 15.0 || rowspan=\"2\" | 210\n|-\n! Upgraded\n| 491 || 466 || 15.6 || 16.4 || 24.6 || 19.1\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 700 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || 395 || 362 || 260 || ~15 || ~7\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 300 || < 240 || < 280 || > 190\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 8.5 mm steel behind pilot\n* Self-sealing fuel tanks (1 in front of pilot)\n\nThe aircraft's engine is small but incredibly vulnerable. It's useless after only a few hits. The construction is relatively weak and can't withstand a lot of punishment. The pilot is exposed and the fuel tanks catch fire and explode fast. All this compensated by its manoeuvrability, which can be enough to avoid being hit. Avoid flying above AAA, because the plane and the pilot are vulnerable to them.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 7.62 mm ShKAS machine guns, nose-mounted (650 rpg = 1,300 total)\n* 2 x 7.62 mm ShKAS machine guns, wing-mounted (900 rpg = 1,800 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|FAB-50sv (50 kg)|FAB-100sv (100 kg)|RS-82|RBS-82}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x 100 kg FAB-100sv bombs (200 kg total)\n* 2 x 50 kg FAB-50sv bombs (100 kg total)\n* 6 x RS-82 rockets\n* 6 x RBS-82 rockets\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n'''Realistic''':\n\nThis is a classic turn fighter. It can outmanoeuvre anything in the sky at its BR, so the main tactic is tricking the enemy into a turn fight. You have to come close to the enemy because you only have [[ShKAS (7.62 mm)|MG-s]], but when you get close the ShKAS machine gun spews 1,800 rpm so even though it's a small calibre for aircraft it does the job. You can also take rockets to destroy stray bombers from a distance, or destroy ground targets with rockets and bombs. If you must destroy AAA, get low to the ground, pull up at the last minute and fire away. The pilot is vulnerable to AAA fire.\n\nIn realistic battles the I-16 type 17 shares a similar playstyle as its predecessors, which is turnfighting. Start off the match by climbing between 10-17 degrees to gain altitude. Although this is not a real BnZ fighter, getting some altitude will still grant you many opportunities.\n\nYour biggest threat when flying the I-16 Type 24 comes from pretty much any fighter aircraft at this BR, since they all have a significant top speed/climb rate advantage (such as Ki-43 and Bf 109 F). A common scenario you will encounter is, you will see those planes higher than you before an engagement due to your inferior climb rate. They will always try to BnZ you, while your only effective tactic is to evade their dives and bleed their energy. Bank towards your teammates and keep climbing with WEP. As the enemy starts diving on you, wait until the distance closes to ~0.9 km, then use your great roll rate and turn rate, suddenly roll to one side and dodge under the attacker. This will usually force them to either shoot at an awkward position and miss (usually), or they will relinquish the pass and pull up. Some enemies might lose patience after a few successful dodges and chase you rather than zooming away to try and destroy you. Now again utilise your agility to perform horizontal manoeuvres such as scissors, in a combination of short vertical movements such as Immelmanns and chandelles, to force an overshoot or to get on their tail. With careful aiming, the 4 ShKAS MGs will quickly cripple a fighter.\n\nDo not try to out-dive any monoplane as the I-16's light weight means that it is relatively slow at building up speed in a dive and also causes it to have lacklustre energy retention. However some short dives will gather you speed for more manoeuvres, or drag enemy BnZ planes to the deck. Once they are low, it is rather easy to out-manoeuvre them.\n\nWhen confronting slower but more manoeuvrable planes such as Ki-27, energy tactics like BnZ are to be favoured over turning and burning. When you do not have altitude advantage over the Ki-27, the use of rolls is the most desired if not a nigh obligatory form of evasion. There is minimal chance to turn out or outrun the Ki-27, but you can out-roll it, particularly at high speeds. On the other hand, zoom climbs are a bit of a mixed bag. While the I-16 sometimes can get away with it through its superior power-to-weight ratio, the Ki-27 has a much lower stall speed which sometimes allows it to stay all the way through the zoom climb with I-16.\n\nThe I-16 is not a very effective interceptor, not being much faster than most monoplane bombers in its rank while having both a rather weak armament and protection.\n\n'''Simulator:'''\n\nThe I-16 can be used in turnfighting, bomber intercepting and ground pounding. However in this mode, its characteristics appear to be quite conflicting. It is excellent in turning tightly and continuously, yet when manoeuvring it easily gets into uncontrollable spins which isn't beginner friendly. Also the rather big nose blocks the visibility a lot, offering very poor over-the-nose visibility which is a disadvantage in a turn fight, because when leading a shot the enemy will always get obstructed by the engine, making the player guess the shot. More ever, there is no trim control available in a sim battle and the I-16 always pitch up and down. Although not a lot, it is still annoying when trying to get a precise aim.\n\nIt is recommended to set the convergence within 300 m, with vertical convergence on, because the majority of turnfights happen at that range or closer.\n\nUnlike Realistic, Sim requires long-range flying so discard the habit of bringing the least fuel. Bring at least 30 minutes of fuel, although it decreases the plane's performance a bit, it prevents constant refuelling which saves time for patrolling and fighting.\n\nAs your I-16 roars down the runway, you will notice that it shifts severely to the side, and the nose will tip down. If you don't correct it the propeller will eventually strike the ground, causing a failed takeoff. Thus you must put rudder input as opposed to the side it's shifting towards, and apply positive pitch to keep the propeller off the ground. You do not want to use flaps anywhere except takeoff and landing, since they are very weak and will rip at more than 260 km/h, while the average speed during a battle tends to be around 300 km/h. Once one or both flaps are gone it creates an imbalance in the roll axis, making spins more common. It also makes landing harder.\n\nBefore engaging a fight, it is better to have an altitude advantage first. When approaching the fight try to figure out which is your teammate and which is the enemy, to avoid going for a second pass, as the energy retention of the I-16 is rather slow. Also pick your target carefully. For easier aiming, you want to go for those unmanoeuvrable twin engine aircraft like [[Ju 88 (Family)|Ju 88]] or [[Ki-45 (Family)|Ki-45]], or bombers if there are any. Given the bad forward visibility of the I-16, these are the best options as they are quite slow and sluggish, and are a bigger target to hit. However getting hits on them tend to do little work, as your MGs lack damage. When dealing with fighters, it is way harder to aim. The elevator control of the I-16 is extremely sensitive, giving it good manoeuvrability, but at the same time, bad handling. The I-16 will respond in a very fast turn upon moving your stick / mouse by a little bit, which makes tracking nimble planes quite hard. But once you get used to it, try to lure every enemy into a turnfight, as that is where the I-16 shines. Quite a bit of bullets are required to effectively damage the enemy so you must be patient. If you find an enemy at your 6, utilise your great roll rate to do defensive manoeuvres like scissors to make them overshoot. Or you can simply do tight turns, most monoplanes won't be able to cut inside your turn and they might disengage. Important note: DO NOT put too much rolling and pitching input at once, as aforementioned the I-16 tend to enter spins easily.\n\nIf you are not very experienced in sim, you can also go for even bigger targets (bombers) for easier aiming. However you want to be more careful when hunting bombers, since with the Sim control (whether it be mouse joystick or a real stick) the plane will manoeuvre much more gently, making itself a great target for the bomber's gunners. DO NOT follow behind a bomber's 6 unless you are sure that its tail gunners are unconscious. Chasing behind a bomber makes yourself stationary for the tail gunners, and you will be showered with bullets. Your big radial engine will usually get damaged. Instead, before attacking, get an altitude advantage over the bomber by flying around 2 km above it. The bomber should only fill up about 1/6 of your gunsight. The best position for an attack is at the bomber's high 6 so you can adjust the lead much easier. Dive at the bomber, but not directly at it, try to predict where you two will crash by imagining yourself as a missile, that's where you should aim at (deflection shooting). To maximise the damage it is better to aim for their wings and engines, as the fuselage usually soaks up quite some bullets. Only fire when the bomber passes in front of your guns. This short window might seem inadequate to do anything, but with a accurate burst on the engine the 4 MG can at least damage it. With an engine damaged most bombers cannot go far.\n\nAlthough ground pounding ability is limited, there are still bombs and rockets to choose from. The 2 bombs can effectively destroy pillboxes or tanks while the rockets, with accurate aiming, can destroy 3 targets. Once the suspended armaments are gone, the 4 MG are good for soft targets like trucks, artillery and AA cars.\n\nJust like the SB 2M, the I-16 can still fly when it's extremely slow, causing it to bounce up during landing which can lead to a fatal crash. The trick is similar: slow it down more than other aircraft. Make sure you are around 1 km from the start of the runway and is no more than 300 m high. When the runway fills up your gunsight, drop speed to around 210 km/h and deploy landing flaps. The good thing is, the I-16 will not pitch up drastically upon using its flaps so you don't need to counter the extra lift. Make sure that you extend landing gears early as they move very slow (takes around 15 seconds to deploy). When you are about to touch down you should be flying at around 140 km/h. You must control your rate of descent (I-16's gears are fragile) and make sure that you are slightly pitching upwards with the nose obstructing the horizon. This way the I-16 should land gently without having to brake for too long. Once you are sliding on the ground, fully deflect your elevators upwards to counter the momentum that can push the nose into the ground. You must release brakes once every 4 seconds, because if you only release them as the nose dips down, it's too late.\n\n'''Enemies worth noting:'''\n\n[[Ki-27 otsu|Ki-27]], [[N1K1]], [[He 51 (Family)|He 51]], [[Gladiator (Family)|Gladiator]], etc. - Those commonly seen planes are equally good at turnfights and will be a hard target to down since they are very small and agile. To deal with them you need to practice leading and deflection shots, plus manoeuvres like barrel rolls and scissors. They need lots of bullets to get damaged so you have to be patient.\n\n[[He 111 H-6]] - This bomber is not only quite durable, but also pretty fast. In level flight it can outrun the I-16 rather easily. Avoid being on its 6 as it will have at least 2 x 7.92 mm MG facing its tail, and their rapid rate of fire and good penetration is a big threat. Either go for a head-on or use deflection shooting and aim for its engines. If you cannot keep up with it, disengage. If it flies way higher than you, change your target.\n\n[[Sunderland Mk IIIa]] - This flying boat's huge fuselage is very spacious and can absorb lots of bullets and shells. It also has lethal defensive firepower: two 7.7mm in the nose, four forward-facing, two on the top and four at the tail, so attacking from behind, in front or above aren't the best options. Dive under it and suddenly pull up to shoot its defenseless underpart. Aim at the large wings and engines, avoid shooting the fuselage.\n\n[[He 100 D-1|He 100]], [[Bf 109 E-1|Bf 109 E]] / F, [[A6M2]] - These planes might not be able to out-turn the I-16, but they can easily outrun it as the I-16 is very slow. These fighters will usually BnZ you, so you must constantly look above and behind you. If they are diving on you, do what you do in realistic: use your roll rate and dodge under their negative G areas. Most players will try to follow up, if not immediately losing track of you. Several dodges might make them impatient and if they really start to turn with you, they are already dead.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Not controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Combined || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent turning ability- with combat flaps deployed it can out-turn any Bf 109, Fw 190 A and even turn-fighters like the [[Spitfire (Family)|Spitfire]]\n* Extreme roll rate allows it to do offensive/defensive scissors easily, which is an advantage over Bf 109s and [[Spitfire (Family)|Spitfire]] as their roll rates aren't as good.\n* 4 x ShKAS machine guns with good fire rate, adequate velocity and accuracy, and plenty of ammo (1,300 rounds total) for longer battles\n* Suspended armament provides rockets and bombs, which, to some extent, allows some ground attack ability.\n* Is a very short and small plane, offering the enemy a harder target to hit.\n\n'''Cons:'''\n\n* Extremely poor level speed, climb rate, dive acceleration and energy retention- will get outran, out-climbed and out-dived easily by Bf 109 E/F, Fw 190 A or [[A6M2]]\n* Engine tends to overheat when diving at more than 500 km/h\n* Control surfaces are unresponsive over 450 km/h\n* Flaps are very weak and will break over 250 km/h, severely limiting its sharp-turning potential at higher speeds\n* Hard to fly in SB -- very unstable in pitch, no manual trim controls, poor over-the-nose visibility and is prone to enter flat spins\n* Although manoeuvrable, it can still get out-turned by some Japanese turn-fighters\n\n== History ==\n''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).''\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=i-16_type24 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|WLDF6CHZ9N0|'''I-16 Type 24 & He 112 B-0 - Realistic Battle''' - ''MagzTV''|ivPRwWaEmSc|'''Polikarpov I-16 Type 24 \"Rata\"''' - ''Flying Heritage & Combat Armor Museum''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n* [[I-16 (Family)]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n;War Thunder Forums:\n* [https://forum.warthunder.com/index.php?/topic/520556-i-16-type-24-28/ Official data sheet - more details about the performance]\n\n;Other websites:\n* [http://www.aviation-history.com/polikarpov/i16.html [The Aviation History Online Museum<nowiki>]</nowiki> Polikarpov I-16] ([https://web.archive.org/web/20210511223052/http://www.aviation-history.com/polikarpov/i16.html Web Archive])\n* [https://flyingheritage.org/Explore/The-Collection/Russia/Polikarpov-I-16-Type-24-(Rata).aspx [Flying Heritage<nowiki>]</nowiki> Polikarpov I-16 Type 24 \"Rata\"] ([https://web.archive.org/web/20210511222922/https://flyingheritage.org/Explore/The-Collection/Russia/Polikarpov-I-16-Type-24-%28Rata%29.aspx Web Archive])\n* [https://www.globalsecurity.org/military/world/russia/i-16.htm [Global Security<nowiki>]</nowiki> Polikarpov I-16 Type 24 Tactical fighter] ([https://web.archive.org/web/20210511223011/https://www.globalsecurity.org/military/world/russia/i-16.htm Web Archive])\n\n{{AirManufacturer Polikarpov}}\n{{USSR fighters}}"}}