{"title":"I-16 type 5","pageid":333,"wikitext":{"*":"{{About\n| about = Soviet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = I-16 (Family)\n}}\n{{Specs-Card\n|code=i-16_type5\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Soviet fighter {{Battle-rating}}. It was introduced in [[Update 1.43]].\n\nThe I-16 Type 5 is the earliest instalment of the Polikarpov I-16 family available in the game. A rather solid if somewhat temperamental pre-war fighter that, while extremely dangerous if used right against biplanes and other pre-war fighters, can get in quite a struggle to deal with later aircraft such as the [[Ki-43-I]] and the [[Hurricane (Family)|Hurricane]], and being wholly outmatched by aircraft like the [[Spitfire Mk Ia]] and the [[Bf 109 E-1]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 2,700 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 428 || 408 || rowspan=\"2\" | {{Specs|ceiling}} || 15.9 || 16.5 || 14.6 || 14.6 || rowspan=\"2\" | 210\n|-\n! Upgraded\n| 467 || 445 || 14.1 || 15.0 || 23.7 || 18.5\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 700 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || 700 || 700 || 700 || ~14 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 300 || < 320 || < 320 || > 190\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* No armour\n* Self-sealing fuel tanks (1 in front of pilot)\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|ShKAS (7.62 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 7.62 mm ShKAS machine guns, wing-mounted (900 rpg = 1,800 total)\n\nThe I-16 Type 5 is equipped with two wing-mounted ShKAS machine guns chambered with the 7.62 x 54R cartridge, a cyclic rate of fire of 1,800 rpm and with an ammo loadout of 900 rounds each.\n\nSince both machine guns are mounted pretty far apart, they are more effective at convergence range which, being rifle calibre machine guns should be set to a relatively low distance (from 150 to 400 m). The weapons have a rather standard firing time of 30 seconds and had a very high throw for a rifle calibre machine gun due to its very high rate of fire. This particular feature makes overheating a pretty big problem, so it is recommended to fire the weapons in short burst since the jamming of one of them would result in the loss of half of the aircraft's effective armament. It's also of note, particularly in Simulator Battles, that the I-16 Type 5 modelled in-game is fitted with the original-for-the-type enclosed cockpit and OP-1 telescopic sight which may prove problematic for players who are not fond of telescopic sights for aiming. The I-16 Type 5 low weight, high roll rate and somewhat unstable centre of gravity make it a slightly inaccurate gun platform, though its high roll rate and pressure of fire somewhat mitigates its effects.\n\nAs for the armament effectiveness it can be considered of moderate power against most fighter aircraft at its rank, it can be quite complicated to kill an enemy in a single glancing attack and sometimes it would take quite a bit of time to finish a particularly resilient foe, incendiary ammunition or Stealth belts can be very helpful for boosting the lethality of the planes armament. Against bombers however, the armament loses a lot of its effectiveness with only shots to the pilot's cockpit or the engines proving somewhat effective and even then normally taking several hundreds of bullets to bring them down.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe I-16 Type 5's biggest asset is its versatility. This aircraft is considerably faster than most biplanes which allows it to use superior speed (both in level flight and in dives) and energy to engage them safely, while at the same time it can outmanoeuvre a lot of its faster opponents if not by turn rate at least by using its breakneck roll rate. It also has a significantly fast climb-rate of over 14 m/s to up to 3,000 m which is only beaten at its battle rating by [[Bf 109 E-1]]/[[Bf 109 F-1|F-1s]], [[Spitfire Mk Ia|Spitfire Mk Is]] and by the [[Ki-27 otsu|Ki-27]]/[[Ki-43-I|43]]/[[Ki-44-I|44]]. As previously mentioned the plane has a phenomenal roll rate of up to 150°/s. On the other hand, the roll rate can under some circumstances cause the plane to lose control, particularly while performing high G pull ups after recovering on a dive which in some circumstances may prove fatal.\n\nWhen confronting slower but more manoeuvrable planes, energy tactics are to be favoured over turning and burning, in contrast when facing faster monoplanes the use of horizontal manoeuvres, particularly the use of scissors due to the aircraft rapid roll rate in a combination of short vertical movements such as Immelmanns and chandelles. While the plane's light weight means that it is relatively slow at building up speed in a dive and also causes it to have lacklustre energy retention for a monoplane. Even though pairing this aircraft with a rather powerful engine helps to alleviate this shortfall, the aircraft can initially out-accelerate planes which otherwise outperform it in the speed department.\n\nYour biggest threat when flying the I-16 Type 5 comes from aircraft with a significant top speed advantage (like the previously mentioned  [[Spitfire Mk Ia]] and [[Bf 109 E-1]]) as well as from low rank Japanese monoplanes. Against the former your best chance is to use defensive tactics and hope that they make a mistake or an ally comes to your aid, rolling scissors and sudden changes of direction through rolling the plane axis are the most effective evasive manoeuvres for this particular plane. Against the latter, the tactic would depend on the specific model you encounter. When flying against the Ki-27, the use of rolls is the most desired if not a nigh obligatory form of evasion. There is minimal chance to turn out or outrun the Ki-27, but you can out-roll it, particularly at high speeds. On the other hand, zoom climbs are a bit of a mixed bag. While the Type 5 sometimes can get away with it through its superior power-to-weight ratio, the Ki-27 has a much lower stall speed which sometimes allows it to stay all the way through the zoom climb with early I-16s (later, heavier variants of the plane are more effective at using this tactic). Against the Ki-43 things become quite complicated since the Ki-43-I and the Type 5 are pretty well matched in roll rate (where the latter has a slight advantage) and turn rate (where the former has a slight edge), a combination of turns and rolls is the best way to evade the Ki-43s though it has to be done carefully in order to be effective, the latter Ki-43-II with its considerably higher top speed but reduced manoeuvrability is confronted more effectively by use of horizontal manoeuvres while trying to prevent it from reaching high rates that would allow it to use energy tactics against you.\n\nThe I-16 Type 5 is not a very effective interceptor, not being much faster than most monoplane bombers in its rank while having both a rather weak armament and protection.\n\n'''Simulator Battles:'''\n\nThis model of I-16 can only be used in turnfighting. Its characteristics appear to be quite conflicting. It is excellent in turning tightly and continuously, yet when manoeuvring it easily gets into uncontrollable spins which isn't beginner friendly. Also the rather big nose blocks the visibility a lot, offering very poor over-the-nose visibility which is a disadvantage in a turn fight, because when leading a shot the enemy will always get obstructed by the engine, making you guess the shot. Plus, it has an awful telescope-like gunsight, so when zoomed in the I-16's nimbleness is magnified, making the aim super wobbly. You cannot see anything around which greatly reduces you situational awareness. More ever, there is no trim control available in a sim battle and the I-16 always pitch up and down. Although not a lot, it is still annoying when trying to get a precise aim.\n\nIt is recommended to set the convergence within 300 m, with vertical convergence on, because the majority of turnfights happen at that range or closer. Also, in a turnfight you must get used to shooting without zooming in, as you really can't see anything with its awkward scope when zoomed it. However when tailing a straight-flying plane that scope doesn't seem that bad.\n\nSim is different from Realistic, so discard the habit of bringing the least fuel. Bring at least 30 minutes of fuel, although it decreases the plane's performance a bit, it prevents constant refuelling which saves time for patrolling and fighting.\n\nAs your I-16 roars down the runway, you will notice that it shifts severely to the side, and the nose will tip down. If you don't correct it it will eventually strike the ground, causing a failed takeoff. Thus you must put rudder input as opposed to the side it's shifting towards, and apply positive pitch to keep the propeller off the ground. You do not want to use flaps anywhere except takeoff and landing, since they are very weak and will rip at more than 260 km/h, while the average speed during a battle tends to be around 300 km/h. Once one or both flaps are gone it creates an imbalance in the roll axis, making spins more common. It also makes landing harder.\n\nBefore engaging a fight, it is better to have an altitude advantage first. When approaching the fight try to figure out which is your teammate and which is the enemy, to avoid going for a second pass, as the energy retention of the I-16 is rather slow. Also pick your target carefully. For easier aiming, you want to go for those unmanoeuvrable twin engine aircraft like [[Ju 88 (Family)|Ju 88]] or [[Ki-45 (Family)|Ki-45]], or bombers if there are any. Given the bad forward visibility of the I-16, these are the best options as they are quite slow and sluggish, and are a bigger target to hit. However getting hits on them tend to do nothing, as your MG has very bad damage. When dealing with fighters, it is way harder to aim. The elevator control of the I-16 is extremely sensitive, giving it good manoeuvrability, but at the same time, bad handling. The I-16 will respond in a very fast turn upon moving your stick/mouse by a little bit, which makes tracking nimble planes quite hard. But once you get used to it, try to lure every enemy into a turnfight, as that is where the I-16 shines. It requires lots of bullets to effectively damage even a fighter, so you have to be patient with this aircraft. If you find an enemy at your 6, utilise your great roll rate to do defensive manoeuvres like scissors to make them overshoot. Or you can simply do tight turns, most monoplanes won't be able to cut inside your turn and they might disengage. Important note: DO NOT put too much rolling and pitching input at once, as aforementioned the I-16 tend to enter spins easily.\n\nJust like the SB 2M, the I-16 can still fly when it's extremely slow, causing it to bounce up during landing which can lead to a fatal crash. The trick is similar: slow it down more than other aircraft. Make sure you are around 1 km from the start of the runway and is no more than 300 m high. When the runway fills up your gunsight, drop speed to around 210 km/h and deploy landing flaps. The good thing is, the I-16 will not pitch up drastically upon using its flaps so you don't need to counter the extra lift. Make sure that you extend landing gears early as they move very slow (takes around 15 seconds to deploy). When you are about to touch down you should be flying at around 140 km/h. You must control your rate of descent (I-16's gears are fragile) and make sure that you are slightly pitching upwards with the nose obstructing the horizon. This way the I-16 should land gently without having to brake for too long. Once you are sliding on the ground, fully deflect your elevators upwards to counter the momentum that can push the nose into the ground. You must release brakes once every 4 seconds, because if you only release them as the nose dips down, it's too late.\n\n'''Enemies worth noting:'''\n\n* [[Ki-27 otsu|Ki-27]], [[N1K1]], [[He 51 (Family)|He 51]], [[Gladiator (Family)|Gladiator]]: those commonly seen planes are equally good at turnfights and will be a hard target to down since they are very small and agile. To deal with them you need to practice leading and deflection shots, plus manoeuvres like barrel rolls and scissors. They need lots of bullets to get damaged so you have to be patient.\n\n* [[He 111 H-6]]: this bomber is not only quite durable, but also pretty fast. In level flight it can outrun the I-16 rather easily. Avoid being on its 6 as it will have at least 2x 7.92 mm MG facing its tail, and their rapid rate of fire and good penetration is a big threat. Either go for a head-on or use deflection shooting and aim for its engines. If you cannot keep up with it, disengage. If it flies way higher than you, change your target.\n\n* [[Sunderland Mk IIIa]]: this flying boat is like a low-tier [[Be-6]]. Its huge fuselage is very spacious and can absorb lots of bullets and shells. It also has lethal defensive firepower: two 7.7mm in the nose, four forward-facing, two on the top and four at the tail, so attacking from behind, in front or above aren't the best options. Dive under it and suddenly pull up to shoot its defenceless underpart. Aim at the large wings and engines, avoid shooting the fuselage.\n\n* [[He 100 D-1|He 100]], [[Bf 109 E-1|Bf 109 E]]/[[Bf 109 F-1|F]], [[A6M2]]: these planes might not be able to out-turn the I-16, but they can easily outrun it as the I-16 is very slow. These fighters will usually perform Boom-and-Zoom attacks, so you must constantly look above and behind you. If they are diving on you, do what you do in realistic: use your roll rate and dodge under their negative G areas. Most players will try to follow up, if not immediately losing track of you. Several dodges might make them impatient and if they really start to turn with you, they are already dead.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Not controllable<br>Not auto controlled || Not controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Combined || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent turning ability - with combat flaps deployed it can out-turn any [[Bf 109 (Family)|Bf 109]] and even turn-fighters like the [[Spitfire (Family)|Spitfire]]\n* Extreme roll rate allows it to do offensive/defensive scissors easily, which is an advantage over Bf 109 and [[Spitfire (Family)|Spitfire]] as their roll rates aren't as good\n* 2 x ShKAS machine guns have good fire rate, adequate velocity and accuracy, and plenty of ammo for longer fights\n* Suspended armament provides rockets and bombs which, to an extent, allows some ground attack ability\n* Very short and small plane, offering the enemy a harder target to hit\n\n'''Cons:'''\n\n* Extremely poor level speed, climb rate, dive acceleration and energy retention- will get outran, out-climbed and out-dived easily by Bf 109 E, [[He 100 D-1|He 100]], and can even struggle to keep up with bombers like [[He 111 (Family)|He 111]]\n* Engine tends to overheat when diving at more than 500 km/h\n* Control surfaces are unresponsive over 450 km/h\n* Flaps are very weak and will break over 250 km/h, severely limiting its sharp-turning potential at higher speeds\n* Hard to fly in SB -- very unstable in pitch, no manual trim controls, poor over-the-nose visibility and is prone to enter flat spins\n* Although manoeuvrable, it can still get out-turned by the [[Ki-10 (Family)|Ki-10]] or biplanes like [[He 51 (Family)|He-51]]\n* 2 x 7.62 machine guns are not the best armament for its rank\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nDevelopment which started from the early I-16 Type 4, the I-16 Type 5 was the first version of the I-16 to incorporate the M-25 engine (which produced 700 HP in contrast with the previous M-22 engine that produced just 480 HP) and receiving ShKAS machine guns in place of Type 4's slower firing PV-1s. Testing of the new power-plant in the I-16 airframe started in October 1935 with serial production of the aircraft starting in early 1936 and continued up to late 1937. Throughout its production, several changes were done to the production model based on feedback obtained by the operational and combat experience through 1936-1937, most notably the removal of the sliding canopy in favour of an open cockpit and the addition of the PAK-1 reflector sight in place of the older OP-1 telescopic sight. It was substituted in production by the I-16 Type 10 and by that time over 2,000 units were produced.\n\nBy mid 1936 the I-16 Type 5 had just begun to be put into service with several units of the VVS when the Spanish Civil War broke out. After receiving an economic loan from the Spanish Republican government, the Soviet Union started to supply the government forces with war equipment and resources to oppose the fascist supported Nationalist. The first batch of I-16 Type 5s were deployed in November 1936. The I-16 Type 5 would soon prove to be a formidable aircraft being easily able to intercept the Ju-52 utility/bomber aircraft while proving superior to the German He-51s deployed by the Condor Legion. At the time only the Italian built Cr.32 stood a chance against the Soviet monoplane fighter due to its superior armament, manoeuvrability and its excellent dive performance and stability for biplane standards, the Republican Air Force would soon start to refer to them as \"Moscas\" (Fly, though the nickname may actually have derived from Москва, the spelling of Moscow in cyrillic script) while the Nationalists nicknamed it the \"Rata\" (Rat). The I-16 Type 5 did however show some issues including limited cockpit visibility, unreliable armament and a tendency to suffer structural damage when flying at high speeds. While some of this issues were ironed out later on, the I-16 would remain a rather challenging aircraft to fly due to its relatively high take-off and landing speed and its subpar stability, making the aircraft quite prone to stalls and flat spins.\n\nBy 1937 the Condor Legion started to deploy the first models of Jumo powered Bf 109s as well as the first variants of high-performance levels bombers including the Ju-86, He-111 and the Do-17. The early Jumo powered 109s and the I-16 Type 5 were well matched, with the Bf 109 B having a slight advantage in top speed, high altitude performance and dive performance, while the I-16 boasted superior manoeuvrability, power to weight ratio and climb-rate up to medium attitudes. Both aircraft had comparable armament which generally consisted of two rifle calibre machine guns, although both types sometimes sport a third machine gun. Although superseded by the I-16 Type 10 by 1938 some models of the Type 5 variation would stay in operational service until the end of the Spanish Civil War and would remain operational service by the Spanish Air Force up to 1953.\n\nThe I-16 Type 5 also played a crucial role during the initial stages of both the battle of Khalkhin Gol and the Winter War, by the time the aircraft had started to show its age and were generally considered inferior to the Ki-27 fielded by the IJAAF in the former conflict and, while its performance was more evenly matched with that of the [[Fokker D.XXI]] and superior to most other types fielded by the Finnish Air Force, the attrition rates in the later engagement were still high. In both conflicts, the Type 5 was later complemented or partially replaced with the later Type 10 and Type 17 (as well as a few Type 18s during the Winter War) which would prove to be more effective against the opposing aircraft. The Type 5 was still in service with the VVS at the start of the Great Patriotic War in the Summer of 1941, with many of them being captured or destroyed during the opening weeks of Operation Barbarossa. Most Type 5s that survived the initial onslaught were quickly withdrawn in favour of newer models of fighter aircraft like the Yak-1 and LaGG-3 as well as later and more powerful variants of the I-16.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=i-16_type5 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n* [[P-26 (Family)]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/520551-i-16-type-5/ Official data sheet - more details about the performance]\n* [http://www.airpages.ru/eng/ru/i16_5.shtml Aviation of WWII: I-16 type 5]\n\n{{AirManufacturer Polikarpov}}\n{{USSR fighters}}"}}