{"title":"I-29","pageid":367,"wikitext":{"*":"{{Specs-Card\n|code=i_29\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_i_29.jpg\n|market=I-29 (USSR)\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} Soviet twin-engine fighter {{Battle-rating}}. It was introduced during [[Update 1.73 \"Vive la France\"]] as part of a reward vehicle for [[wt:en/news/5066-special-war-thunder-5-years-en|War Thunder's 5th anniversary]] mini-event.\n\nThe I-29 is an excellent high-speed twin-engine heavy fighter produced by the Yakovlev Design Bureau. This aircraft was developed during the pre-war years and had many promising innovations.\n\nThis aircraft is rare, making it highly prized for both collectors and pilots, as the plane could only be obtained during War Thunder's 5th anniversary.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nIf you think that a \"big plane\" means a \"slow plane\", the I-29 is a great contender to prove otherwise. The heavy fighter aircraft boasts two 12-cylinder V-shaped Klimov M-105PA engines, water cooled and each outputting 1,100 horsepower. For a wooden plane weighing just under 4 tons, it's an almost unstoppable force. In good conditions, these engines will not overheat. Even with constant {{Annotation|WEP|War Emergency Power}} applied, their temperature stabilises at 110–111°C. WEP ceases to operate at an altitude of ~3,500 m. In the event of a prolonged negative overload, the engines will experience fuel starvation which will affect flight performance. Both engines run clockwise, resulting in the aircraft having a tendency to pull to the right.\n\nFor this heavy fighter to remain as light as possible, it is recommended to head into battle with the minimum amount of fuel for a typical battle. Due to its power from the dual V-12 engines, the I-29 accelerates amazingly in horizontal flight, reaching a nominal 567 km/h and also climbs quite well in the vertical, especially with a WEP boost. Along with being an excellent climber, this aircraft is a fantastic diver. Utilising the combination of aircraft weight and the power of its engines, the I-29 can easily reach its speed limit of ~720 km/h, after which the wooden wings simply cannot stand up to external forces and will rip off. When the {{Annotation|IAS|Indicated Air Speed}} of the aircraft reaches about 700 km/h, the control surfaces of the aircraft stiffen and become noticeably \"woody\", making it extremely difficult to manoeuvre effectively.\n\nThe I-29, while being listed as a \"heavy fighter\", definitely has a wing structure built for speed. The total wing area is only 29.4 square metres and the wingspan is all of 14 m in length. On a side note: the plane seems to lazily roll from wing to wing, but don't let this deceive you into thinking it flies like a heavy bomber. On the contrary, the turn time for this aircraft is just under 21 seconds, which is superior to many aircraft of this battle rating, especially for the heavy fighter types.\n\nThe I-29 can successfully manoeuvre against the [[P-38E|P-38]], [[Do 217 J-1|Do 217]], [[Firefly F Mk I|Firefly]], [[Beaufighter Mk VIc|Beaufighter]], [[Ki-45 (Family)|Ki-45]] and other heavy fighters as well as many attack planes and even some fighters which surpass this aircraft's BR. This aircraft is equipped with wing flaps, however there are only two positions, retracted and landing. You should note when flying in RB or SB, surpassing 350 km/h with your flaps extended in the landing position will cause them to to be ripped from the wings, so be careful when they are extended. In AB, this warning is irrelevant and the flaps will remain intact even if you pass the 350 km/h threshold. Having flaps extended when manoeuvring with energy and then immediately retracting them, aerodynamic forces at work will instantly turn you into a super-manoeuvrable aircraft. It is worth noting that another excellent feature of the aircraft is that it is difficult to stall, even if you fully reduce your throttle to idle. Due to the particular type of tail structure found on this aircraft, the rudders are very responsive to control stick movements.\n\n[[File:I29CockpitOverview.jpg|250px|left|thumb|Cockpit of the I-29]]\n\nAnother nice part of the aircraft is the cockpit itself, which is very spacious and perfectly detailed. There is a slight problem when it comes to visibility through the rear hemisphere of the aircraft due to design features and slightly humped structure of the aircraft which will block some of the pilot's view. We can make a general conclusion about the controllability of the aircraft in combat conditions and when flying from the cockpit view, we can safely say that tracking, engaging a target and keeping it within the cross-hairs of the targeting sight is easier than ever. Remember to watch the aircraft's speed and do not abuse it. The plane is very stable and will obediently hold its course. Reactive moments do not disturb normal flight when flying in a straight line and at speeds set above 300 km/h, the reactive moment is almost imperceptible even at full WEP boost.\n\n;Take-off and Climb\nThe I-29 has an excellent climb rate of 15 m/s for its combat rating. Even with the status of \"heavy fighter\", this does not prevent us from finding ourselves on the battlefield with an equal footing at all heights, if not better than many of the enemy aircraft you will come up against.\n\nDuring the take-off process (RB/SB – even AB if you had to land to repair), begin to accelerate your aircraft down the runway. While accelerating, set the climb angle for 10 degrees. At this point you should have WEP engaged to give you an extra boost. As it was said earlier, the engines continue to operate at a moderate temperature and the WEP will automatically shut itself off upon reaching ~3,500 m. After a short acceleration, the aircraft will reach approximately 180 km/h and at that point the plane will smoothly come off the runway. At this point, retract landing gear and flaps. Continue to climb and aim to reach a speed of 280 km/h, at that point, safely set the angle of ascent to ~18-20 degrees. Here you will now want to stick your climbing speed somewhere between 270-280 km/h. Upon reaching a height of 2,200-2,300 m, your speed will slowly begin to decrease, so gradually reduce the angle of ascent down to 15-16 degrees. By sticking to these simple instructions, you will reach a height of 3 km in about 2:30 minutes; 4 km in 3:30 minutes; and you should reach 5 km at about the 4:20 seconds mark.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 5,200 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 537 || 519 || rowspan=\"2\" | {{Specs|ceiling}} || 21.9 || 22.5 || 11.7 || 11.7 || rowspan=\"2\" | 340\n|-\n! Upgraded\n| 578 || 556 || 20.1 || 21.0 || 18.9 || 15.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| X || X || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || N/A || N/A || 280 || ~17 || ~10\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 360 || < 360 || < 450 || > 340\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n[[File:I29Tanks.jpg|190px|thumb|Protected Fuel Tanks]]\nThe I-29 has very good survivability. This aircraft has four protected fuel tanks which sit both behind the pilot and also in both wings. Do not forget that the plane is mostly made of wood and with that as a fact, it will burn very well. Head-on duels against well-armed enemies is highly discouraged, unless you are a pro at getting your shots off and manoeuvring out of the way of oncoming bullets. Even though you have something to counter in a frontal attack, you must take care because even a stray incendiary bullet can send you down in flames.\n\nThe engines are quite tenacious and work remarkably well without oil or water for a very long time, however they can be successfully disabled by an exacting line of fire from an enemy aircraft. The plane can fly more or less on one engine, however without both engines your powerful heavy-fighter quickly becomes a weak heavy-glider heading to the ground. If this happens, it may be possible for you to glide to a nearby friendly airfield for repairs. Take care of your engines and do not subject them unnecessarily to enemy fire.\n\n[[File:I29Armor.jpg|190px|thumb|Protective armour]]\nIn regards to the armour in the aircraft, we have a 12.7 mm steel sheet in the nose of the aircraft and steel armour plating behind the pilot of the same thickness. Even with the nose plating, it does not provide a good enough reason to attempt a head-on attack. The most significant armour in the aircraft is the \"armoured glass\" which has a thickness of 60 mm, located directly behind the pilot's armoured back, which simply isolates the pilot from attacks of even large-calibre weapons from the rear. It is worth noting once again that this aircraft is a wooden structure and gas tanks are located right behind the bulletproof glass (and also located in the rear engine nacelles there is the very important water cooling system for the engines). So, you should not solely count on protection of the pilot. The pilot may survive an encounter with an enemy plane, but the plane can still go down on fire leaking water and oil. Better to watch out and fight on your terms rather than letting the enemy get the drop on you!\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|ShVAK (20 mm)|ShKAS (7.62 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 20 mm ShVAK cannons, chin-mounted (120 rpg = 240 total)\n* 1 x 7.62 mm ShKAS machine guns, nose-mounted (900 rpg)\n* 2 x 7.62 mm ShKAS machine guns, wing-mounted (900 rpg = 1,800 total)\n\nThe aircraft has two types of weapons: There are the 3 x 7.62 mm ShKAS machine guns with 900 rpg or 2,700 total rounds and 2 x 20 mm ShVAK cannons with 120 rpg equalling a total of 240  cannon shells. With the famous rate of fire of both types of weapons, the small ammo count of the latter itself suggests a recommendation: use this small ammo pool wisely. With a fire rate of 800 shots per minute, just holding the trigger down for 18 seconds will wipe out all of your ammo with cannon rounds ending first. Both 20 mm cannons are installed under the fuselage of the aircraft, which provides excellent accuracy (you don't need to account for convergence with these guns). The 7.62 mm machine guns on the other hand are split up in their installed locations: one is placed in the nose of the aircraft and one each machine gun is mounted in the camber of each engine. Such a destructive combination gives tremendous accuracy of shooting and a volley of 3.43 kg. The optimal convergence range for all of these weapons will be 400 - 600 m.\n\nWhile the cannons have a very small ammo pool to work with, all it requires is one or two well aimed and controlled bursts, which will be more than enough to tear the enemy's plane to shreds. Since the ballistics of the two different weapons can be a challenge to line up, the primary attack should come from the \"six\" of the enemy aircraft and preferably not while in a turn. This strategy will help conserve your ammo pool and stretch it to a greater number of enemies without having to wait for a reload or fly back to the airfield to resupply.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nOn this plane there is an interesting remark: the \"Instructor\" does not work well with the yaw axis (as if it lacks traction, which is objectively not the case) especially when aiming at the target and the plane wants to constantly rolls over on its side and it becomes difficult to keep site of an enemy when in a turn. You will need to keep this in mind and make adjustments if you enter this kind of manoeuvre, however you can counteract much of this issue by utilising the control keys on the keyboard for the ailerons to help balance the aircraft.\n\nReturning for a moment back to the topic of head-on collisions. In addition to noting the need to protect the vital engines and the \"flammable wood\" arguments cited above, you should also add to your list of things to remember, the \"Instructor\". When the enemy goes over your head and flies past, passing along a tangent, if you attempt to turn to immediately follow, the Instructor will not smoothly compensate allowing the enemy aircraft time to reposition or gain a safe distance away. For this aircraft, you should avoid quick turns and instead use the Immelmann or Split-S manoeuvres to efficiently get on your target's \"six\".\n\nWhile climbing to altitude the best strategy would be to seek out targets from a height and dive on them in a boom and zoom fashion. It is advisable to stick to a dive angle of no more than 15 degrees, allowing you to close in, but do not approach the dangerous flutter of control stiffening regardless of whether you have full thrust or the engine is off. Here you will be more or less in your element, but there are some things you will need to watch for so you do not give up any energy advantages which you may have. While you easily gain energy and speed, remember, you will not overcome lighter and more manoeuvrable fighters which still all obey the laws of physics. If you want to tango with early monoplanes and biplanes remember to utilise your advantages to nullify their advantages. While they typically have a smaller turning radius and are slower (thereby being extremely manoeuvrable), you can utilise your power and speed to boom and zoom away allowing you to set up for another pass. You should have no problem trying to compete with other aircraft in the 1st rank and even many of the heavy fighters and attack aircraft of rank II.\n\nMost fighters of your battle rating and even of a higher rating will typically be able to out manoeuvre you, however to deal with this remember to utilise your speed, manoeuvrability or a combination of both. As you get comfortable with the aircraft you will be able to know what best works, for some aircraft, you should utilise your speed, while others, you will be able to out manoeuvre or utilise a combination of both to gain the advantage and take out your target. Typically with such opponents, it's best to gain altitude, dive on them for the boom and zoom attack, hit or miss, head back up for some altitude before doing it all over again. Avoid level flight or climbing for too long as it will make you a large slow target for others to go after.\n\nAnd, probably, the last bonus of this aircraft is that due to its \"gift\" feature, it already comes spaded, eliminating the need for you to struggle with a stock plane. At this point it all boils down to your crew, you will want pick a crew which has points in the pilot's vitality and endurance skills. As it is, the pilot loves to lose consciousness on long loops at high speeds, regardless of the mode.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Fast\n* Good climb rate\n* More manoeuvrable than contemporary heavy-fighters\n* Passable weapons\n* Excellent cockpit, elaborate model\n* Solid aesthetics\n\n'''Cons:'''\n\n* Wooden, easily catches on fire\n* Relatively small ammo count on gun armament, especially the cannons\n* Bad turn time\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n[[File:Alexander_Sergeevich_Yakovlev.jpg|260px|thumb|right|Twice Hero of Socialist Labor - Alexander Sergeevich Yakovlev]]\nIn 1938, at the design bureau of A. S. Yakovlev, they began to work out a project modelling a new wooden two-seater plane with two M-103 engines with a capacity of 960 litres each. This aircraft was to be versatile which could be adopted in service in one of three versions: a fighter, high-speed bomber and a close-support reconnaissance aircraft.\n\nAt that time, the fighter version of the aircraft was considered a the high priority. The armament specified for this aircraft was to be very powerful. According to the project, it included two under-body ShVAK cannons and three ShKAS machine guns. The placement of the three machine guns was unconventional: one of the ShKAS stood in the forward fuselage, and the other two were mounted with the barrels running through the engine cylinders, where they had to fire through the hollow shafts of propeller gearboxes and out the propeller hub.\n\nIn January 1939, an experimental copy of the new aircraft designated the \"Airplane 22\", was rolled out onto the airfield. At this time it completely lacked all proposed weapons. Therefore, the \"twenty-two\" can be safely be considered the prototype version of any of the options being worked out.\n\nEarly in the first flights, Airplane 22 was able to prove that it was able to accelerate up to speeds in excess of 500 km/h, and then reached a cruising speed of 572 km/h.\n\nThe leadership of the Soviet Union including Stalin became very interested in this new high-speed aircraft. Due to this extreme interest, the Airplane 22 project was given the \"green light\" to proceed into full production, and was sent to the Air Force Research Institute to continue the flight test program. Here, the high-speed characteristics of the aircraft were officially confirmed. During the tests, the \"Airplane 22\" reached a speed of 567 km/h and an altitude ceiling of 10,800 m. This aircraft was one of the first of its class in the world to reach these records.\n\nHowever, in the form presented for testing, the aircraft had practically no combat value. Therefore, in June 1939, it was decided to turn the \"Airplane 22\" into a full-fledged high-speed short-range bomber BB-22 (Yak-2), and it was put into mass production. However, the increased take-off weight and the deterioration of aerodynamics dramatically reduced the speed of the new bomber, which significantly dropped down to 480 km/h. The only way out of the current situation was to equip the aircraft with more powerful M-105 engines with a capacity of 1,050 litres each. Once Equipped with these engines, the bomber received the Yak-4 designation in the series and with these new engines, its maximum speed increased to 530 km/h.\n\nAt the same time, work continued on the single-seat fighter variant of the aircraft, which received the name I-29. The aircraft was assembled in the second half of 1940, including the addition of M-105 engines. Unlike the earlier project, the offensive armament of the I-29 consisted of only two 20-mm ShVAK cannons.\n\nIn December 1940 the plane made the first flight, However, the lack of knowledge of regarding the new power plants resulted in an extensive slow down of the test program. At the same time, it is necessary to take into account the fact that A.S. Yakovlev himself at that time was extremely busy refining the much more promising single-engine Yak-1 fighter.\n\nWith the beginning of World War II, interest in the I-29 had fallen even more. Finally, work on the aircraft ceased in 1942 after the launch of the more promising Pe-3 heavy fighter into the series.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=i_29 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|uhgodizubC4|'''The Shooting Range #77''' - ''Pages of History'' section at 10:19 discusses the I-29.|mcIXbi67Ya4|I-29 Review: Soviet Powerhouse! - '''Jengar'''|UmGpqvyO5FY| I-29 review - '''TheEuropeanCanadian'''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n* [[Yak-4]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/5063-halloween-i-29-twin-engined-puncher-en|I-29: Twin engined puncher]]\n* [https://wiki.warthunder.ru/%D0%98-29 И-29 - War Thunder Wiki (Russian) - Most of the descriptive information on this page was translated from the wiki.warthunder.ru/И-29 page.]\n* [https://forum.warthunder.com/index.php?/topic/386226-i-29/ [WT Forum<nowiki>]</nowiki> I-29 Data Sheet]\n* [http://www.aviastar.org/air/russia/ya-22.php [Aviastar<nowiki>]</nowiki> Yakovlev Ya-22 (I-29)]\n* [http://www.airwar.ru/enc/fww2/i29.html [Airwar<nowiki>.ru]</nowiki> И-29 (Russian)]\n\n{{AirManufacturer Yakovlev}}\n{{USSR fighters}}\n{{USSR premium aircraft}}"}}