{"title":"ITP (M-1)","pageid":14477,"wikitext":{"*":"{{Specs-Card\n|code=itp_m1\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n|market=items_ITP (M-1) (USSR)\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} Soviet fighter {{Battle-rating}}. It was introduced during [[Update \"Hot Tracks\"]] as a reward for [[Battle Pass: Season II, \"Steel Centurion\"]].\n\n\"ITP\" is an acronym in Russian for \"heavy cannon fighter\", and that is an accurate description of the ITP (M-1). As a prototype fighter from the Polikarpov design bureau, the ITP looks something like a crossing between the [[MiG-3 (Family)|MiG-3]] and [[I-185 (M-82)|I-185]]. Much like the famous [[Yak-9T]], the ITP has a powerful 37 mm cannon mounted in the propeller hub. Two additional nose-mounted 20 mm ShVAK cannons with a generous ammo supply round out its internal armament. The good flight performance allows pilots with sharp aim to swiftly tear their targets apart. The ITP is a great option for both air and mixed battles, suited for punching holes in tanks, shredding bombers, and tangling with enemy fighters. Few Soviet aircraft can boast this versatility.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 6,100 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 658 || 639 || rowspan=\"2\" | {{Specs|ceiling}} || 21.9 || 22.6 || 12.6 || 12.4 || rowspan=\"2\" | 395\n|-\n! Upgraded\n| 695 || 676 || 20.2 || 21.0 || 17.8 || 15.1\n|-\n|}\n\nThe ITP (M-1) is a fairly good all-rounder but has a number of quirks. The top speed appears impressive on the statcard, with 676 km/h at 6,100 m in Realistic Battles practically matching the [[I-185 (M-71)]] a whole battle rating above it, but most engagements will not occur that high and that speed is not practically achievable. It cannot sustain more than about 520 km/h at sea level, having to rely on its good horizontal energy retention to catch up with its targets at low altitudes. The climb rate is good. The turn rate is decent and the ITP will retain energy in turns quite well at medium speeds but suffer somewhat in low speed engagements. It has noticeable control surface compression above 500-600 km/h IAS in terms of roll rate and rudder control, but the elevator thankfully remains quite responsive; the ITP will have an easier time pulling out of a dive than any [[La-5 (Family)|La-5]].\n\nOne of the main sources of annoyance when flying the ITP (M-1) is its temperamental AM-37P engine. Soviet inline engines are not known for being easygoing to begin with, but the AM-37P is particularly prone to overheating, especially at lower altitudes. When using automatic engine control, it will begin overheating when left at 100% throttle and using WEP drives the temperature gauge into orange and often even red zones. The propeller pitch is adjustable but increasing it above 70% will cause overspeed warnings to show up and is generally not recommended. Using MEC is highly recommended to help manage the engine temperatures. To best take advantage of engine performance with MEC, keep the propeller pitch at 70% and both radiators at 100%. This will drastically prolong the time your engine stays at healthy temperatures, and allows for far more liberal usage of WEP. For colder maps, closing the radiators at 75-50% is possible. Mixture should be set to 120% from sea level to 6,000 m. The minimum fuel load of the ITP (M-1) exceeds the match time for air AB and RB battles, and the enriched mixture gives a substantial performance boost. Only when above 6,000 m should the mixture be lowered to 60%, as it starts hindering the performance of the aircraft.\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 365 || 345 || 260 || ~13 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 320 || < 250 || < 500 || > 320\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n[[File:ITP (M-1) armor schematic.png|thumb|300px|ITP (M-1) armour diagram]]\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n;Armour plates\n\n# 13 mm Steel - Rear pilot armour\n\nDespite being heavily armed, the ITP (M-1) is hardly armoured, which is something of a trend for Polikarpov aircraft. The rear protection protects the pilot from being knocked out by rifle-calibre machine guns but is insufficient against heavy machine guns and cannons. There is no bulletproof glass in the cockpit canopy, so head-on engagements are risky, but the pilot sits rather low in the fuselage and presents a small target. Getting hit anywhere is a bad idea since the cooling systems are distributed throughout the nose and wing roots and the engine cannot tolerate much abuse. The wing-mounted fuel tanks can be ignited by enemy fire during turning engagements. However, the wing tanks and the central tanks are self-sealing (1 in each wing, 1 under the pilot abd 1 under the 37 mm cannon breech).\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|SH-37 (37 mm)|ShVAK (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 1 x 37 mm SH-37 cannon, nose-mounted (50 rpg)\n* 2 x 20 mm ShVAK cannons, nose-mounted (200 rpg = 400 total)\n\nTrigger discipline heavily rewards the ITP, spraying should only be done when in doubt or necessity, as it only can count on 50 rounds for the 37 mm cannon and 2 x 200 rounds for both 20 mm cannons. Still, a burst of its armament will deal significant damage, as the 37 mm is coupled with two 20 mm ShVAK cannons, nose-mounted as well. While it performs best within ranges under 1 km from its target, its nose-mounted armaments will limit the dispersion cone. Taking the Default belt is a compromise allowing to use the cannon for any target and fill a multirole approach on the battlefield.\n\n;SH-37\n\nOnly one HEI-T 37 mm round has to land on the enemy plane to cause significant damage, mostly instant fire or even ripping off a wing/the tail. While the Default ammunition belt is armed with both HEI-T (High-explosive Incendiary Tracer, Self Destroying- meant for air targets) and API-T (Armour-Piercing Incendiary Tracer- meant for ground, armoured targets), one can instead choose to focus on one playstyle by changing belts for the cannon: one being composed entirely of HEI-T (meaning that the ITP loses most of its capability to destroy \"hard\" targets, such as Medium and Light tanks, without taking any ordnance) and the other being composed entirely of API-T, meaning that shots landed on aircraft will not include the firepower of the high-explosive round. The API-T rounds are still good against aircraft, as a good shot can detonate fuel tanks, knock out engines, or tear off flight surfaces, but they might overpenetrate and pass through with minimal damage on occasion.\n\n;ShVAK\n\nTwin ShVAKs are common armaments for the Lavochkin fighters and they do not act any differently on the ITP (M-1). They are accurate and shoot quickly but are not very powerful. They are still important to utilize since the Sh-37 does not have a high volume of fire and smaller aircraft may be able to dodge the shots easily. The Default belt works fine against aircraft, combining an equal mix of AP-I rounds for damaging modules and igniting fuel tanks and FI-T rounds for help with aiming and applying some light explosive damage. For ground pounding, the Armoured Targets belt has a greater proportion of AP-I rounds and is capable of penetrating the turret roofs of certain vehicles. Either will do fine against open-topped vehicles. Avoid belts containing HEF rounds, as they do very little damage.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|FAB-50sv (50 kg)|FAB-100sv (100 kg)|RBS-82|RS-82}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x 100 kg FAB-100sv bombs (200 kg total)\n* 4 x 50 kg FAB-50sv bombs (200 kg total)\n* 8 x RS-82 rockets\n* 8 x RBS-82 rockets\n\nThe ITP (M-1) has a decent selection of suspended ordnance for a Soviet single-engine fighter. The twin 100 kg bombs are generally the best option for Ground RB, as they are dropped individually and are large enough to destroy armoured targets if delivered with good accuracy. Dropping them next to or on top of enemies may require some practice since they are mounted on the wings.\n\nThe rockets are more situational. The RS-82 rockets are not very useful against ground targets since they only have small high explosive warheads. The RBS-82 rockets are very similar but have a delayed fuse allowing them to penetrate armour. A successful penetration will usually destroy a tank in one hit, but this can be difficult to accomplish since they have a low velocity and are not very accurate.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe ITP (M-1) is capable of fulfilling different roles on the battlefield: thanks to its nose-mounted armament, it can perform aircraft interception while also having the potential for ground attack. In aerial combat, the ITP shines at quickly disposing of enemy aircraft, relying on Boom & Run tactics in engagements. Its 37 mm cannon is what makes it so deadly: any shots landed onto any enemy plane will, most of the time, cripple it, if not outright destroy it.\n\nThe ITP is not a head-on opportunistic fighter: rather, it relies on planned Boom and Run passes, by attacking enemy fighters that are in a lower energy state, or by swooping in and destroying distracted enemies engaged in turnfight. Use of WEP should, just as its ammunition management, be limited towards maintaining speed after pulling out of a dive or a quick boost, as continuous use will quickly overheat the engine. Avoid turnfighting as the aircraft loses a considerable amount of speed in any sort of vertical manoeuvres. Rather than entering a turnfight, the ITP must maintain a high speed to quickly get away from dedicated turnfighting aircraft such as the Japanese [[Ki-43-III otsu]], a common enemy at its BR, then climb again and plan another Boom and Run pass.\n\nWhen focusing entirely on a ground attack role, the ITP performs best as a dive-attacker, rather than a low-flying approach, as altitude and speed are the ITP's guarantee to survive enemy fighters tailing it.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Powerful armament can destroy large targets with just a quick burst\n* Fairly manoeuvrable at higher speeds\n* Versatile 37 mm cannon can load Armoured targets belts, capable of penetrating up to 60 mm of armour\n* Can carry bombs and rockets, allowing it to play a CAS role in ground battles\n* Great climb rate, can manage 30 degrees climb with WEP\n* Powerful engine, can outrun most aircraft at its BR (<5,000 m)\n* Large ammo count for the 37 mm cannon\n\n\n'''Cons:'''\n\n* Catches fire easily if damaged (liquid cooling system and fuel are located in the wings)\n* The pilot is poorly protected\n* Acceleration isn't very good compared to other aircraft at a similar BR\n* Engine is prone to overheating\n* Minimum fuel load is 30 minutes, weighing down the aircraft and reducing the manoeuvrability\n* 37 mm cannon can be inaccurate if fired in prolonged bursts\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe Polikarpov ITP (Istrebitel' Tyazhely Pushechny - heavy cannon fighter) was a prototype Soviet fighter aircraft that never reached production. Designed to mount a heavy armament of 20 and 37 mm cannons, the ITP was significantly hampered by the unreliability of its powerplants, resulting in its eventual cancellation in 1944.\n\nIn 1940, the Polikarpov design bureau set out to develop a single-engined heavy fighter. The aircraft was designed to mount a 37 mm B.G. Shpitalny Sh-37 cannon with 50 rounds of ammunition, along with a pair of 20 mm ShVAK cannons with 140 rounds each. The aircraft could also carry eight RS-82 rockets underwing, or two bombs up to 100 kg each. The aircraft was built of a mixed wood and metal construction with a conventional wing and undercarriage. The aircraft could obtain a maximum speed of 655 km/h at altitude.\n\nBy the end of 1940, the primary design work had been completed. The first prototype aircraft was completed in October of 1941, and in May 1942, the aircraft flew for the first time. However, the aircraft's development was greatly hampered by the unreliability of its powerplants; the ITP prototypes flew with the M-107 and AM-39 engines, the latter achieving a maximum output of 1700 hp, yet engines frequently failed during testing. By 1944, it was evident that while the ITP was a promising design, it offered little advantage over existing Soviet fighter designs. The death of chief designer Nikolai Polikarpov in July 1944 was the final nail in the coffin, as all work on the design was subsequently stopped.\n\n=== [[wt:en/news/7061-development-battle-pass-vehicles-itp-m-1-en|Devblog]] ===\nAt the end of 1940, the aircraft designer Nikolai Polikarpov came up with the initiative to create a fundamentally new combat aircraft for Soviet aviation - a fighter with heavy cannon armament, that could fulfill tasks typical for heavy fighters and attack aircraft, while possessing the flight characteristics of a light single-engine monoplane fighter. The military accepted Polikarpov's idea with interest, formulating tasks for the future aircraft, such as effective air combat, including the destruction of bombers, aerial destruction of tanks and armoured vehicles, as well as escort missions. The assembly of the first prototype began in May of 1941, however, due to the rapid offensive from the enemy towards Moscow, production had to be evacuated to Novosibirsk, Siberia, where the test unit was completed.\n\nITP (M-1) (ITP is for \"heavy cannon fighter\") was a monoplane fighter with a 1,650 hp M-107P engine, the armament of the aircraft consisted of a 37mm Sh-37 motor-mounted gun and a pair of 20mm ShVAK cannons. Flight tests began in February 1942, but were not fully completed due to engine problems. A little later, versions with the M-107A and the AM-37 engines were tested, on the second prototype, the 37mm cannon was replaced with another ShVAK cannon. Work on the ITP project was interrupted due to the untimely death of the Soviet \"king of fighters\" in 1944.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=itp_m1 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed\" heights=\"175\">\nFile:ITP (M-1) WTWallpaper 01.jpg|\nFile:ITP (M-1) WTWallpaper 02.jpg|\nFile:ITP (M-1) WTWallpaper 03.jpg|\n</gallery>\n\n;Videos\n{{Youtube-gallery|9ffyPCaxp9k|'''Battle Pass Vehicles''' discusses the {{PAGENAME}} at 03:20 - ''War Thunder Official Channel''|57j2HIxn7qk|'''ITP (M-1) Seal Clubbing Review''' - ''Dimitri_Rudov''|1tNEooOmoQg|'''The BEAST Within! ITP (M-1)! - USSR - Premium Review!''' - ''Jengar''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n* [[Yak-9T]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/7061-development-battle-pass-vehicles-itp-m-1-en|[Devblog] Battle Pass vehicles: ITP (M-1)]]\n\n{{AirManufacturer Polikarpov}}\n{{USSR fighters}}\n{{USSR premium aircraft}}"}}