{"title":"J-7II","pageid":7378,"wikitext":{"*":"{{About\n| about = Chinese jet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = MiG-21 (Family)\n}}\n{{Specs-Card\n|code=j_7_mk2\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|J-7II WebsiteImage 1.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese jet fighter {{Battle-rating}}. It was introduced in [[Update 1.91 \"Night Vision\"]].\n\nAfter the Korean War, several nations came out with various aircraft which would out-fly opposing aircraft, especially in a dogfight. The U.S. introduced the Lockheed F-104 Starfighter and Northrop F-5 Freedom Fighter while European nations France, England and Sweden rolled out the Dassault Mirage F-1, Mirage III, English Electric Lightning, Hawker Hunter and the Saab Draken. At this time the Soviet Union was working on further developing the twin-engine MiG-19 but realized what it actually needed was a fast, single-engine light-weight fighter in what ultimately became the most highly produced supersonic fighter in the world and used by over 60 countries. This basis of this fighter was the Ye-66a (''Ye'' stands for \"Yedinitsa\" or single-unit), later changed to MiG-21 F-13 or as dubbed by NATO, the ''Fishbed-C''. Due to a shaky political situation, the Chengdu Aircraft Company in China reversed engineered the MiG-21 sent by the Soviet Union without technological documents. In the process they solved almost 250 inherent problems with the MiG-21, upgraded the fuel system, replaced the ejection seat and reoriented how the cockpit canopy opened. The result was the J-7 interceptor fighter that looked like the original MiG-21 with minor design and performance differences. NATO dubbed this aircraft ''Fishcan''.\n[[File:MiG-21_smigol_chat_bann.png|400px|thumb|left|Though the '''{{PAGENAME}}''' looks almost exactly the same as the MiG-21 pictured here, the Chinese made many improvements when reverse-engineering the aircraft.]]\nThe {{PAGENAME}} was built to be a point defence interceptor, not an air-defence fighter slated for combat missions, basically a short-range day fighter. Due to being cheap, fast, inexpensive and simple to maintain, the essence of this fighter's existence was to be used in large groups to overcome the technologically advanced Western aircraft. Essentially it was a missile which houses a pilot, two 30 mm cannon and two PL-2 air-to-air missiles. The sleek airframe was made with aluminium alloys, steel, magnesium and fibreglass. The air-intake cone automatically adjusts during the flight to help the aircraft remain aerodynamic. The fighter sported a delta wing with a 57° leading edge and even the all-moving tailplane utilizes the swept feature. Everything about this jet focus on speed which lends it reaching out to the Mach 2 range. The strength of the aircraft is its speed in a straight line whether in a climb, level flight or a dive, however, when it turns at all, it haemorrhages its energy and when it gets below 700 km/h, it is difficult to get back up to speed without diving to make up that speed. When caught near the ground and going slow will be extremely frustrating for a J-7 pilot.\n\nThe {{PAGENAME}} as-built shaped like a missile excels in air-to-air combat, but beware of turning or manoeuvres, though they will slow you enough to get behind an enemy fighter, it may also slow you enough for another enemy fighter to get a missile lock or gun solution on you. Always be aware of your surroundings. Though this fighter can be outfitted with rockets or 500 kg bombs, these options should be reserved for special situations as the attacker/bomber function was never designed as a multi-role function as it was with the [[F-4C Phantom II|F-4C]]. The PL-2 missiles can be a challenge to get used to, so newer pilots may elect to outfit the HF-4 rockets and use them to go after bombers. With only 120 rounds of 30 mm cannon ammunition between the two cannons, trigger control is a must or else you will be waiting often for a reload timer to count down or will be frequently returning to base to reload.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nDue to the Chengdu {{PAGENAME}} being an interceptor fighter, its main purpose is to interdict enemy aircraft. For this purpose, a jet fighter should meet certain criteria such as being light-weight, fast, aerodynamic and cheap to build and maintain. The {{PAGENAME}} fits all of these criteria to a tee. Sitting at a take-off weight of 9.5 tons and power output from the WP-7b jet engine of 3320 kgf, the J-7 was a rocket compared to other contemporary fighter/interceptor aircraft. The closest comparable aircraft in-game are the Hunter F 1, Hunter F.6 and the Super Mystere B2. Pound for pound and thrust for thrust, the Hunter F 1 is the closest with a take-off weight of 9.5 tons and power output from a Rolls-Royce Avon Mk. 113 engine with 3188.1 kgf, however, the final thrust output was no contest with the {{PAGENAME}} able to fly 1,000 km/h faster than the Hunter at top speed.\n\nManoeuvrability in the J-7, for the most part, is non-existent. Due to the shape of the wings and the aerodynamics of the entire aircraft, it is built mostly for high-speed low-drag in a straight flight and that becomes apparent when it enters into a manoeuvre or a turn where it begins to bleed speed at a horrendous rate. With no adjustment to the throttle, a {{PAGENAME}} can drop from 1,000 km/h to 600 - 700 km/h just by making a turn or manoeuvring from flying in a straight line. J-7 pilots must take into account when they attempt evasive manoeuvres after a missile is fired at them as doing so they may avoid the missile, but they may also end up flying under 700 km/h which is a bad place to be and can be difficult to return from if there is no room to dive to build up speed. The best bet to use the {{PAGENAME}} is up at higher altitudes where the jet flies faster and has room to dive if the speed needs to be built up after turning or manoeuvring.\n\nWhile the {{PAGENAME}} can be outfitted with 500 kg bombs, adding the extra weight impacts this fighter even more. With the bombs placed on under-wing pylons, it decreases the roll-rate of the aircraft having that weight away from the centre of the aircraft (or in comparison to a clean aircraft – without bombs). Bombs are an option for the aircraft, however, due to needing to maintain speeds above 700 km/h using the J-7 as a bomber is less effective and can expose this aircraft to other fighters which prey on low and slow aircraft.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 13,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 2,233 || 2,219 || rowspan=\"2\" | {{Specs|ceiling}} || 34.6 || 35.2 || 113.8 || 106.9 || rowspan=\"2\" | 750\n|-\n! Upgraded\n| 2,314 || 2,262 || 31.7 || 33.0 || 158.1 || 135.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| X || ✓ || ✓ || ✓ || X || ✓     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || N/A || 524 || 450 || ~11 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 650 || < 600 || < 780 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"4\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | Empty mass || colspan=\"2\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | Shenyang Liming WP-7b || 1\n| colspan=\"2\" | 5,512 kg || colspan=\"2\" | 325 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"3\" | Mass with fuel (no weapons load) || rowspan=\"2\" | Max Takeoff<br />Weight\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 9m fuel || 20m fuel || 30m fuel\n|-\n| 1,190 kg || colspan=\"2\" | Afterburning axial-flow turbojet\n| 6,106 kg || 6,817 kg || 7,464 kg || 9,500 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB / SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"4\" | Thrust to weight ratio @ 0 m (WEP)\n|-\n! Condition || 100% || WEP\n! 9m fuel || 20m fuel || 30m fuel || MTOW\n|-\n| ''Stationary'' || 3,640 kgf || 5,387 kgf\n| 0.88 || 0.79 || 0.72 || 0.57\n|-\n| ''Optimal'' || 3,640 kgf<br />(0 km/h) || 5,686 kgf<br />(1,200 km/h)\n| 0.93 || 0.83 || 0.76 || 0.60\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n;Armour\n\n* 16 mm Steel – behind the pilot's seat\n* 25 mm Steel – pilot's headrest\n* 65 mm Bulletproof glass – forward canopy windscreen\n\nWith the {{PAGENAME}} configured for and operated as an interceptor, not much thought was put into protecting the aircraft as it was relatively cheap and easy to build and maintain. However, protections were put in place for the pilot which on the other hand was a valuable asset. Protective steel behind the seat and pilot's headrest along with the 65 mm bulletproof glass helped protect the pilot from defensive fire coming from bomber turrets or from smaller calibre guns found on many Western fighters of the time.\n\nThe {{PAGENAME}}'s role as an interceptor basically had it scramble from the airfield when enemy fighters/bombers entered the area and it went full afterburner to reach attack altitude where it would make several passes, down the aircraft and return to the airfield. Due to its speed and limited weapon load-out, further protections for the aircraft's critical component were not necessary and thus left off the aircraft to allow for its light-weight and quick intercept capability.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Type 30-1 (30 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 30 mm Type 30-1 cannons, belly-mounted (60 rpg = 120 total)\n\nThe {{PAGENAME}} has been outfitted with dual 30 mm Type 30-1 cannons (Chinese version of [[NR-30 (30 mm)|Nudelman-Rikhter NR-30]] cannon). This gun is the perfect weapon for an interceptor class aircraft as it is large enough calibre to do some serious damage, however, this cannon only houses 60 rounds of ammunition per gun. While the small ammunition pool appears to be a negative point to the aircraft, minimizing weight is necessary to ensure this aircraft can intercept inbound enemy aircraft. Compared to the MiG-21 F-13, the {{PAGENAME}} has a second cannon and double the ammunition (60 rpg), however, trigger control is still a necessary skill the pilot must use to ensure enough rounds available to make the necessary shots before returning to base to reload.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|FAB-500M-54 (500 kg)|PL-2|Type 57-1}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance presets:\n\n* Without load\n* 2 x 500 kg FAB-500M-54 bombs (1,000 kg total)\n* 64 x Type 57-1 rockets\n* 2 x PL-2 missiles\n\n==== Custom loadout options ====\n{| class=\"wikitable\" width=\"100%\" style=\"text-align:center\"\n|-\n! !! width=\"25%\" | 1 !! width=\"25%\" | 2\n| rowspan=\"4\" width=\"25%\" | <div class=\"ttx-image\">[[File:Hardpoints_{{PAGENAME}}.png]]</div>\n|-\n! 500 kg FAB-500M-54 bombs\n| 1 || 1\n|-\n! Type 57-1 rockets\n| 32 || 32\n|-\n! PL-2 missiles\n| 1 || 1\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nJust like the MiG-21, the J-7II was designed to be a fighter-interceptor and thus all of its design features shape it into virtually a missile with a cockpit. This aircraft wasn't designed to carry the load the [[F-4C]], [[G.91 YS]] or the [[Super Mystere B2]] can carry, but it was built for speed and to bring along the minimal amount of armament to do its job.\n\nAs a fighter-interceptor, the J-7II needed to get from Point A (the airbase) to Point B (the inbound enemy aircraft) in the shortest amount of time possible, shoot it, and return to base to get ready for the next one. This jet can remain fast if it is flying in a straight line, however do not try to sustain dogfights in it. It has a high AoA, meaning it bleeds a good amount of speed in hard turns.\n\nThe best use of this aircraft is to utilise its excellent speed and rate of climb and gain altitude and begin to level off when you are either at bomber altitude or just above any enemy fighters flying around. It is here you can use the great [[Boom & Zoom]] qualities of the aircraft and select a target and begin to dive on it. It is during this phase when you can attempt to get a lock with the PL-2 air-to-air missiles and launch it or you can strafe any unwary targets with the pair of 30 mm Type 30-1 autocannons. Extremely short bursts are a must in order to conserve ammunition (60 rpg, only 120 rounds total), but this powerful gun only needs one or two good shots to remove a wing, take out a pilot or disable an engine. Once shots have been taken, regardless of if they hit or missed, engage the afterburner and return to higher altitudes and set up for another Boom & Zoom run. [[Boom & Run]] techniques also work in that you can use the phenomenal speed of the J-7II to outrun just about any aircraft on the map (however beware of the [[F-4C]] which can keep pace if not outrun the J-7II).\n\nOptions are available to use this aircraft in the role of ground-attack, however, this may be an extreme challenge, especially to any novice fighter jet pilots. While the 30 mm autocannon is standard in all of the ordnance load-outs, when adding a secondary suspended armament, you are limited to only one type. In this case, you will need to choose from 32 lightweight HF-5 rockets or two 500 kg bombs. The added weight and drag when adding either of these options can be difficult to overcome, especially since this aircraft is built for speed over manoeuvrability.\n\nWhen attacking ground targets, it is best to place the J-7II into a relatively shallow dive, it is important to remember to properly line up for the target ahead of time because with the external ordnance fine-tune manoeuvring can be difficult especially when corrections need to be made at the last minute. Lack of a bombsight makes bombing smaller targets a bit more difficult to hit. When flying low to take on ground targets, make sure you leave yourself an out when the situation turns bad. The best practice here is to ensure you keep your speed up, slow enough to hit the target, but fast enough to get away when the situation turns.\n\n=== Radars ===\n<!--{{main|SRD-5}}-->\nThe J-7II is equipped with a SRD-5 rangefinding radar, located in the nose of the aircraft.\nIt will automatically detect other planes within the scanning area and display the range to the closest target. It is linked with a gyro gunsight and can help with aiming at close range.\n\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"4\" | SRD-5 - Rangefinding radar\n|-\n! {{Annotation|Maximum<br/>Tracking<br/>Range|The maximum range at which a target can be tracked}}\n! {{Annotation|Minimum<br/>Tracking<br/>Range|The range below which targets cannot be tracked by the radar}}\n! {{Annotation|Azimuth Tracking<br/>Angle|How far to each side the radar can track a target}}\n! {{Annotation|Elevation Tracking<br/>Angle|How far up and down the radar can track a target}}\n|-\n| 3,000 m || 300 m || ±9° || ±9°\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Higher acceleration and speed than its Soviet counterparts thanks to its new engine\n* Less high-speed compression than the [[J-6A]]\n* Can pull high AoA for quick snapshots\n* Additional port side gun which doubled the ammo count than [[MiG-21F-13]]\n* Great rate of climb\n* Missiles have a high explosive mass\n\n'''Cons:'''\n\n* Not very manoeuvrable at low speeds\n* Loses energy quickly in hard turns\n* Missiles have poor agility and tracking, easily dodged by attentive targets\n* Engine tends to overheat on sustained afterburner\n* Unlike the MiG-21F-13, no access to S-24 heavy rockets for ground attack or head-ons\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nThe Sino-Soviet split, which began in the late 1950s, led to a period of chilled relations between the Soviet Union and the People's Republic of China. The most modern fighter aircraft in the inventory of the People's Liberation Army Air Force was the MiG-19, purchased from the USSR. While an effective fighter at the time of its introduction, rapid advancements in fighter jet development lead to new aircraft like the MiG-21 capable of flying at twice the speed of sound. Around 1960, plans were underway for MiG-21s to be license produced in China, but negotiations broke down and Soviet advisors were pulled from the country, leaving the fate of the project in question. A few years later, Khruschev unexpectedly approached Mao with an offer to sell the MiG-21 and its technology. This deal went through and several MiG-21s, parts, and associated documentation were delivered to China. However, it was discovered that the documents were incomplete. In order to manufacture them properly, the MiG-21s were thoroughly reverse engineered, and a number of improvements were made in the process. The finished product of this effort was firstly named a '''Type 62 Interceptor (62式歼击机)''' then later a '''J-7 (歼-7)''', mostly identical to the original [[MiG-21 F-13]] (NATO: Fishbed; the Chinese variants are sometimes called a '''Fishcan''' to differentiate from Soviet built ones).\n\nA huge number of J-7 variants were manufactured in the course of its nearly 50-year production run, though development and production stagnated during the chaos of the Cultural Revolution and the PLAAF often had to rely on the outdated [[J-6A|Shenyang J-6]]. The '''{{PAGENAME}}''' first flew in 1978 and featured an improved engine and ejection seat, among other changes. Later J-7B/F-7M incorporated British GEC Marconi avionics and compatible with Western weapons, these were popular export items to customers like Bangladesh, Pakistan, Nigeria, and Iran. The J-7III series was developed from the basis of a reverse engineered [[MiG-21MF (Germany)|MiG-21MF]] and attempted to match the MiG-21SM, featuring a larger nosecone and a more powerful radar, but did not see large scale production. The successful J-7IV (later [[J-7E]]) introduced a unique double-delta wing design that improved the aircraft's agility and fuel capacity tremendously. The J-7 design was also used as a starting point for the Guizhou JL-9 supersonic trainer and the JF-17 multirole export fighter.\n\nAt present the J-7 is still in the inventory of numerous air forces, but they are mostly those based on the later E variants (F-7MG,PG,BG) and only very few of the original delta wing variants are still in service. After PLAAF and PLANAF decommissioned their remaining J-7IIH and J-7B from combat service in 2021, the remaining J-7E and G still served as an inexpensive and quick response frontline interceptor for PLAAF.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=j_7_mk2 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed-hover\" heights=\"150\">\nFile:J-7 mkII WTWallpaper 001.jpg\nFile:J-7 mkII WTWallpaper 002.jpg\nFile:J-7 mkII WTWallpaper 003.jpg\nFile:J-7 mkII WTWallpaper 004.jpg\nFile:J-7 mkII WTWallpaper 005.jpg\nFile:J-7 mkII WTWallpaper 006.jpg\n</gallery>\n\n;Videos\n{{Youtube-gallery|30XMgpkhDio|'''Chengdu J7 - Superior To The MiG-21 - A Guide''' - ''WhooptieDo''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/6360-development-chengdu-j-7ii-domestic-technologies-en|[Development] Chengdu J-7II: Domestic Technologies]]\n* [https://forum.warthunder.com/index.php?/topic/474722-chengdu-j-7ii/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Chengdu}}\n{{China jet aircraft}}"}}