{"title":"J22-B","pageid":8969,"wikitext":{"*":"{{About\n| about = Swedish fighter '''{{PAGENAME}}'''\n| usage = the other version\n| link = J22-A\n}}\n{{Specs-Card\n|code=ffvs_j22_b\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_ffvs_j22_b.jpg\n}}\n\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Swedish fighter {{Battle-rating}}. It was introduced in [[Update 1.95 \"Northern Wind\"]].\n\nWith World War II on the brink of starting, Sweden realized that their air fleet was outdated and many foreign options fell through either through unacceptable offers, embargoes or unrealistic transit times. SAAB was already at maximum capacity building SAAB 17 fighters and SAAB 18 bombers and could not help. To bypass this problem, a new company and factory were setup (Royal Air Administration Factory in Stockholm, FFVS) to build the J 22 fighter. This fighter was relatively straight forward as a steel frame and plywood covered aircraft of a conventional build. The main landing gear retracted into the fuselage and everything was built simplistically to aid in the expedient building along with easy maintenance.\n\nDue to the necessity of needing engines for this aircraft, an unlicensed copy of the Pratt & Whitney R-1830 engine was built and utilised (though later the license fees were paid). The simplicity of the aircraft not only made it a dream to build and maintain but for the pilots which flew it, they stated that it was well-liked and was very responsive resulting in good manoeuvrability. Though problems typical to tail-dragger aircraft, forward visibility while taxiing was terrible and it was necessary to lock in the tail wheel on takeoff to prevent the aircraft from entering into a ground-loop and crashing. Pilots found that the {{PAGENAME}} could hold its own in a mock dogfight with Swedish P-51s (J 26) as long as they remained under 4,000 m (13,000 ft), anywhere above that, the fighter began to struggle and lose any equality or advantage it had over the Mustangs and required the pilot to really work the controls just to be anywhere close to competitive. Tight turns sometimes resulted in the {{PAGENAME}} inadvertently flipping over onto its back.\n\nPilots in War Thunder will find controlling the {{PAGENAME}} relatively easy especially when speed is maintained as long as they remain under the 4,000 m ceiling. This fighter is not necessarily the best choice for intercepting bombers unless they attempt to tackle the smaller attacker/bombers or low-altitude strategic bombers like the [[Do 17 (Family)|Do 17]], [[Su-2 (Family)|Su-2]]s or other bombers in this size/weight range. The {{PAGENAME}} should be able to hold its own with most fighters in a dogfight, however, it would be wise to look for any speed/height advantages before taking on an A6M or Spitfire. Like many fighters of its day, being outfitted with only machine guns can mean more time spent firing at a target, but for those pilots who properly set their convergence and then fight within that range, the four machine guns should be more than sufficient to take down most enemy fighters.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\nThe {{PAGENAME}} is a relatively easy fighter to fly, like many Spitfire pilots, Swedish pilots stated that this aircraft was very responsive, move the control surface and the aircraft went where you wanted it, unlike the German Bf 109s which at times were a struggle to fly which almost seemed to need to be beaten into submission. With the ease of manoeuvrability for the {{PAGENAME}}, pilots will find it a good opportunity to practice (and perfect) canopy rolls, Split-S, Immelmann and even wing-over manoeuvres, not only to get a good feel for the aircraft but also to incorporate them into the offensive and defensive manoeuvres the pilot will definitely need for combat.\n\nThe {{PAGENAME}} is a good middle of the road aircraft, especially with its manoeuvrability. Some may fear heavy hitters such as the P-47, J2M or Fw 190, but with using throttle control and manoeuvring characteristics of this fighter, it can wiggle its way out of tight spots and can even end up causing the enemy to overshoot where then it can line up a shot and dispatch the overeager pilot now caught in the cross-hairs.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,300 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 538 || 520 || rowspan=\"2\" | {{Specs|ceiling}} || 22.1 || 23.0 || 7.4 || 7.4 || rowspan=\"2\" | 330\n|-\n! Upgraded\n| 585 || 560 || 19.9 || 21.0 || 14.5 || 10.5\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 487 || 444 || 225 || ~9 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 380 || < 370 || < 340 || > 320\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n[[File:J22 Armor Plating.png|300px|thumb|right|Protective components found in the {{PAGENAME}}.]]\n\n* 60 mm - bulletproof glass\n* 5 mm - engine-cockpit firewall\n* 10 mm steel - pilot's seat\n* 10 mm steel - pilot's headrest\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Akan m/39 (13.2 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 4 x 13.2 mm Akan m/39 machine guns, wing-mounted (250 rpg = 1,000 total)\n\nHaving found the two different calibre machine guns hampered the effectiveness of the J 22A, a second version of the aircraft was released where the two 8 mm machine guns were removed and replaced with two more 13.2 mm Akan m/39 machine guns, allowing for a total of four 13.2 mm machine guns. While this may only seem to have been a slight increase, the difference is remarkable because it allowed for the pilots to relax a bit their preparation and attack on enemy aircraft, giving them more time to plan and execute the attack then calculate convergence and drop rate of their ammunition.\n\nIt is still necessary for the pilot to factor in convergence for their guns due to all four being mounted in the wings. With all the same calibre, bullet drop can be more predictable since they are will all start to lose energy and drop relatively at the same time. This helps to ensure more rounds hitting the enemy target and less missing. With this consistency, pilots which prefer to attack aircraft from a bit more of a distance can set their convergence from 350 m – 600 m with good results and some with experience to be set as much as 800 m. Though, much like the J 22A, having the convergence set from 250 m to 400 m and attacking within the 200 m to 350 m range will rain down a hail storm of bullets intent on dismantling or destroying critical components of the enemy aircraft.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nLike many Soviet aircraft which were devoid of any turbochargers or superchargers, the {{PAGENAME}} is best flown between low altitudes and 4,000 m (13,000 ft). Any higher and this aircraft will struggle and be prey to higher altitude fighters which have the extra horsepower kick from these engine chargers. To effectively relate, flying above 4,000 m in this aircraft is akin to flying a stock aircraft in a normal situation, not as fast, not as manoeuvrable and not a powerful as it could be and an easier target for those aircraft which are.\n\nKnowing this important information, the {{PAGENAME}} can still clean up at the lower altitude, especially at the ranks it will be flying at. Even though some enemy aircraft will begin to test height limits by passing 4,000, 5,000 and even 7,000 m, let them go and let the turbocharger and supercharger aircraft concentrate on them. At the lower altitudes, the {{PAGENAME}} can still be an effective fighter, attacker and bomber interceptor.\n\nAir targets belt is the preferred option, as the sheer number of HEF-T rounds (3/4 of the belt in fact) will tear through enemy aircraft.\n\n;Low altitude bomber-attacker/interceptor\n\nIn early matches, there are always players which insist on taking their bombers and interceptors to the deck where they can scatter the smaller 50 kg and 100 kg bombs on vehicles, pillboxes, anti-aircraft artillery and other targets and some of these aircraft even excel at this low altitude. The {{PAGENAME}} can take advantage of its more powerful engine at the lower altitude and attack bombers and attackers which are inbound or lining up to drop their ordnance. Due to these bombers and attacker aircraft typically having defensive gunners, the {{PAGENAME}} pilot will need to find an angle of attack which exposes them the least while giving them the best opportunity to shoot off a wing or make a critical shot in a fuel tank, engine, oil cooler, water cooler or even knock out the pilot. Sitting behind these aircraft and shooing away is not a smart move as the {{PAGENAME}} is susceptible to lose its engine or take a hit in a fuel tank or worse, the pilot.\n\n;Fighter interceptor\n\nThe {{PAGENAME}} is a relatively nimble aircraft and should be able to play both a Boom & Zoom style of fighting and also a limited version of turn fighting. Although turn fighting with biplanes is a bad idea, other contemporary monoplanes should at least be an even match. Care must be taken if a fighter with a speed or altitude advantage attacks as you must be ready to manoeuvre into a canopy roll, reduce throttle and work to cause the enemy to overshoot where you can power back up, line up a shot and make an attack of your own. When attempting to Boom & Zoom a target, don’t get wrapped up in turning to fight immediately after attacking if you miss or don’t damage them as bad as hoped, it is best to speed away and set up for another attack when the advantage is once again in your possession. Immediately turning into a fight after zooming in will cause the aircraft to bleed a lot of speed, while you may still get the shot, you are now in a difficult position of being in a lower state of energy and a more vulnerable target for enemy aircraft.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Good top speed\n* Light and nimble\n* Small silhouette\n* Underestimated agility, can quickly turn tables on attackers\n* Has mirrors for rear viewing\n* Four 13.2 mm machine guns with access to HEF-T rounds by default will shred the generally unarmored planes\n\n'''Cons:'''\n\n* Poor high altitude performance, but in a downtier almost no planes climb to altitudes high enough to be a significant disadvantage and in an uptier enemy attackers are generally easy pickings\n* No suspended ordnance and a lack of penetration from the 13.2 mm guns leave it lacking in ground attack options\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n==== Aircraft development and history ====\nAs World War started to break out in Europe in 1939, a nervous neutral Sweden watched as the Soviets attempted to advance on Finland and Germany amassing power and heading for France. Looking at its current air forces, the Swedish military realized their fighter aircraft, older Gloster Gladiator [[J8A|J 8]] biplane fighters were largely outdated when compared to up and coming Bf 109s and early Soviet fighters like the [[I-301]] (or later known as [[LaGG-3 (Family)|LaGG-3]]. With SAAB’s current production plant cranking out SAAB 17 reconnaissance/bombers with SAAB 18 bomber in development, no room, mechanics or design team personnel were available to spare for the development and creation of a modern fighter airplane for the Swedish Air Force.\n\nDesperate for immediate aircraft, Sweden reached out to the United States with an interest in the Seversky P-35 (J 9) and the P-66 Vanguard (J 10) which almost 250 of these aircraft were ordered, however, as fate would have it, Germany invaded Norway in mid-1940 resulting in the United States halting the exporting of all weapons through an embargo with any foreign country with the exception of Great Britain. A new look cast light on the Finnish fighter the VL Myrsky and the Soviet Polikarpov I-16, however, the aircraft did not make the cut and did not meet the requirements that the Swedish military was looking for. Though the Mitsubishi [[A6M (Family)|A6M]] Zero was an option, attempting to deliver these from Japan was not a feasible option. Instead, a decision was made to build a local fighter, however as a stop-gap measure, several [[CR.42]] (J 11) and Reggiane [[Re.2000 G.A.|Re.2000]] (J 20) fighters were purchased.\n\nSince SAAB had its hands full with current projects, a new aircraft manufacture and manufacturing facility was created specifically to build a new fighter, the Royal Air Administration Aircraft Factory in Stockholm or FFVS which was under the direction of Bo Lundberg.<ref name=\"Langbro\" /> The new fighter designated J 22 was to be a monoplane constructed with a steel airframe which was covered in plywood, giving it sufficient strength, but keeping its weight down to a manageable level.<ref name=\"Fridsell\" /><ref name=\"Aceto\" /> This aircraft had many similarities with fighters being developed in the west, especially since the engine it utilised was an unlicensed copy of the Pratt & Whitney R-1830 Twin Wasp. The nose of the aircraft housed the radial engine while the cockpit sat behind it situated just behind the leading edge of the wings. The fuselage tapered from the front to a narrow rear frame ending at the tailplane where the vertical and horizontal stabilizers are located. The wings set low on the fuselage with the landing gear retracting into the fuselage as opposed to the wings on many European and Soviet aircraft.\n\nThe aircraft was a bit awkward for the pilots while taxiing as the nose sat fairly high and blocked a significant portion of the pilot’s field of view, requiring the pilot to waggle the tail while taxiing to ensure nothing was in front of them, however after the plane took off, as many Swedish pilots noted, it was a very pleasant aircraft to fly.<ref name=\"Langbro\" /> Due to the strong frame and the light bodywork, the controls of the aircraft were very responsive to the pilot’s inputs and much like the Spitfire aircraft of the Royal British Air Force; pilots thoroughly enjoyed flying these planes. Pilots also claimed that during mock dogfights with P-51 (J 26) fighters, the {{PAGENAME}} could hold its own all the way up to around 4,000 – 5,000 m (13,000 – 16,000 ft), any higher the aircraft lacked a supercharger which caused the engine performance to significantly drop and at that point the aircraft became a beast to control, therefore operations were kept at 4,000 m or below.<ref name=\"Fridsell\" />\n\nThere were three versions of the aircraft built, the J 22A (or J 22 UBv “Ursprunglig Beväpning” (original armament)) was the first production aircraft which though a good aircraft, was considered lacking in the firepower department due to it only having 2 x 8 mm and 2 x 13.2 mm machine guns. However, the second version, the J 22B (or J 22 FBv “Förbättrad Beväpning” (improved armament)) was the same aircraft however, the two 8 mm machine guns were removed and replaced with two more 13.2 mm machine guns, for a total of four (two in each wing). Several were modified into reconnaissance aircraft, however later they were converted back into fighters; these were known as S 22-1 aircraft.\n\nThese aircraft were well-liked by pilots and even more well-liked by their maintainers due to their ease of maintenance, having enough parts on hand ensured these aircraft remained airworthy and ready to go. None were ever exported to a foreign country and all served only under the Swedish flag until the last one was retired in 1952.\n\n'''Excerpt taken from an interview with Ove Müller-Hansen, Squadron Commander, 2nd Squadron (2:a divisionen), F10 Wing, Ängelholm'''\n\n''I have read that you once ended up in a dogfight with a FW 190?''\n\n\"That is completely wrong. What happened was that I was over Malmö Harbor in a fight in my J22 with a Heinkel 111. He was shooting at me and I was shooting at him, trying to make him leave Swedish territory. I finally got him smoking. He was probably on his way to Copenhagen, but I don't think he made it as he was losing altitude. I saw an aircraft behind me and I thought it was a FW 190 as they also were stationed in Copenhagen and I pulled away as much as I could and was able to lose him. It turned out that it was my wingman. He was a little late taking off so he was rather far behind me. The J22 was very similar to the FW190 so it was difficult to tell them apart. We were really scared of the FW 190. We could probably out-turn them but we really didn't want to try... My wingman was a little angry at me after this incident, but I told him what happened and he understood.\"<ref name=\"Langbro\" />\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicleCountry=sweden&vehicleType=aircraft&vehicleClass=fighter&vehicle=ffvs_j22_b Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<div><ul>\n<li style=\"display: inline-block;\"> [[File:FFVS_J22_WTWallpaper_001.jpg|thumb|none|250px|]] </li>\n<li style=\"display: inline-block;\"> [[File:FFVS_J22_WTWallpaper_002.jpg|thumb|none|250px|]] </li>\n<li style=\"display: inline-block;\"> [[File:FFVS_J22_WTWallpaper_003.jpg|thumb|none|250px|]] </li>\n<li style=\"display: inline-block;\"> [[File:FFVS_J22_WTWallpaper_005.jpg|thumb|none|250px|]] </li>\n<li style=\"display: inline-block;\"> [[File:FFVS_J22_WTWallpaper_006.jpg|thumb|none|250px|]] </li>\n</ul></div>\n\n;Videos\n{{Youtube-gallery|2liNekQlD0U|'''Lethal weapon! {{PAGENAME}} Review!\"'''  - ''Jengar''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Aircraft of comparable role, configuration and era\n\n* Brewster [[F2A-1|F2A]] Buffalo\n* Curtiss [[P-36 (Family)|P-36]] Hawk\n* CAC [[Boomerang Mk I (Great Britain)|Boomerang]]\n* Polikarpov [[I-180S|I-180]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''encyclopedia page on the aircraft;''\n* ''other literature.'' -->\n\n* [[wt:en/news/6503-development-ffvs-j22-settling-the-bill-en|[Development] FFVS J22: Settling The Bill]]\n* [https://web.archive.org/web/20120213150808/http://www.hobbybokhandeln.se/j22/index.htm F.F.V.S. J22 Fighter Aircraft - From a technical perspective - Service in the Swedish Airforce 1943-1952]\n* [[wikipedia:FFVS_J_22|[Wikipedia] FFVS J 22]]\n* [https://forum.warthunder.com/index.php?/topic/474732-j22-2b/ Official data sheet - more details about the performance]\n\n=== References ===\n<references>\n<ref name=\"Langbro\">Langbro, H. (2003, January 15). F.F.V.S. J22 Fighter Aircraft From a technical perspective. Retrieved from https://web.archive.org/web/20120213150814/http://www.hobbybokhandeln.se/j22/pilot.htm.</ref>\n<ref name=\"Fridsell\">Fridsell, M., & Waligorski, M. (2006, September 22). FFVS J 22 in Detail. Retrieved from https://www.ipmsstockholm.org/magazine/2002/01/stuff_eng_detail_j22.htm.</ref>\n<ref name=\"Aceto\">Aceto, G. (2019, July 19). The Saab J21. Retrieved from https://www.historynet.com/the-saab-j21.htm.</ref>\n</references>\n\n{{AirManufacturer FFVS}}\n{{Sweden fighters}}"}}