{"title":"J29D","pageid":7935,"wikitext":{"*":"{{About\n| about = gift Swedish jet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = J29 (Family)\n}}\n{{Specs-Card\n|code=saab_j29d\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_saab_j29d.jpg\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} Swedish jet fighter {{Battle-rating}}. It was introduced as a [[wt:en/news/6444-development-swedish-aircraft-in-war-thunder-saab-j29d-jet-powered-fighter-en|premium pack]] in [[Update 1.93 \"Shark Attack\"]] and was removed from the store after the [[wt:en/news/7417-shop-war-thunder-birthday-sale-in-gaijin-net-store-en|9th Anniversary Sale]].\n\nWhen conjuring up thoughts of fighter jets, many would initially think of a sleek, weapon-laden fast jet which would almost rival a hot-rod in the car world. When presented with the {{PAGENAME}}, most people would cock their head to the side with a puzzled look on their face. It's a good thing that fighter jets are not determined by looks alone! The {{PAGENAME}} is, for lack of a better phrase, a \"wolf in sheep's clothing\", initially laughed at as being the \"chubby kid on the block\". Once up in the air, however, it is quickly realised that this rotund little fighter is a dynamic powerhouse!\n[[File:J29D_004.png|350px|thumb|left|'''{{PAGENAME}}''' in a power climb launching a [[m/49]] unguided rocket.]]\nWhile many other nations were fixated on designing straight-wing aircraft, the Swedes were busy exploiting the knowledge of former Messerschmitt engineers in implementing swept wings onto their fighters. With this and other improvements, the {{PAGENAME}} was an attempt by the Swedish air force at creating a fast climbing bomber-interceptor armed with the deadliest fixed armament for its time. Although it was not supersonic, it could reach speeds above 1060 km/h at certain altitudes. The nose of the aircraft was bristling with four 30 mm autocannons and several types of attack rockets could be mounted beneath its wings. A lesson from WWII was that the best aircraft were the ones capable of performing several roles, and the {{PAGENAME}} is indeed capable of performing more than one role. Depending on the load-out, the {{PAGENAME}} can perform anything from interceptor missions to air superiority missions to high speed attack missions. This functionality makes the J29D extremely versatile and a valuable asset to its team in the game.\n\nIf not kept in check, the {{PAGENAME}} can quickly become the bully on the block hard-charging into the battlefield, wreaking havoc and then departing without a second thought. If two fighters are headed your way, your best bet will be to take out the {{PAGENAME}} first or it will likely nab you in the rear and send you down in flames.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n[[File:J29D_001.png|450px|thumb|right|'''{{PAGENAME}}''' removing one wing at a time on a Me 262.]]\nWhen flying the {{PAGENAME}}, it is hoped that enemy pilots will take one look, chuckle, and not take the rotund Swedish fighter seriously, only to learn the hard way they were wrong. The {{PAGENAME}} has the speed, agility, and ordnance to be considered a powerhouse in the sky. Being outfitted with an afterburning engine, the {{PAGENAME}} can fly upwards of 1,000 km/h and climbs up to altitude at a whipping 55 metres per second. This allows the fighter to get in and out of contested areas to engage its targets of choice. This fighter was built for speed and agility and uses these characteristics to show up other aircraft which may be faster or bulkier, sidestepping their attacks and jumping back in to nab the kill. Thanks to the way the four ADEN cannons are mounted when the {{PAGENAME}} lines up a target and fires, it is almost like a 30 mm shotgun being fired off. A tight spread of 30 mm rounds heads downfield, and when impacting another aircraft, rarely is there enough left of the plane to fly.\n\nThe {{PAGENAME}} is as comfortable up at altitude as it is down at just above ground level. The fighter is a stable platform when it comes to ground attack, with good acceleration characteristics when the time comes to peel off the ground targets and manoeuvre back up to altitude with the other fighters. Being specially designed to reduce as much drag as possible, the swept-back wings help extend the breakage limits of the wings, especially when this fighter is in a dive.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 0 m - sea level)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 1,032 || 1,027 || rowspan=\"2\" | {{Specs|ceiling}} || 29.2 || 30.8 || 48.8 || 45.3 || rowspan=\"2\" | 800\n|-\n! Upgraded\n| 1,048 || 1,040 || 28.7 || 29.0 || 70.6 || 59.0\n|-\n|}\n[[File:J29D_005.png|450px|thumb|right|'''{{PAGENAME}}''' taking on a target-bound Canberra B (I) Mk 6]]\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| ✓ || ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 800 || 575 || 350 || ~11 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 650 || < 640 || < 450 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"5\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | {{Annotation|Basic mass|Mass of the aircraft with pilot and engine oil, but no fuel or weapons load}} || colspan=\"3\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | Svenska Flygmotor RM2B || 1\n| colspan=\"2\" | 4,997 kg || colspan=\"3\" | 286 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"4\" | Mass with fuel (no weapons load) || rowspan=\"2\" | Max Takeoff<br>Weight\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 10m fuel || 20m fuel || 30m fuel || 34m fuel\n|-\n| 1,150 kg || colspan=\"2\" | Afterburning centrifugal-flow turbojet\n| 5,513 kg || 5,991 kg || 6,487 kg || 6,717 kg || 7,080 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB/SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"5\" | Thrust to weight ratio @ 0 m (WEP)\n|-\n! Condition || 100% || WEP\n! 10m fuel || 20m fuel || 30m fuel || 34m fuel || MTOW\n|-\n| ''Stationary'' || 2,070 kgf || 2,881 kgf\n| 0.52 || 0.48 || 0.44 || 0.43 || 0.41\n|-\n| ''Optimal'' || 2,070 kgf<br>(0 km/h) || 3,001 kgf<br>(1,000 km/h)\n| 0.54 || 0.50 || 0.46 || 0.45 || 0.42\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n;Armour\n\n* 64 mm bulletproof canopy windscreen\n* 10 mm steel plate behind pilot's seat\n* 10 mm steel plate in the nose\n\nThe stout little {{PAGENAME}} is a sneaky little fighter which might be underestimated during a head-on. A 64 mm bulletproof windscreen is in place, which, since it is sloped, provides 165 mm total protection, allowing the pilot to have a greater chance of survival in a head-on. However, unless highly experienced, pilots should avoid head-ons, especially against aircraft such as the [[Super Mystere B2]] and the [[G.91 YS]] which also feature 30 mm DEFA 552 cannons. Make sure to avoid the B2 as well, as the AA.20 air-to-air guided rockets will make the {{PAGENAME}} have a hard time standing up to this aircraft.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Akan m/55 (30 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 4 x 30 mm Akan m/55 cannons, nose-mounted (100 rpg = 400 total)\n\nThe {{PAGENAME}}, like many of the fighters of the time, got away from machine guns and was outfitted with harder-hitting autocannons, in this case, 30 mm ADEN cannons. The cannons are clustered around the central air-intake of the aircraft, resulting in optimal fire control as convergence is not an issue. However, the pilot must still correct for bullet drop for the 30 mm rounds. The four ADEN cannons only have 100 rounds per gun, requiring the pilot to exercise trigger control so not to waste ammunition. With these harder hitting rounds, however, only a quick burst is needed to send an aircraft down in a flaming heap.[[File:J29D_006.jpg|400px|thumb|right|'''{{PAGENAME}}''' firing off a [[m/49]] unguided rocket.]]\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|srak m/55 Frida|psrak m/49A|srak m/51|hprak m/49}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 24 x 7,5 cm srak m/55 rockets\n* 14 x 14,5 cm psrak m/49A rockets\n* 14 x 15 cm srak m/51 rockets\n* 4 x 18 cm hprak m/49 rockets\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nAlthough the J29D is a fast jet capable of reaching high speed, at the start it can be pretty slow. The J29D has the chance to fight supersonic jets at its battle rating which it can't hunt down by itself. As such, the J29D is best used in teamwork with other jets to either catch up to the enemy plane or make them do manoeuvres to bleed some speed so the J29D can catch up. If faced with subsonic jets, it can keep up with them and stay on its tail thanks to its manoeuvrability. For the daredevils, the J29D has an excellent armament of choice to do head-ons with. These load outs would be best put to use if no teammate around to help you fight the enemy. Because the J29D has slow acceleration at the start of the game, it can have a hard time intercepting enemies at first. As the battle progresses and you will have worked up speed, this task will be made much easier.\n\nThe J29D can also be used as an excellent ground attacker for more experienced players who are used to aiming unguided rockets. It has a variety of rockets, allowing you to sufficiently take out a wide variety of targets (light, medium, heavy, etc.). With most loads having more than 10 rockets, an experienced player can take out a few ground targets each spawn. Along with the rockets, the four 30 mm guns, given the proper belt choice, can inflict heavy damage upon soft and somewhat hard targets as well.\n\nEven as an excellent fighter, the J92D has dangerous enemies, mainly high-subsonic jets like MiG-17 and anti-air missile firing jets like G.91 YS and Swift F.7.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Fast and agile\n* Multi-role aircraft (fighter/attacker/interceptor)\n* Four nose-mounted 30 mm akan m/55 autocannons\n* Accelerates well in a climb\n* Combat flaps handles speeds up to 800+ km/h.\n\n'''Cons:'''\n\n* Loses its agility at high speeds\n* Tends to be up-tiered against planes which are faster\n* Bleeds through ammunition quickly - requires trigger patience\n* Guns have high recoil which pulls the nose down when firing making aiming and leading harder\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n[[File:J29D_002.jpg|450px|thumb|right|'''{{PAGENAME}}''' cruising the sky looking for targets.]]\n=== Initial development ===\nDuring WWII, Sweden had effectively fallen behind in the development of military aircraft. This was largely due to a severely underdeveloped aircraft engine industry in Sweden which meant that there were no high-end engines available for aircraft production. Thus Sweden was still projecting propeller-driven fighter aircraft in 1945 equivalent to fighters projected by other nations 1-3 years prior. Since it was obvious by 1945 that jet aircraft was the future the Swedish Air Force decided to immediately scrap all propeller-driven fighter projects and instead make the jump to a jet fighter. Sweden's leading aeronautical firm SAAB, who was already actively working with the Swedish Air Force on the previously mentioned propeller fighters, was tasked with projecting this new jet fighter. Several designs were looked at but by mid-1945 it was decided that a mid-high wing aircraft with a central air intake would be the best option. Due to the mid-high wing it was not possible to house the landing gear in the wings. Instead, it was decided to house the landing gear in the fuselage of the aircraft. This concept got the project name R1001, R standing for \"reaktionsmotor\" (reaction engine), the Swedish military term for jet engines.\n\nThe original specifications for the R1001 called for a radar rangefinder, four Bofors 20 mm akan m/45 cannons mounted in the nose with 180 rounds per gun, external fuel tanks and a top speed of 1,000 km/h. The engine was originally supposed to be an indigenous design by the company STAL but by late 1945 Sweden had gotten the green light for acquiring the new state-of-the-art de Havilland Ghost engine. There are several reasons why Sweden was allowed to buy this engine even before it was finished, but the two main factors were the economic state of Britain after the war and Sweden's good relations with the company de Havilland. The engine was however not the only thing which changed at an early stage. Originally the R1001 featured straight wings, as was common at the time. However, by pure luck Sweden was able to acquire some German WWII research papers from a Swiss source regarding swept wings on aircraft and their increased performance at high speeds. Thus it was decided to change the R1001 design to feature swept wings. The first blueprints of the R1001 featuring swept wings were finished by late 1945 and within 3 years a prototype had been constructed and was ready for flight testing. During these 3 years the design would change even further from the original concept. The radar rangefinder was dropped for unknown reasons, and the Bofors cannons were switched for Hispano designs due to delays at Bofors. By 1947 the aircraft had also received the designation J29.\n\n=== Testing and production ===\nThe J29 prototype flew for the first time on the 1st of September 1948 and immediately showed incredible performance. The pilot chosen for this flight was SAAB's test pilot at the time, an Englishmen by the name Robert A. \"Bob\" Moore. He was a British squadron leader with previous experience flying jets and was thus suitable for the tests. The test flight lasted for half an hour and after a successful landing, Moore stated that \"on the ground, it's an ugly duckling, but in the air it's a swift.\" Like many aircraft which pick up a nickname due to a specific feature or shape, the J29 would fairly quickly receive the nickname \"Flygande Tunnan\" (The Flying Barrel) or just \"Tunnan\" (The Barrel) for short. Initially thought of as degrading, the nickname Tunnan would not only become the official name for the aircraft but would also start the SAAB tradition of naming their combat aircraft, a tradition which persists to this day.\n\nAfter correcting a few production errors the prototype would not only achieve the specified top speed of 1,000 km/h but it would even surpass it, achieving a sustainable speed of 1,060 km/h at one point. The design of the J29 showed a lot of promise for the future and talk of future variants would begin even before production had started. In fact, just a month after the prototype had taken to the air, there was talk of implementing attack-rockets and deflatable internal fuel tanks.\n\nProduction of the first J29 variant, the J29A, would commence in 1950 and deliveries to the air force would start in early 1951. It was quickly realized that the internal fuel capacity of the J29A was too limited and work began on implementing the previously discussed internal deflatable fuel tanks. This would be realized in a new version of the J29, designated [[J/A29B|J29B]], which entered production and service in 1953. The J29B's new internal fuel tanks gave it a 50% increase in fuel capacity compared to the J29A. The J29B would be followed by an unarmed reconnaissance version called the S29C which had been planned at an early stage. The S29C was to be followed by the [[J29D]], featuring increased armament and an afterburner, but due to a variety of reasons the J29D never entered production. Instead, a modified version of the J29B, called the J29E, would enter service. The E-variant featured a new dog toothed wing which increased manoeuvrability at high speeds. The J29E was soon followed by the [[J29F]] which was an upgrade-program for 210 J29B and E aircraft, increasing their performance and allowing them to serve throughout the 1960s.\n\nAll in all, 661 J29s would be produced for the Swedish Air Force, the largest production run by SAAB ever. The last of these would serve until the late 1970s.\n\n=== Legacy ===\nThe J29 was a truly historical wonder for its time. After being stranded for the duration of the war, Sweden managed to not only catch up with modern aircraft development in a short amount of time but it was also able to lead jet fighter development in Europe for the time and arguably even into modern times. The J29 was the first swept-wing jet fighter to be mass-produced in Europe and together with the Soviet [[MiG-15]] and American [[F-86A-5|F-86]] it set the bar for how the next generation of fighter aircraft should be. It was extremely fast for its time and actually managed to take home two closed-circuit world speed records during the mid 1950s.\n\nBesides its international legacy, the J29 was the first Swedish-designed aircraft to see combat. In September 1961, as part of the Congo-crisis, five J29Bs were stationed in the Republic of Congo to contribute to a UN peacekeeping mission (ONUC) in the region. This led to the formation of the air wing F 22 which exclusively served in Congo. F 22 was later reinforced by four more J29Bs and two S29C reconnaissance planes in 1962. F 22 would quickly take air superiority in the area which in turn lead to them primarily performing attack-missions during the conflict. No aircraft were lost during the ONUC despite large amounts of ground fire. When the ONUC was terminated in 1964, the aircraft-type had been decommissioned in Sweden and thus it was decided to only send home a select few J29s to Sweden. The majority of the F 22 J29s were blown up on the spot in Congo when the Swedish left the area.\n\n=== J29D ===\nEven before production of the [[J29A]] had started in the late 1940s, the Swedish Air Force started to discuss the use of an afterburner in the J29. While the J29 was very advanced for its time, it became clear pretty early on that it did not have the climb rate needed to effectively intercept high altitude strategic bombers. To solve this it was decided to start projecting an indigenous afterburner for the J29. SFA (Svenska Flygmotor AB, today Volvo Aero), who was license-producing the de Havilland Ghost engine was tasked to develop an afterburning version of it. After initial calculations it was concluded that the new afterburner would increase power by ~25% and double the climb rate.\n\nBesides introducing an afterburner there was also a lot of talk about increasing the armament of the J29. Several ideas were brought up, everything from anti-air missiles to anti-air rockets to more powerful guns. In the end it was decided that all 3 ideas would be tested. Since there were a few 30 mm aircraft guns on the international market by the start of the 1950s, it was decided to trial the new J29 with new guns first. Thus, in April 1952, a [[J29A]] from air wing F 13 was sent to the Swedish Air Force experimental bureau Försökscentralen (FC) to be fitted with mockups of 30 mm guns for flight testing. Flight testing with mockups was performed as the barrels of the new 30 mm guns were protruding out from the front of the J29 which could interfere with flight characteristics. After 4 months of successful flight trials completed, the aircraft was restored and sent back to air wing F 13.\n\nAbout 2 years later, the afterburning Ghost engine was finished and it was decided to install it in the [[J/A29B|J29B]] prototype, then becoming the J29D prototype. The J29D prototype flew for the first time on the 20th of March, 1954. Initial flight trials were apparently successful, however during trestle-mount ground trials in 1954 it was found that the 30 mm guns selected for the J29D were flawed and the idea to use these was scrapped. Instead it was decided that anti-air rockets and missiles were the way to go. SAAB at this time had also projected a new wing for the J29, a so-called dog-tooth wing which improved airflow and handling. It was decided that all future J29s would feature this dog-tooth wing and thus the J29D project was scrapped. Instead, it was decided to make an afterburning J29 with the new dog-tooth wings. Unfortunately as production of the afterburning Ghost engine was not ready yet it was decided to introduce the new dog-tooth wing first in an intermediate version called the J29E, which consisted of J29Bs being modified in the factory or in the field with the new wings. The plan was to later retrofit 210 of the J29B and J29E models with dog-tooth wings and afterburning Ghost engines, turning them into J29Fs.\n\nLuckily this was not the end for the J29D prototype, in order to test the J29F concept it was decided to modify the J29D prototype into the J29F prototype. Modifications were done by early February 1955 and the J29F prototype was approved for service in April the same year. The same year, Bofors would finalize the projected anti-air rockets which entered service on the J29B, E and F as the 75 mm [[Srak m/55 Frida|srak m/55]]. In 1956, the legacy of the J29D would end, as the J29F entered service.\n\n===[[wt:en/news/6444-development-swedish-aircraft-in-war-thunder-saab-j29d-jet-powered-fighter-en|Devblog]]===\n\nWhile Sweden traditionally imported a great deal of military tech, including in its aircraft, Swedish aeronautical engineers nevertheless developed and built combat aircraft of their own design. Like the leading world powers, in the immediate post-war years Sweden focused its research capabilities on jet-powered aircraft. Even before the outbreak of World War II, research into jet engines was already taking place in Sweden, and the war gave industry experts the opportunity to acquire priceless experience studying the progress made by other countries, Germany in particular.\n\nAt the beginning of 1945, a project to build the first jet-powered fighter was born deep in SAAB headquarters. Immediately after the end of the war, Swedes bought the license to produce turbojet engines from the British company de Havilland, and they began converting their J-21 piston-engine fighters to jet-engine fighters. With the arrival of the new Ghost engine from the Brits and promising research into swept wings, SAAB began developing a fundamentally new kind of fighter, initially planned to be fitted with a jet engine. Within a short time, the Swedish Air Force received the J29 Tunnan. Named after the Swedish word for \"barrel\", based on its shape.\n\nThe Tunnan was an awkward-looking machine, but one with superb flight characteristics for the time, enabled by its swept wings. Judge for yourselves: successful testing took place in 1948, followed by mass production in 1951, and by 1954 the J29B modification set the world speed record in a closed circuit. That's impressive!\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Images\n<gallery mode=\"packed\" heights=\"200\">\nFile:J29D_WTWallpaper_001.jpg\nFile:J29D_WTWallpaper_002.jpg\nFile:J29D_WTWallpaper_003.jpg\nFile:J29D_WTWallpaper_004.jpg\nFile:J29D_WTWallpaper_005.jpg\nFile:J29D_WTWallpaper_006.jpg\n</gallery>\n\n;Videos\n{{Youtube-gallery|YD22i7Y8wHg|'''Saab 29 Tunnan''' - ''jaglavaksoldier''|Xd9m6rPtN3U|'''The Shooting Range #172''' - ''Pages of History'' section at 04:57 discusses the Saab J29 Tunnan.|hpPYamqFsO8|'''Premium Vehicles: SAAB J-29D''' - ''War Thunder Wiki''}}\n{{break}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Other variants\n\n* [[J29A]]\n* [[J/A29B]]\n* [[J29F]]\n\n;Comparable aircraft\n\n* [[M.D.450B Ouragan]]\n* [[Super Mystere B2]]\n* [[Hunter F 1]]\n* [[MiG-9]]\n* [[MiG-15]]\n* [[F-86 (Family)|F-86]]\n* [[La-15]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''encyclopedia page on the aircraft;''\n* ''other literature.'' -->\n\n* [[wt:en/news/6444-development-swedish-aircraft-in-war-thunder-saab-j29d-jet-powered-fighter-en|[Devblog] SAAB J 29D Jet Powered Fighter]]\n* [https://www.militaryfactory.com/aircraft/detail.asp?aircraft_id=224 (militaryfactory.com website) - Saab J29 Tunnan (Barrel) - Single-seat jet-powered fighter aircraft]\n* [https://www.fighter-planes.com/info/j29.htm (fighter-planes.com website) - J29 Tunnan SAAB]\n* [http://plasticfantastique.com/walk_arounds/walkaround-the-saab-29-tunnan/ (plasticfantastique.com websites) - Walk around the SAAB 29 Tunnan (Picture gallery)]\n* [https://forum.warthunder.com/index.php?/topic/468660-saab-j-29d/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Saab}}\n{{Sweden jet aircraft}}\n{{Sweden premium aircraft}}"}}