{"title":"J29F","pageid":8981,"wikitext":{"*":"{{About\n| about = Swedish jet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = J29 (Family)\n}}\n{{Specs-Card\n|code=saab_j29f\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Swedish jet fighter {{Battle-rating}}. It was introduced in [[Update 1.95 \"Northern Wind\"]].\n\nThe J29F is the final variant of the J29 \"Tunnan\" family, combining excellent engine performance, and manoeuvrability for a well-rounded fighter at its battle rating. It is the only J29 able to be outfitted with the [[Rb24]] air-to-air missiles.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\nThe J29F will come off as heavy and quite sluggish for any pilots new to the plane. But when the J29F gets upgraded with suspended armaments and better performance, the plane starts to feel a bit more capable. The superior roll rate and vertical energy come in handy in many situations, and with two Rb24 air-to-air missiles, the J29F becomes a threat to most enemies in the sky. The J29F can be described as a \"Jack of all trades\" in many areas. Even if the J29F is outclassed in every area by some vehicle, a pilot who knows their enemies will find a way to outperform them in this plane. Players with previous experience in the [[J29A]] or [[J/A29B]] will most likely find the new afterburner a welcome upgrade to the vehicle. The RM2B engine carries this plane in any direction the pilot wishes and significantly improves the acceleration. However, just like all the other J29 variants, the J29F suffers from bad defensive capabilities. While many opponents find it easy to get rid of people behind them, the J29F has a hard time both losing energy and manoeuvring in different directions. This makes it difficult to get rid of opponents following close behind, which should always be taken into consideration when planning an attack.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 0 m - sea level)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 1,032 || 1,026 || rowspan=\"2\" | {{Specs|ceiling}} || 29.3 || 30.7 || 48.7 || 45.1 || rowspan=\"2\" | 800\n|-\n! Upgraded\n| 1,048 || 1,040 || 28.7 || 29.0 || 70.6 || 59.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| ✓ || ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 800 || 575 || 350 || ~11 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 650 || < 640 || < 450 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"5\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | {{Annotation|Basic mass|Mass of the aircraft with pilot and engine oil, but no fuel or weapons load}} || colspan=\"3\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | Svenska Flygmotor RM2B || 1\n| colspan=\"2\" | 5,017 kg || colspan=\"3\" | 279 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"4\" | Mass with fuel (no weapons load) || rowspan=\"2\" | Max Takeoff<br>Weight\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 10m fuel || 20m fuel || 30m fuel || 34m fuel\n|-\n| 1,150 kg || colspan=\"2\" | Afterburning centrifugal-flow turbojet\n| 5,533 kg || 6,011 kg || 6,507 kg || 6,737 kg || 7,080 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB/SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"5\" | Thrust to weight ratio @ 0 m (WEP)\n|-\n! Condition || 100% || WEP\n! 10m fuel || 20m fuel || 30m fuel || 34m fuel || MTOW\n|-\n| ''Stationary'' || 2,070 kgf || 2,881 kgf\n| 0.52 || 0.48 || 0.44 || 0.43 || 0.41\n|-\n| ''Optimal'' || 2,070 kgf<br>(0 km/h) || 3,001 kgf<br>(1,000 km/h)\n| 0.54 || 0.50 || 0.46 || 0.45 || 0.42\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n[[File:Protection J29F.png|thumb|Armour found inside the J29F.]]\nThe J29F is outfitted with 3 armour plates spread out in different areas of the plane. The most important of which being the bulletproof glass of 64mm, which will save the pilots' life in most head-ons. The J29F is quite strong in terms of survivability, being able to tank a lot of low-calibre shells without much damage. This can help a J29F pilot stay in battle far longer than usual, or return to base safely. It is important, however, to avoid incoming damage since surviving incoming shells should never be expected as \"survivable\". Many shells will set the J29F on fire, knock out its engine, and destroy the tail section. All of which will by themselves put the J29F out of combat.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Akan m/47C (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 4 x 20 mm Akan m/47C cannons, chin-mounted (180 rpg = 720 total)\n\nThe firepower is the same as on all the other J29 variants found in the tech tree. The Swedish Akan m/49C is a somewhat potent 20 mm cannon that is comparable to the AN/M3 cannons found on the F9F-8. This gun can be experienced as weak when compared to 30 mm revolver cannons found at the same battle rating. But despite requiring a longer gun time, the high ammo count of 720 rounds will significantly help people who feel less comfortable with their aim.\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|RB24|srak m/55 Frida}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 24 x 7,5 cm srak m/55 Frida rockets\n* 2 x RB24 missiles\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\n==== Fighting different enemies ====\nIn Realistic Battles, the J29F is similar in playstyle to that of a [[MiG-15bis]], while still sharing some similarities to the [[F-86F-25|F-86F-25 Sabre.]] A J29F keeps energy very well when the afterburner is used, giving it a strong rate of climb and acceleration. This means the J29F can easily energy fight most enemies it encounters. However, the J29F should never be seen as a one-trick pony. When coming face-to-face against stronger and faster opponents, energy tactics can no longer be used. In that case, it can be better to use the superior turn- and roll-rate, to avoid incoming attacks from above. If missiles are researched, these enemies will most likely be forced to leave you alone since they have a hard time dodging the 10g pull of the Rb24.\n\nIt is very important to know your enemies when using the J29F, to apply the right tactics against them. It is strongly recommended to look up the strengths and weaknesses of different opponents it may face. The J29F is never the strongest in any area but is always better than its enemy in one or two areas, which should always be exploited.\n\n==== Using the Rb24 ====\nThe J29F is the only J29 \"Tunnan\" equipped with air-to-air missiles. The Rb24 is a license-built variant of the American Aim-9B missile. This missile is one of the key upgrades the J29F can use to its advantage. The Rb24 tracks enemies quite poorly. Despite this, the missile forces faster opponents to extend, and unaware opponents to combust. The missile gives the J29F more ways to deal with enemies, at a slight performance cost.\n\nWhen using these missiles in battle, it can be useful to go for a Side-rushing strategy. This will put the plane in a superior energy situation if combined with climbing. This strategy helps the missile the most since it lets the J29F appear behind enemies, to launch the Rb24 when they're busy. It can also be important to get rid of the suspended armament as soon as possible, to improve the overall flight performance. Missiles shouldn't be wasted, however, since they help in dealing with faster targets. The Rb24 isn't very good at turning but can easily eliminate fighters climbing upwards, or those travelling at slow speeds. The optimal launch distance for the Rb24 is between 1 and 3 km.\n\n==== Rushing ====\nIn Realistic Battles, a fairly common strategy is the so-called \"rush\" strategy. During a rush, a jet pilot will maximize speed rather than altitude, trying to intercept enemy players who won't expect them. The rush strategy can be used in the J29F to a certain degree. Since the J29F has an average top speed, getting to the enemy team can be done quite swiftly. It's however, still recommended to gain some altitude since speed won't be lost when pushing the plane slightly upwards.\n\nThe rush strategy can allow a J29F pilot to easily shoot down planes who don't expect it and works wonders when paired with some altitude. The only downside is that the J29F might be attacked by an overwhelming amount of enemies, forcing the J29F to play defensively. This is why the Rush strategy is recommended to pilots who have friends or teammates to back them up since it's very difficult to win a defensive situation.\n\n==== Side-rushing ====\nA more effective strategy in Realistic Battles is a side rushing strategy. This strategy is executed the same way as the rush strategy, except the jet is flown more towards the side, giving you extra time to gain speed. The J29F has no problem accelerating but dislikes being forced into a defensive situation. This strategy can be paired with a slight altitude gain to put the J29F in a superior position. Although the J29F won't be the first one to the battlefield, it will be able to down more planes by keeping people away from its back. A pilot should still be aware of his/her surroundings, in case the enemy decides to take a similar route.\n\nThe side-rushing strategy also improves the usefulness of the Rb24 air-to-air missiles. The side-rush can be utilized to end up behind the enemy team, making good use of the Rear-Aspect lock technique. However, these attacks are usually achieved when fighting against unaware players.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Strong energy retention\n* Superior roll-rate compared to other jets it faces\n* High ammo count\n* Fast acceleration\n* Tough airframe being able to tank shots\n* Two RB24 air-to-air missiles\n\n'''Cons:'''\n\n* Mediocre top speed\n* Sluggish tail controls - weak when flown defensively\n* Underwhelming firepower - requires more gun time than the J29D\n* Short landing gear - becomes difficult to land when damaged\n* Tiny air-brakes - Makes it difficult to force an overshoot\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n=== Initial development ===\nDuring WWII, Sweden had effectively fallen behind in the development of military aircraft. This was largely due to a severely underdeveloped aircraft engine industry in Sweden which meant that there were no high-end engines available for aircraft production. Thus Sweden was still projecting propeller-driven fighter aircraft in 1945 equivalent to fighters projected by other nations 1-3 years prior. Since it was obvious by 1945 that jet aircraft was the future the Swedish Air Force decided to immediately scrap all propeller-driven fighter projects and instead make the jump to a jet fighter. Sweden's leading aeronautical firm SAAB, who was already actively working with the Swedish Air Force on the previously mentioned propeller fighters, was tasked with projecting this new jet fighter. Several designs were looked at but by mid-1945 it was decided that a mid-high wing aircraft with a central air intake would be the best option. Due to the mid-high wing it was not possible to house the landing gear in the wings. Instead, it was decided to house the landing gear in the fuselage of the aircraft. This concept got the project name R1001, R standing for \"reaktionsmotor\" (reaction engine), the Swedish military term for jet engines.\n\nThe original specifications for the R1001 called for a radar rangefinder, four Bofors 20 mm akan m/45 cannons mounted in the nose with 180 rounds per gun, external fuel tanks and a top speed of 1,000 km/h. The engine was originally supposed to be an indigenous design by the company STAL but by late 1945 Sweden had gotten the green light for acquiring the new state-of-the-art de Havilland Ghost engine. There are several reasons why Sweden was allowed to buy this engine even before it was finished, but the two main factors were the economic state of Britain after the war and Sweden's good relations with the company de Havilland. The engine was however not the only thing which changed at an early stage. Originally the R1001 featured straight wings, as was common at the time. However, by pure luck Sweden was able to acquire some German WWII research papers from a Swiss source regarding swept wings on aircraft and their increased performance at high speeds. Thus it was decided to change the R1001 design to feature swept wings. The first blueprints of the R1001 featuring swept wings were finished by late 1945 and within 3 years a prototype had been constructed and was ready for flight testing. During these 3 years the design would change even further from the original concept. The radar rangefinder was dropped for unknown reasons, and the Bofors cannons were switched for Hispano designs due to delays at Bofors. By 1947 the aircraft had also received the designation J29.\n\n=== Testing and production ===\nThe J29 prototype flew for the first time on the 1st of September 1948 and immediately showed incredible performance. The pilot chosen for this flight was SAAB's test pilot at the time, an Englishmen by the name Robert A. \"Bob\" Moore. He was a British squadron leader with previous experience flying jets and was thus suitable for the tests. The test flight lasted for half an hour and after a successful landing, Moore stated that \"on the ground, it's an ugly duckling, but in the air it's a swift.\" Like many aircraft which pick up a nickname due to a specific feature or shape, the J29 would fairly quickly receive the nickname \"Flygande Tunnan\" (The Flying Barrel) or just \"Tunnan\" (The Barrel) for short. Initially thought of as degrading, the nickname Tunnan would not only become the official name for the aircraft but would also start the SAAB tradition of naming their combat aircraft, a tradition which persists to this day.\n\nAfter correcting a few production errors the prototype would not only achieve the specified top speed of 1,000 km/h but it would even surpass it, achieving a sustainable speed of 1,060 km/h at one point. The design of the J29 showed a lot of promise for the future and talk of future variants would begin even before production had started. In fact, just a month after the prototype had taken to the air, there was talk of implementing attack-rockets and deflatable internal fuel tanks.\n\nProduction of the first J29 variant, the J29A, would commence in 1950 and deliveries to the air force would start in early 1951. It was quickly realized that the internal fuel capacity of the J29A was too limited and work began on implementing the previously discussed internal deflatable fuel tanks. This would be realized in a new version of the J29, designated [[J/A29B|J29B]], which entered production and service in 1953. The J29B's new internal fuel tanks gave it a 50% increase in fuel capacity compared to the J29A. The J29B would be followed by an unarmed reconnaissance version called the S29C which had been planned at an early stage. The S29C was to be followed by the [[J29D]], featuring increased armament and an afterburner, but due to a variety of reasons the J29D never entered production. Instead, a modified version of the J29B, called the J29E, would enter service. The E-variant featured a new dog toothed wing which increased manoeuvrability at high speeds. The J29E was soon followed by the [[J29F]] which was an upgrade-program for 210 J29B and E aircraft, increasing their performance and allowing them to serve throughout the 1960s.\n\nAll in all, 661 J29s would be produced for the Swedish Air Force, the largest production run by SAAB ever. The last of these would serve until the late 1970s.\n\n=== Legacy ===\nThe J29 was a truly historical wonder for its time. After being stranded for the duration of the war, Sweden managed to not only catch up with modern aircraft development in a short amount of time but it was also able to lead jet fighter development in Europe for the time and arguably even into modern times. The J29 was the first swept-wing jet fighter to be mass-produced in Europe and together with the Soviet [[MiG-15]] and American [[F-86A-5|F-86]] it set the bar for how the next generation of fighter aircraft should be. It was extremely fast for its time and actually managed to take home two closed-circuit world speed records during the mid 1950s.\n\nBesides its international legacy, the J29 was the first Swedish-designed aircraft to see combat. In September 1961, as part of the Congo-crisis, five J29Bs were stationed in the Republic of Congo to contribute to a UN peacekeeping mission (ONUC) in the region. This led to the formation of the air wing F 22 which exclusively served in Congo. F 22 was later reinforced by four more J29Bs and two S29C reconnaissance planes in 1962. F 22 would quickly take air superiority in the area which in turn lead to them primarily performing attack-missions during the conflict. No aircraft were lost during the ONUC despite large amounts of ground fire. When the ONUC was terminated in 1964, the aircraft-type had been decommissioned in Sweden and thus it was decided to only send home a select few J29s to Sweden. The majority of the F 22 J29s were blown up on the spot in Congo when the Swedish left the area.\n\n=== J29F ===\n[[File:Airborne J29F.jpg|thumb|Airborne J29F from the 15th Air Division]]\nThe J29F was an upgrade-program spanning from 1956 to 1958, in which 210 [[J/A29B|of the J29B]] and J29E models were upgraded to F-standard. F-standard meant that the aircraft would be equipped with new dog-tooth wings originally introduced on the J29E but also the afterburning engine of the scrapped [[J29D]] project.\n\nThe J29F was an important step in prolonging the service life of the J29. Being an aircraft with its roots from 1945, the basic J29 was about to become obsolete by the early 1960s. By upgrading them to F-standard they would still be usable throughout the 1960s. This was increased in 1961 when the J29F was modified to carry [[RB24|RB24B]] (AIM-9B) sidewinder air-to-air missiles, allowing them to attack high altitude bombers from behind. Previously the idea was to attack bombers head-on using 75 mm [[Srak m/55 Frida|srak m/55]] rockets. The J29F came to see service with sidewinders all the way to 1978. It was finally decommissioned in 1978, 27 years after the initial type entered service.\n\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=saab_j29f Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|_06O0_ogQ0k|'''Stubby Stick is Fine! J29F - Sweden -  Review!''' - ''Jengar''|UP7fWALr7OM|'''Powerful Swedish Barrel With Missiles: J29F''' - ''Spit_flyer''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n'''Comparable aircraft'''\n\n* [[FJ-4B]] \n* [[MiG-15 (Family)]]\n* [[Swift F.7]]\n* [[Shenyang F-5]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wikipedia:Saab_29_Tunnan|[Wikipedia] Saab 29 Tunnan]]\n\n{{AirManufacturer Saab}}\n{{Sweden jet aircraft}}"}}