{"title":"Ju 87 G-1","pageid":260,"wikitext":{"*":"{{About\n| about = German strike aircraft '''{{PAGENAME}}'''\n| usage = other versions\n| link = Ju 87 (Family)\n}}\n{{Specs-Card\n|code=ju-87g_1\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} German strike aircraft {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27.\n\nThe difference between the G-1 and G-2 variants is the type of wing utilized. The G-1 employs the same wing type as the [[Ju 87 D-3]] while the G-2 instead utilizes the same wing area as the [[Ju 87 D-5]] variant.\n\nRegarded highly by famed German ace Hans-Ulrich Rudel, the Ju 87 G is one of the deadliest ground attack aircraft in War Thunder. Building upon the classic \"Stuka\" design, German engineers fitted a pair of Bordkanone 37 mm cannons to early Ju 87 D models, creating a beast. Instead of bombs, this aircraft utilizes its twin synchronized 37 mm anti-tank cannons to demolish any armour it faces. Able to fire the German 37 mm high-velocity armour piercing round, the Ju 87 G is more than a force to be reckoned with. Unfortunately, each cannon only holds 12 rounds of ammunition each, for a total of 12 individual shots. This puts a cap on how much total damage the Ju 87 G can do.\n\nThe Ju 87 G's armament, a pair of Bordkanone BK 3,7 cannons, are deadly in all regards. They are able to destroy most ground units and aircraft with a single press of the trigger. Equip air targets or armoured targets belt depending on what your target is. The armoured targets belt is fairly ineffective against aircraft and the air targets belt does next to nothing to armoured ground units.\n\nThe Ju 87 G-1 differs from its later counterpart, the [[Ju 87 G-2]] in that it utilizes the earlier D models such as the [[Ju 87 D-3]]. The G-2 model uses the later [[Ju 87 D-5]] model.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 363 || 352 || rowspan=\"2\" | {{Specs|ceiling}} || 33.8 || 36.0 || 9.0 || 8.9 || rowspan=\"2\" | 513\n|-\n! Upgraded\n| 398 || 380 || 30.4 || 32.0 || 14.8 || 11.6\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| X || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || N/A || 454 || 320 || ~10 || ~4\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 270 || < 350 || < 380 || > 325\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 4,000 m || 1,180 hp || 1,390 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 4 mm Steel - Under engine plate\n* 4 mm Steel - Cockpit tub\n* 4 mm Steel - Rear gunner plate\n* 4 mm Steel - Rear glass plates\n* 8 mm Steel - Behind pilot's chair\n* 8 mm Steel - Headrest\n* 50 mm Bulletproof Glass\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nUnlocking the 37 mm belts is a must for this aircraft. The default belt is a mix of HE and AP rounds, resulting in only half of the trigger pull hitting what you want. Instead of staggering the rounds one trigger pull is HE one trigger pull is AP, it is mixed. After that, it matters not which way the Stuka pilot researches his or her modules.\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|BK 3.7 (37 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 37 mm BK 3.7 cannons, wing-mounted (12 rpg = 24 total)\n\n=== Defensive armament ===\n{{Specs-Avia-Defensive}}\n<!-- ''Defensive armament with turret machine guns or cannons, crewed by gunners. Examine the number of gunners and what belts or drums are better to use. If defensive weaponry is not available, remove this subsection.'' -->\n{{main|MG 81 (7.92 mm)}}\n\nThe '''''{{PAGENAME}}''''' is defended by:\n\n* 2 x 7.92 mm MG 81 machine gun, dorsal turret (1,000 rpg = 2,000 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe Stuka has always been famous for its ground strike capabilities. The Stuka G-1 is no exception; with twin 37 mm Bordkanone, destructive power is at your command. However, the Stuka G-1 cannot be used to hunt bombers or fighters: you can try, but the results will be disappointing.\n\n(The guns have a convergence range of 700 m with vertical targeting on)\n\nIn simulator battles, before delving into basic attacking procedure, it is recommended to trim the aircraft before anything else (once after taking off). This is to ensure the ease of aiming the turret gun, as that is your only 'offensive' weaponry. (Elevation -10%, Rudder around -1 ~ -2%?)\n\nAfter taking off and trimming, fly to around 600 m above ground and lower throttle to around 80% ~ 90%. Avoid any AAA zones as much as possible, as your plane is no IL-2. Use your slow speed to your advantage to spot any possible ground targets.\n\nOnce a potential target is spotted, increase throttle to 95%. It is best that the angle of attack is shallow and maintain a speed 300km/h and above. When climbing after an attack, it is recommended to shallow climb, as it increases the distance between the Stuka and the target, allowing better readjustments and maintaining high energy to turn. Coming in at a shallow angle of attack is important because the AI tanks may bounce shells at high angles, so coming in at a shallow angle of attack reduce the chances of these ricochets from occurring.\n\nWhen attacking, always have your Stuka fly towards the direction that is in path of the ground target. It is not recommended to 'chase' the target as that will bleed energy. Unlike the Hs. 129, the Stuka G-1 does not have forward firing light machine guns to help guide your shots, so it is best to practice a lot in custom battles on tank missions with AI tanks.\n\nFor beginners, it is best to make a habit of \"one shot per run\", as firing multiple times to make a hit are wasteful and risky. Remember, the plane essentially have two anti-tank guns that fires at the same time, meaning firing multiple times will reduce energy and increase risk of stall. So, if a pair of shots miss, control your urge: let go, pull up, WEP, climb, level, build energy, and try again.\n\nThe greater threat is not the ground AAs nor the enemy plane: it is the lack of patience. Have composure, memorize the mistakes, and adapt.\n\nIf an enemy plane comes towards the area of operation, ignore the enemy. Completing the Stuka's job as the objective is more important. Try your very best to squeeze in a few more grounded targets with a clear mind, as it will contribute with your Spawn Points and economy. Dealing with the enemy should be done after the objective is completed or the ammunition runs out.\n\nIt is understandable that many players want to start flying their desired fighters, but a sloppy job will contributes nothing to your team and yourself. The plane is also rewarding on good runs, so try your best. The plane may be cheap, but repeating the process is very taxing on motivation.\n\nAll planes armed with high calibre tank guns requires one virtue to be effective and this plane is no exception to it: patience.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Not auto controlled || Controllable<br>Auto control available || Controllable<br>Auto control available || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Impressive turn rate at high speeds\n* Armour plates around the pilot, gunner, and engine\n* Powerful cannons, light pillboxes and medium, light, and heavy tanks can be destroyed with a few shells\n* The \"Armoured targets\" belt has a high muzzle velocity, you don't have to lead targets as much\n* Good defensive turret\n* Two or sometimes even one well placed hit to an enemy fighter is usually enough to destroy them, or cause them to crash\n\n'''Cons:'''\n\n* Bad high altitude performance\n* Very slow\n* Incredibly slow roll rate, especially at high speeds\n* Lacks any fast-firing offensive armament, making engagements with a fighter difficult\n* Cannons are mounted under the wing which makes it hard to aim\n* Very little cannon ammunition\n* Inability to equip bombs or rockets\n* Cannons have a tendancy to shake the entire aircraft when fired rapidly, making it difficult to hit targets precisely\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nBy 1942, the need for a new ground attack aircraft was ever present. The ageing Ju 87 was proving to be obsolete, and the new Henschel Hs 129 was underpowered and ill-protected. Hans-Ulrich Rudel, a Stuka ace, proposed a pair of 37 mm cannons be added to a Ju 87 D. Thus, the \"Kanonenvogel\" or \"cannon-bird\" was born. The Ju 87 G was most famously piloted by Rudel himself, who destroyed a countless amount of Soviet equipment with it. Hans-Ulrich Rudel was the only person to be awarded the Knight's Cross of the Iron Cross with Golden Oak Leaves, Swords and Diamonds, one of Germany's highest awards. The highest-scoring ace of World War II, Erich Hartmann, also held the Knight's Cross of the Iron Cross with Oak Leaves, Swords and Diamonds – but his Oak Leaves were not gold. Rudel survived the war and his input was used to create the A-10 Thunderbolt attack aircraft.\n\n=== In-game description ===\nBy early 1943 the Luftwaffe, or rather the whole German army at the Eastern Front, faced a critical problem fighting Soviet armoured forces. The equipment intended to stop the \"Soviet steam roller\" included a special anti-tank version of the Stuka that appeared in late 1942.\n\nThe first anti-tank variant, the Ju 87 G-1, was based on the Ju 87 D-3 variant. The main distinction of the G-1 was that it had two containers fitted under the wings to house 37 mm Bordkanone BK 3.7 cannons (an airborne version of the Rheinmetall Flak 18 anti-aircraft gun), with 6 rounds each. The shells were kept in magazines protruding beyond the sides of the container. The long-barrelled anti-aircraft gun brought the tungsten-core sabots to an initial velocity of 1,170 m/s, allowing the gun to be fired at a distance of about 800 m. This was quite sufficient to pierce the rear or upper plating of the T-34 tank.\n\nWhen D-3s were converted to G-1s, the wing-mounted machine guns and the bomb racks were removed. The aircraft's armour was weakened. Unlike those on the standard Ju 87 D-3, the radio operator/gunner's station, the fuel tanks in the centre wing section, and the radiator were not armoured on the anti-aircraft Stuka.\n\nTests showed that the Ju 87 G-1's speed was reduced by 30-40 km/h and its manoeuvrability was noticeably impaired, which, in addition to its weakened armour and poor defensive armament, made the machine almost a perfect target for fighter attacks. Due to the aircraft's poor longitudinal stability, it was difficult to aim. The BK 3.7 cannon had quite a low rate of fire and a low reliability as far as its automatic equipment was concerned. In fact, for a Ju 87 G, success on the battlefield was possible only if it was flown by an experienced pilot and only if enemy anti-aircraft gunners and fighters provided little opposition.\n\nHowever, if operated by an experienced gunner, the Gustav was able to hit the tank's most vulnerable parts, such as its engines, fuel tanks, and ammunition stowage bins. This was the reason why the Ju 87 G-1's tests were considered successful, and the military came to the conclusion that the prospect of its use in combat was reasonable, since the situation was hopeless otherwise, as there were no other aircraft anywhere near suitable for fighting tanks.\n\nProduction Ju 87 D-3s were converted to G-1s on site by the troops. For this conversion, the cannon-housing containers could be easily removed and replaced with standard bomb racks. None of the aircraft had dive flaps, but the brackets to fit them remained. A total of about 40 machines were converted in this fashion.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=ju-87g_1 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|owYlJZ4LgyA|'''The Shooting Range #36''' - ''Pages of History'' section at 06:02 discusses the Ju 87 Stuka.}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Similar aircraft sporting large-calibre anti-tank guns\n* [[Ju 87 G-2]]\n* [[IL-2-37]]\n* [[Tempest Mk V (Vickers P)]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/161910-junkers-ju-87-g-1/ Official data sheet - more details about the performance]\n* [[wikipedia:Junkers_Ju_87#Ju_87G|[Wikipedia] Junkers Ju 87 G]]\n\n{{AirManufacturer Junkers}}\n{{Germany strike aircraft}}"}}