{"title":"Ki-10-II C","pageid":581,"wikitext":{"*":"{{About\n| about = Japanese fighter '''{{PAGENAME}}'''\n| usage = other variants\n| link = Ki-10 (Family)\n}}\n{{Specs-Card\n|code=ki_10_2_commander\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a gift rank {{Specs|rank}} Japanese biplane fighter {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27. The Ki-10-II C is no longer acquirable in the game but is retained by those who have obtained it before its removal.\n\nThe Ki-10-II C is a biplane fighter for Rank 1 Japan. Like most biplanes, the KI-10-II C has a low top speed, good turn rate, good-to-fair climbing ability, nearly no armour, and, in realistic and simulator battles, a ridiculously short take-off length. Compared to other biplanes, the Ki-10-II C is faster and climbs far better, but in turn, has inferior armament and armour.\n\nThe Ki-10-II C's low speed and tight turning ability make it a great turn-fighter, like most Japanese light fighters. The Ki-10 excels at low and slow turn fighting at very low altitudes where enemies cannot out-dive it. Additionally, it has a climb rate to climb away from enemy biplanes. Very fast dives should be avoided, as the wings will shear off at very high speeds. Similarly, turning stalls should be avoided, as the Ki-10 has a tendency to enter uncontrollable spins.\n\nIt's twin 7.7 mm armament is the weakest in the game, as it has a lower fire rate than its contemporaries, the ShKAS, Browning, and MG 17. The belts are poor as well; stealth is most recommended, as it has the most AP-derivative shells. Strafing attacks on all but the least armoured targets are not recommended; Artillery, Vehicles, and Landing Craft are good and soft targets, while the Ki-10-II C's weak construction makes attacking AAA and bombers risky. All bombers are pretty much invulnerable to the Ki-10 (SB 2, Do 17, etc.) unless a lucky round knocks out the pilot. Cargo Ships, Tanks and pillboxes are also invulnerable to the Ki-10-II C. Instead, the best Ki-10 targets are other biplanes or slow monoplanes, such as [[P-26 (Family)|P-26]]s, Furies and Nimrods. Aim for the wings. The fuselages of all planes will absorb the Ki-10's shells like a sponge. Like most other planes, the Ki-10-II C works best in numbers. Ki-10 pilots should focus primary on sticking together and working as a team.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 384 || 377 || rowspan=\"2\" | {{Specs|ceiling}} || 16.4 || 17.1 || 11.1 || 11.1 || rowspan=\"2\" | 232\n|-\n! Upgraded\n| 419 || 402 || 15.8 || 16.0 || 22.0 || 15.7\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| X || X || X || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || N/A || N/A || N/A || ~11 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 320 || < 320 || < 320 || > 200\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 3,500 m || 800 hp || 944 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* No armour plating\n* No armour glazing\n* All critical components located in front of aircraft (fuel, pilot, engine, controls)\n\nLike many biplanes before and contemporaries of the {{PAGENAME}}, armour was not an option, survival was based on the pilot's grit. Armour added weight, weight the early biplanes could not afford to carry and still be a viable fighter. Flying in open cockpit and fabric-covered aircraft, the only protection the pilot had was to place his engine between him and his enemy, otherwise, the pilot was vulnerable. Typically aircraft like this have the engine at the nose of the aircraft, followed by the fuel tank and then the cockpit, all three critical components relatively crammed together. The pilot's toolbox had to contain situational awareness as he needed to know where the enemy was around him. Tracer rounds could easily ignite the fabric-covered aircraft or large fuel tanks, so it was imperative the pilot was the attacker, not the one being attacked and knowing where the enemies are at can help avoid getting shot at.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nFor such low-rank vehicles the order of research does not really matter. Improvements in firepower by new belts and new machine guns help a lot in arcade battles. For realistic mode, performance upgrades are more often necessary.\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Type 89 (7.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 7.7 mm Type 89 machine guns, nose-mounted (450 rpg = 900 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe Ki-10-II's low speed and tight turning ability make it a great turn-fighter, like most Japanese light fighters. The Ki-10-II excels at low and slow turn fighting at very low altitudes where enemies cannot out-dive it. Additionally, it has a climb rate to climb away from enemy biplanes. Very fast dives should be avoided, as the wings will shear off at very high speeds. Similarly, turning stalls should be avoided, as the Ki-10-II has a tendency to enter uncontrollable spins.\n\nIts twin 7.7 mm armament is the weakest in the game, as it has a lower fire rate than its contemporaries, the [[ShKAS (7.62 mm)|ShKAS]], [[Browning (7.62 mm)|Browning]], and [[MG 17 (7.92 mm)|MG 17]]. The belts are poor as well; Stealth is most recommended, as it has the most AP-derivative shells. Strafing attacks on all but the least armoured targets are not recommended; Artillery, Vehicles, and Landing Craft are good and soft targets, while the Ki-10-II's weak construction makes attacking AAA and bombers risky. All bombers are pretty much invulnerable to the Ki-10-II (Beaufort, A-26, etc.) unless you are extremely good at making consistent pilot shots. Cargo Ships, Tanks and pillboxes are also invulnerable to the Ki-10-II. Instead, the best Ki-10-II targets are other biplanes or slow monoplanes, such as [[P-26 (Family)|P-26s]], [[Fury Mk I|Fury Mk Is]] or [[Nimrod Mk I|Nimrod Mk Is]]. The best practice is to aim for the wings! The fuselage's of all planes will absorb your shells like a sponge. Like most other planes, the Ki-10-II works best in numbers. Ki-10 pilots should focus primarily on sticking together and working as a team.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Not controllable<br>Not auto controlled || Not controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Combined || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Great manoeuvrability\n* Excellent roll rate\n* High climb angle and rate can be used as a tactical advantage\n* Excellent vertical manoeuvrability\n* Excellent energy retention for a biplane\n* Does not get into a spin easily; spin recovery is quick\n\n'''Cons:'''\n\n* Mediocre top speed\n* Very slow (horizontally) at best climb speed\n* Weak armament\n* Weak armour\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe Kawasaki Ki-10 was the last Biplane fighter used by the Japanese Army. Introduced in 1935, it beat the competing Nakajima Ki-11 (which would later be refined as the [[Ki-27 otsu|Ki-27]]) as the Imperial Japanese Army Air Force placed more priority on manoeuvrability than speed. Its excellent manoeuvrability made it extremely popular with Japanese pilots, who demanded similar high manoeuvrability from newer aircraft. Over the course of its service, the fighter would be refined several times with the ultimate version, the [[Ki-10-II]], appearing in 1937.\n\nThe Ki-10 saw service against Chinese air forces in the early stages of the Second Sino-Japanese War and against Soviet air forces during the battles of Khalkhin Gol (where it historically outperformed the Soviet [[I-15 M-22|I-15]]). It formed the backbone of the IJAAF fighter forces until 1940, but it was considered obsolete by Western military experts as early as 1938. By the start of the Pacific War, the Ki-10 had been regulated to training and courier roles, and received the Allied reporting name \"Perry\".\n\nThere are no known incidents where the Ki-10 engaged American- or British-crewed aircraft, though the Japanese fighter did fight Chinese National [[P-26A-33|P-26s]], and may have engaged British-built [[Gladiator_Mk_II|Gladiators]], Italian [[CR.32]]s (predecessor of the [[CR.42]]), and Soviet [[I-15bis|I-15s]], all crewed by Chinese pilots, during the early battles of the war.\n\n=== In-game description ===\nKawasaki Ki-10-II (Type 95-II, Allied reporting name: Perry) single-engine army fighter\n\nThe first Ki-10 production fighters began to enter service in December 1935. Military pilots highly appreciated the new fighter's speed and rate of climb. However, Kawasaki soon began to get non-stop requests from troops asking them to improve the machine's horizontal manoeuvrability The predominant opinion in the Japanese aviation industry of that time period was that fighters should first of all meet the requirements of high manoeuvrability for the close-range combats (\"dog fights\") of World War I. In addition, the Ki-10 was noted to have inadequate longitudinal stability that made accurate aiming and firing more difficult.\n\nIn response to these complaints, Takeo Doi presented a new version of the fighter, designated the Ki-10-II, in October 1937.\n\nThe new plane had its upper wing span increased to improve manoeuvrability, which resulted in decreased wing load. Also, the tail section of the fuselage was lengthened to extend the empennage, which made the plane more stable.\n\nThe designers managed to compensate completely for the increased drag after the plane's production standards were raised and, in particular, the airframe's surface was given a smoother finish. As a result, the Ki-10's manoeuvrability and takeoff/landing characteristics were noticeably improved, even though the plane retained the same engine and other flight performance parameters remained unchanged.\n\n290 Ki-10-II fighters left the Kawasaki factory floor (located in the city of Gifu) during production, up until December 1938, when the machine's production ceased.\n\nThe Ki-10-I and the Ki-10-II became the most advanced biplane fighters in Japanese aviation. They took active part in combat operations in the Sino-Japanese War and in the Khalkhyn Gol conflict. Ki-10 aircraft became obsolete by the beginning of the Pacific War, and were mainly used as training machines.\n\nIn 1939, a practically undamaged Ki-10-II fighter was captured by the Chinese. This aircraft later appeared in the USSR. The machine was thoroughly studied there, and flight tests were even conducted at the Air Force Research Institute.\n\nSoviet test pilots noted that the Japanese fighter had high production standards and was easy to operate and maintain. It was not difficult to pilot, but its stability was considered inadequate, and its spin characteristics were believed to be poor.\n\nBut in general, despite a number of disadvantages, the Ki-10-II was regarded as a very strong air-combat opponent which could fight Soviet I-15 fighters on an equal footing.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=ki_10_2_commander Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|PrqqMtZin1U|'''The Shooting Range #48''' - ''Pages of History'' section at 04:36 discusses the Ki-10.}}\n\n== See also ==\n<!--''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''-->\n\n;[[Ki-10 (Family)|Related development]]\n\n* [[Ki-10-I]]\n* [[Ki-10-I C|Ki-10-I Commander]] - <small>Command plane of the 1st Sentai</small>\n* [[Ki-10-II]]\n\n;Planes of comparable role, configuration and era\n* [[He 51 (Family)|He 51]]\n* [[I-15 (Family)|I-15]]\n* [[Fury (Disambiguation)#Rank I - Aircraft|Fury]]\n* [[CR.32 (Family)|CR.32]]\n* [[D.37 (Family)|D.371]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [http://www.historyofwar.org/articles/weapons_kawasaki_ki-10.html <nowiki>[HistoryOfWar.org]</nowiki> Kawasaki Ki-10 'Perry']\n* [http://surfcity.kund.dalnet.se/kawasaki_ki-10.htm <nowiki>[Håkans aviation page]</nowiki> Ki-10]\n* [[wikipedia:Kawasaki_Ki-10|[Wikipedia] Kawasaki Ki-10]]\n\n{{AirManufacturer Kawasaki}}\n{{Japan fighters}}\n[[Category:Hidden vehicles]]"}}