{"title":"Ki-43-III ko (China)","pageid":7350,"wikitext":{"*":"{{About\n| about = Chinese fighter '''{{PAGENAME}}'''\n| usage = other uses\n| link = Ki-43 (Family)\n}}\n{{Specs-Card\n|code=ki_43_3_ko\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese fighter {{Battle-rating}}. It was introduced in [[Update 1.91 \"Night Vision\"]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 6,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 535 || 518 || rowspan=\"2\" | {{Specs|ceiling}} || 15.8 || 16.3 || 11.4 || 11.4 || rowspan=\"2\" | 190\n|-\n! Upgraded\n| 583 || 558 || 14.7|| 15.0 || 20.5 || 15.3\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 477 || 448 || 300 || ~11 || ~8\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 370 || < 350 || < 450 || > 326\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 12 mm steel - behind pilot\n* 12 mm steel - pilot headrest\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Ho-103 (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 12.7 mm Ho-103 machine guns, nose-mounted (250 rpg = 500 total)\n\nThe Ki-43-III ko is armed with a pair of nose mounted 12.7 mm machine guns with 250 rounds of ammunition per gun. While this armament is nothing particularly special it is reasonably effective, and better than some comparable aircraft. The nose mounted position of the guns makes them easier to aim and means that you do not need to worry about convergence. Depending on personal preference either the air targets or stealth ammunition belt is typically best to use.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nIn all modes, the Ki-43 can perform both BnZ fighting and turnfighting with the correct opponent. It can easily accelerate to 500 km/h in a dive while still having responsive controls. However its speed retention is quite poor and will lose lots of speed as soon as you level out. For turnfighting, you can out-turn most monoplanes and almost all heavy fighters/attackers even without combat flaps deployed, but never turn with Spitfires and Zeros. Note that this aircraft will experience severe rudder lockup when faster than around 450 km/h, resulting in awkward aiming adjustments if the target manoeuvres, so you need to cut throttle appropriately to control your speed.\n\nWhile having sufficient flight characteristics, the Ki-43 is extremely fragile and can get critically damaged by almost all guns. From the hard-hitting M2 Browning to the fast-firing MG 15, ''any'' gun can badly hurt the Ki-43 especially on the engine, fuel tanks, and pilot which can always lead to a later crash. Before attacking try to get an altitude advantage and perform deflection shots. To maximise the damage aim for their wings and engines, as the fuselage usually soaks up lots of bullets. Only fire when the target passes in front of your guns. This short window might seem inadequate to do anything... and it usually is, unfortunately. The slow velocity, light projectiles and low one-second burst mass usually guarantee no critical damage. However sometimes it only takes one bullet to set the target aflame, if you are lucky.\n\n* In Simulator, the Ki-43 is overall a decent plane. It has very forgiving characteristics such as good over-the-nose visibility, a clear bubble canopy without much framing and good backwards visibility. This increases your chance of spotting, tracking, and/or dodging since you can see targets from almost every direction with ease (except the underside, of course). It is recommended to set keybind for moving your head vertically to make full use of the great forward vision in a dogfight. However, its wings are located directly below the cockpit meaning that you cannot see what is below your sides which can lead to you losing track of the enemy. You should get used to searching towards your 2, 4, 5, 7, 8, 10 o'clock, avoiding the wings.\n* Note that when taking off the Ki-43 will shift severely to the left due to the propeller torque, so it is recommended to set keybinds for left and right brakes to effectively control your direction on the runway. Using rudder alone will not work at low speed and you will either circle around or lose control and crash into nearby structures like tents/hangars.\n* Landing is very beginner-friendly too. It is able to decelerate quickly while also having low stall speed, allowing you to quickly slow down and descend onto the runway. Takeoff and landing flaps do not lift up the nose a lot so you can easily remain overall parallel to the ground. It also performs great when braking as its nose will not usually dip into the ground, so you can keep braking until it fully stops (given that you deflect elevators fully upwards) which is vital for preparing the next fight quickly.\n* It has very good handling at most speeds. It does not wobble a lot which is an advantage over the biplanes and early monoplane fighters, making it easier to smooth the aim. You should familiarise the shape of those that you should not turn with: the Spitfires have long, straight nose with an inline engine, rather large and elliptical wings. The Zeros have an overall cylindrical fuselage that merges into a pointy tail after the stabilisers, a radial engine and are usually painted white (early models). If you see them on your tail try outrunning them by diving at around -40 degrees. The Ki-43 still remains responsive handling at 500 km/h, but its speed retention is poor, meaning it will start to lose speed quickly and the enemy might catch up. If you are near a friendly airfield, great. If not, then hope for the best and run towards the friendly side. Don't forget to pitch up and down a little to mess up their aim, the early Spitfires and A6M only have a 60-round drum per cannon which will run out fairly fast. The leftover 7.7 mm machine guns will not be as destructive but still might destroy you.\n* It will be very challenging when facing against the Japanese Ki-43, as both of you have the same characteristics. You cannot outrun each other and cannot out-turn each other, so the fight will be a combination of various manoeuvres and techniques, and of course, the pilot's skills. Note that the Ki-43 has similar appearance as the Ki-44 and can be misjudged as a Ki-44 or a Zero. Comparing to the Ki-43, the Ki-44 has a slightly bigger engine and the canopy is shifted backwards, while the Zero has a very framed cockpit and usually a fully black nose.\n* When it comes to intercepting ground pounders or bombers, the Ki-43 generally performs poorly since the targets are all quite robust against your weak guns. Some examples are the IL-2 which is commonly seen in Sim. It can get mistakenly seen as other aircraft from a distance due to its common appearance. But up close you will see two bomb-like structures underneath its wings and triangular stabilisers with rounded tips. The early IL-2s have no defensive guns so it is safe to sit behind and carefully aim. They are heavily armoured in the cockpit and engine so avoid aiming at these areas. Instead target the tail to hope for disabling their tail control. The late IL-2s, however, have a rear-facing Berezin UB which is something you definitely want to avoid. Perform deflection shots or just disengage.\n\n'''Enemies worth noting:'''\n\n* Typhoon Mk Ia: this is a very capable opponent, it is quite fast, climbs good, manoeuvres decently and has 12 x 7.7 mm MGs that can fatally damage the Ki-43. If you are attacking, get an altitude advantage first and BnZ it. If you are being attacked by it, evade its first pass and immediately start a turnfight. You need to deploy combat/takeoff flaps, or even landing flaps if needed to push your turn rate to the limit. Several circles are needed, don't panic to see the Typhoon keeping up with your turns at first. With appropriate flaps, the Ki-43 will slowly out turn it, allowing you to get onto its tail. The Typhoon overall resembles a Hurricane, except its symbolic giant intake below the engine.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Not auto controlled || Not controllable<br>Not auto controlled || Controllable<br>Auto control available || Combined || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Decently fast for the rank\n* Great manoeuvrability\n* Good rate of climb\n* Respectable firepower for a fighter at its rank\n* Useful flaps in a turnfight\n* Great all-round visibility in simulator\n* Forgiving landing characteristics\n\n'''Cons:'''\n\n* Mostly faces Japan (facing equally/more manoeuvrable planes)\n* Somewhat limited damage output\n* As with a lot of Japanese-made planes, is rather fragile\n* Rudder locks up at around >=450 km/h, meaning that you will miss quite some passes due to the aim not being able to adjust horizontally\n* No payload options\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nIn early 1937 the Army recognized the need for a new single seat fighter. Instead of going through the normal process of requesting manufacturers to submit designs, the Army contracted with Nakajima directly to produce a replacement for their Ki-27 (Army Type 97) fighter. The requirements laid out to Nakajima for this new fighter was for it to have a top speed of 311 mph, to be able to reach 16,405 ft within five minutes, to have a minimum range of 500 miles, it was to be armed with two 7.7 mm machine guns, and to not lose any of the manoeuvrability of the Ki-27. The first prototype of what was to become the Ki-43 was completed in December 1938 with 2 more following soon after in 1939, however upon testing it was found that these airplanes did not live up the Army's expectations. The complaints from test pilots included that the plane was not manoeuvrable enough, hard to control, and had visibility issues.\n\nFollowing the evaluation of the initial 3 prototypes, Nakajima would develop 10 testing aircraft with various modifications in order to address the armies concerns. The changes tested included giving the fighter the HA-105 engine, replacing the 7.7 mm machine guns with 12.7 mm machine guns, upgrading the outer skin to a treated duralumin, narrower fuselage, redesigned tail surfaces, modifications to the wing design, and the introduction of butterfly flaps. The last improvement in particular helped the plane to overcome its lack of manoeuvrability that the Army had issue with. After these designed prototypes were tested the Army settled on what they saw was the optimum configuration and requested that it be equipped with the Nakajima Ha-25 engine. The plane entered production as the Ki-43-Ia (Army Type 1 Fighter Model 1A) with the first example completing production in April 1941. This model was soon replaced with the Ki-43-Ib (Army Type 1 Fighter Model 1B) which replaced one of the 7.7 mm machine guns with a 12.7mm machine gun which was also soon replaced by the Ki-43-Ic (Army Type 1 Fighter Model 1C) which was equipped with two 12.7 mm machine gun.\n\nAfter some time in the field, the Ki-43 was to receive a major upgrade based on feedback from pilots, which included replacing the Ha-25 engine with the more powerful Ha-115 engine, a two stage supercharger, pilot armour, self-sealing fuel tanks and many more minor improvements. The first prototype of what was to become the Ki-43-II (Army Type 1 Fighter Model 2) was completed in February 1942. The last major modification of the Ki-43 was done in 1944, combining the minor modifications of the IIa and IIb with the more powerful Nakajima Ha-115-II engine. These minor modifications over the Ki-43-II included a reduced wing-span (improving the plane's low and medium speed performance), increased pilot armour, improved oil cooler, and modified carburetor intake. This new Ki-43-IIIa (Army Type 1 Fighter Model 3A) entered production in October 1944 with approximately 1,000 being completed before the war ended. The Ki-43 would become the most numerous of all the Japanese Army's fighters. While operating in Malaysia and Burma the plane received the codename \"Jim\" and in the Pacific Theatre it received the allied codename \"Oscar\". The codename \"Oscar\" was eventually selected as the official code name for the airplane by the Allies.\n\nAfter the end of the war, a number of nations used the Ki-43, including the Indonesian People's Security Force who used them against the Dutch, and the French who used them against Communist forces in Indochina.\n\n== Media ==\n''Excellent additions to the article would be video guides, screenshots from the game, and photos.''\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n''Paste links to sources and external resources, such as:''\n\n* ''topic on the official game forum;''\n* ''encyclopedia page on the aircraft;''\n* ''other literature.''\n\n{{AirManufacturer Nakajima}}\n{{China fighters}}"}}