{"title":"Ki-61-I tei","pageid":575,"wikitext":{"*":"{{About\n| about = Japanese fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = Ki-61 (Family)\n}}\n{{Specs-Card\n|code=ki_61_1a_tei\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Japanese fighter {{Battle-rating}}. It was introduced in [[Update 1.55 \"Royal Armour\"]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 5,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 559 || 544 || rowspan=\"2\" | {{Specs|ceiling}} || 22.0 || 22.7 || 9.2 || 9.2 || rowspan=\"2\" | 550\n|-\n! Upgraded\n| 602 || 580 || 20.1 || 21.0 || 15.3 || 11.9\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 850 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || 292 || 282 || 230 || ~10 || ~7\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 360 || < 350 || < 450 || > 312\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 13 mm steel plate - located behind the pilot\n* Self-sealing fuel tanks\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Ho-5 (20 mm)|Ho-103 (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 20 mm Ho-5 cannons, nose-mounted (120 rpg = 240 total)\n* 2 x 12.7 mm Ho-103 machine guns, wing-mounted (250 rpg = 500 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|Army Type 94 GPHE (50 kg)|Army Type 94 GPHE (100 kg)|Army Type 92 GPHE (250 kg)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x 50 kg Army Type 94 GPHE bombs (100 kg total)\n* 2 x 100 kg Army Type 94 GPHE bombs (200 kg total)\n* 2 x 250 kg Army Type 92 GPHE bombs (500 kg total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n'''Simulator'''\n\nIn Sim, the Ki-61 can be used in Boom and Zoom fighting, turn fighting, intercepting and some ground pounding. The Ki-61 is overall a pretty friendly plane to fly. It is quite fast, handles nicely at all speeds, has decent visibility especially over the nose, climbs great and has good armament. However its main disadvantage is the weak protection.\n\nBefore taking off, bring at least 30 minutes of fuel for longer patrol time. If you are not using MEC, use around 95% throttle when cruising below 3,000 m since the engine will slowly heat up at full throttle. But full throttle is fine at higher altitudes.\n\nOnly elevator trim is available, so when the stick is at its dead zone, the Ki-61 will roll and yaw to the left side. Therefore you always need to pull the stick to the right which can get a bit annoying. Usually, a trim of around -7% is enough. But when carrying the 2x 250kg bombload, no negative trim is needed.\n\nFor dogfighting, it is always safer to enter with an altitude advantage. Most dogfights in sim happen below 3,000m so the Ki-61 can easily climb up to that altitude. As mentioned in the description, its climb rate is actually great, don't get misled by the stat card. Once at an advantageous height, boom & zoom the enemies. The Ki-61 can easily accelerate to more than 550 km/h in a dive which is decently fast but requires more precise manoeuvres to get the correct lead, since the faster you go the smaller the shooting window is. A successful pass will usually cripple the enemy. Aside from BnZ, the Ki-61 is also excellent at turn fighting - with the appropriate opponent, of course. Except a few dedicated turn fighters, the Ki-61 can out-turn and get on most opponents' tail with combat flaps deployed. Note: do not turn with Spitfires or Zeros, you will never out-turn them. If you see a plane with a streamlined inline engine and large, elliptical wings (Spitfire) or something with rounded wingtips and stabilizer tips, a radial engine and a pointy tail (A6M), try some defensive manoeuvres like barrel rolls or disengage by diving towards a nearby friendly airfield. Note that the Ki-61's roll rate is very average so avoid manoeuvres like scissors.\n\nWhen intercepting planes, it is crucial to know what the target is, because most targets can easily damage you in return. If it is a bomber/attacker with decent defensive firepower or great turret coverage then you might want to disengage after some attempts if you don't want to die. From the hard-hitting M2 Browning to the fast-firing MG 15, ''any'' gun can critically damage the Ki-61 especially on the engine, fuel tanks, and pilot which can always lead to a later crash. Before attacking try to get an altitude advantage and perform deflection shots. To maximize the damage it is better to aim for their wings and engines, as the fuselage usually soaks up quite some bullets. Only fire when the bomber passes in front of your guns. This short window might seem inadequate to do anything, but the 2x 20 mm & 2x 12.7 mm armament can easily down a bomber with 1-3 passes. DO NOT follow behind a bomber's 6 unless you are sure that its tail gunners are unconscious. Chasing behind a bomber makes yourself pretty much stationary for the tail gunners, and you will be showered with bullets.\n\nFor ground pounding, the best loadout is the 2 x 250 kg bombs. With an extra 500 kg of weight attached outside, the Ki-61 handles much clumsier during take offs, especially on the roll axis. Longer distance is needed before lifting off. Dive at a shallow angle to approach the target, try to get as close as possible but avoid crashing into the ground. When the target fills up about 1/3 in the gunsight and the gunsight slices just above the target, drop the bombs and immediately pull up. It is best to set separate keybinds for firing MG and cannons as wasting precious cannon rounds can be fatal. The 2 MGs perform well in killing trucks, AA guns and artilleries as they have plenty of ammo. However, constantly watch your surrounding, especially your high 6 for any incoming enemies.\n\n'''Enemies worth noting:'''\n\n* [[Me 264]]: This giant is one of the few bombers who get air spawns in Sim, so it usually flies higher than you think. On top of this, the Me 264 is armed with large calibre MG and cannons all over it, therefore tailing a 264 is basically suicide unless all of their gunners are knocked out. You can treat the 264 almost like a B-29 or B-17 as they are very similar in both design and defensive capabilities. It is best to head-on the 264 if you can as you can easily knock out the pilots due to its glazed nose while also taking minimal damage. However the bomber lacks a ventral turret on its belly, making it easy to deal damage from below, but be wary of the downwards facing rear 20 mm cannon near the tail. The safest way to attack is from a higher altitude, dive at an oblique angle and focus fire on the wings and nose. Never engage if you have no altitude advantage.\n* [[B-17 (Family)|B-17]], [[Ju 88 A-4|Ju 88]], [[IL-2 (Family)|IL-2]], etc: These aircraft have either powerful defensive guns, for example the B-17, or wide gun coverage such as the Ju 88. The most threatening one, the B-17, is fairly easy to distinguish. It has a passenger plane-like fuselage, 4 radial engines extending forwards from the wings and a huge tail fin. Focus your fire on the engines and constantly swing sideways to avoid getting hit. A few hits from the M2 Browning is a guaranteed death. The Ju 88, on the other hand, has great underside gun coverage so attacking from below isn't a very good option. Try engaging from the sides and concentrate the fire on the front half of it, as that is where all the vital components are located. Again, never engage any of these if you have no altitude advantage.\n* [[A6M (Family)|A6M]], [[Spitfire (Family)|Spitfire]], etc: If you see them on your tail try outrunning them by diving at around -40 degrees. The Ki-61 still remains responsive handling at 600 km/h, but its speed retention is not the best, meaning it will start to lose speed quickly and the enemy might catch up. If you are near a friendly airfield, great. If not, then hope for the best and run towards the friendly side. Don't forget to pitch up and down a little to mess up their aim, the early Spitfires and A6M only have a 60-round drum per cannon which will run out fairly fast. The leftover 7.7 mm machine guns will not be as destructive.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Generally performs well in the most common tactics, both BnZ and turn-fighting, allowing flexible gameplay depending on the situation\n* Outstanding climb rate\n* Has decent dive speed, can easily out-dive slower opponents\n* Great firepower thanks to the pair of 20 mm Ho-5 cannons\n* Some armour protection for the pilot means that it will not easily get pilot-sniped by small-calibre/low-penetrating guns from the back\n* Able to equip up to 2 x 250 kg bombs, meaning it is also useful in ground pounding/tank RB\n* Adequate over-the-nose visibility allows easier leading in Simulator\n\n'''Cons:'''\n\n* Average backwards visibility can be lethal in Simulator\n* Locks up at high speeds\n* The guns do not have a lot of ammo compared to earlier models (250 rpg for 12.7 mm and 120 rpg for 20 mm) which requires strict trigger control\n* No frontal armour, can be fatal in a head-on\n* Average roll rate which worsens as speed increases, can easily get out-rolled by [[Fw 190 (Family)|Fw 190s]] and [[I-16 (Family)|I-16s]]\n\n== History ==\n''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).''\n\n== Media ==\n''Excellent additions to the article would be video guides, screenshots from the game, and photos.''\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''encyclopedia page on the aircraft;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/285031-kawasaki-ki-61-i-tei/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Kawasaki}}\n{{Japan fighters}}"}}