{"title":"LaGG-3-4","pageid":410,"wikitext":{"*":"{{About\n| about = gift Soviet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = LaGG-3 (Family)\n}}\n{{Specs-Card\n|code=lagg-3-4\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} Soviet fighter {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27.\n\nThe LaGG-3-4 can be flown in one main role: as a fighter. It could potentially be used as a bomber hunter, but it is not feasible for this role due to its average rate of climb and fragile engine.\n\nThe LaGG-3-4 is one of the rarest vehicles in-game, only being given to developers and people who have contributed to the game in a significant manner. The LaGG-3-4 is part of the second group of LaGG-3s which include in-game the LaGG-3-8, LaGG-3-11, and LaGG-3-23. All of these planes used the M-105PA engine and had small improvements between then, however, the general playstyle between these aircraft remains the same.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 3,300 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 541 || 529 || rowspan=\"2\" | {{Specs|ceiling}} || 22.2 || 22.5 || 11.6 || 11.6 || rowspan=\"2\" | 403\n|-\n! Upgraded\n| 587 || 566 || 19.8 || 21.0 || 19.1 || 13.8\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 440 || 414 || 280 || ~11 || ~8\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 380 || < 380 || < 380 || > 323\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.''\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|ShVAK (20 mm)|Berezin UB (12.7 mm)|ShKAS (7.62 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n* 1 x 20 mm ShVAK cannon, nose-mounted (150 rpg)\n* 1 x 12.7 mm Berezin UB machine gun, nose-mounted (200 rpg)\n* 2 x 7.62 mm ShKAS machine guns, nose-mounted (800 rpg = 1,600 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nAs a fighter, the LaGG-3-4 packs quite a punch at its low tier. The powerful cannon in the nose of the plane allows it to potentially dish out large amounts of damage to unsuspecting aircraft, biplanes, monoplanes and bombers alike. Its heavy armament makes it the perfect aircraft to pounce on carefully selected enemies that are on their own or engaged in a furball at low altitudes. Due to the average rate of climb, this aircraft is best used in diving attacks, booming and zooming in and out of the fray.\n\nAnother feasible tactic in the LaGG-3-4 is to take advantage of the nose centred armament in head-on attacks. Due to the aircraft's fairly robust airframe, it can take some hits in most areas, even from 20 mm cannons. When performing a head-on attack in the LaGG-3-4, take advantage of the central armament to take some shots from more than 750 m out, then pitching down and pulling to the side slightly. If you see that your opponent has committed to the head-on, pull the aircraft back on target and fire in long bursts.\n\nIf up against a fighter or single engine aircraft, aim for the main mass of the plane, the fuselage. If up against a heavy fighter or bomber, aim for a single engine or wing. Usually, a burst of cannon fire into these areas will do them in. If you happen to come up against an aircraft with similar armament (central cannons), take a few pot shots, roll and dive out of the fight to a safe distance. However, against most other planes, the nose-mounted armament of the LaGG-3-4 excels. Another thing to watch out for is the plane's fragile engine, as it can be easily knocked out by aircraft with heavier armament in head-on attacks.\n\nIn summary, the main points to take note of when flying this aircraft are:\n\n* Keep your speed and energy up\n* Use your dive speed and nose mounted cannon to your advantage\n* Go for unsuspecting targets when alone or in furballs\n* Perform head-on attacks against weaker targets\n* Don't engage in a sustained turn fight\n* Try not to get the engine damaged\n\n====Specific enemies worth noting====\n<!--Some concerning vehicles to worry about if playing this plane. (i.e. Japanese fighters will out turn you)-->\nAt this low tier there are many planes that can out-turn the LaGG-3-4. Although this aircraft can pull a very fast initial turn, in a sustained turn-fight it will start to show its faults. Its weak engine combined with a heavy airframe means that this aircraft bleeds energy very quickly in tight turns, nosing down during long, low speed turns. Once at this state of low energy, its average climb rate and acceleration worsens, posing it as an easy target for even the slowest of fighters.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Auto control available || Controllable<br>Auto control available || Separate || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n* Relatively fast\n* Good diving speeds\n* Average turn time\n* Fairly good roll rate\n* Strong armament\n* Large cannon ammunition capacity (150 rounds)\n* Armament centred in the nose\n* Easy to fly\n* In RB, the two additional 7.62 mm ShKAS allow for longer staying power on the battlefield\n\n'''Cons:'''\n* Rate of climb is average at best due to weight and weak engine\n* Can be out-turned easily by biplanes\n* Tendency to nose down in sustained low-speed turns\n* Cannon and machine gun rounds follow different trajectories\n* Engine overheats and can be knocked out quite easily (liquid-cooled)\n* Like all LaGG-3 they tend to require good knowledge of the enemy to win a 1 vs. 1 dogfight\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe initial group of LaGG-3s used the M-105P engine second group of the LaGG-3s which include the in-game 4,8,11,23 used the M-105PA engine and had small improvements between each version. The second group of planes were also slightly lighter than the first generation with increased horsepower.\n\n=== In-game description ===\nThis model appeared in mid-1941. Instead of the central Berezina BK engine-mounted machine gun, the plane was equipped with a 20 mm ShVAK engine-mounted cannon, and one of the synchronized large-calibre Berezina BS machine guns (the right-hand one) was removed to reduce the plane's weight.\n\nThe diameter of the hollow shaft extending beyond the propeller spinner was also increased. A ratchet was installed in the shaft for starting the engine externally. The self-sealing fuel tanks received an inert gas filling system. Wheels with large air tires were installed on the main columns of the chassis, which increased the plane's manoeuvrability on waterlogged ground.\n\nThe LaGG-3 Series 4 fighters contained the water-cooled V12 V.Y. Klimov M-105PA engine with a maximum output of 1,050 hp. This engine differed from the M-105P in its floatless carburetor, which worked better during manoeuvres in negative g-forces.\n\nThe plane's armament consisted of a 20 mm Shpitalny-Vladimorov ShVAK cannon with 150 shells, installed in the cavity between the engine cylinders; a synchronized 12.7 mm Berezina BS machine gun with 200 rounds, installed in the nose section of the fuselage above the engine and to the left; and two 7.62 mm synchronized ShKAS machine guns with 800 rounds each, installed in the nose section of the fuselage above the engine in large drop-shaped cowls. All in all, the fighter's offensive capabilities had not increased, but had actually slightly decreased.\n\nIn addition, the plane's aerodynamic properties suffered. The wing's leading edge was deformed by sagging caused by the large size of the wheels. The tail wheel could not be raised and external balancers had to be installed on the rudder, both of which also had a negative effect. In addition, the poorly fitted landing flaps often caused problems during flight.\n\nAs a consequence, the flight characteristics of the LaGG-3 Series 4 fighters were significantly decreased in comparison to those of the series 1, 2 and 3 fighters.\n\nThe LaGG-3 Series 4 fighters were widely used in combat on the Soviet-German front. All plants involved in its manufacturing produced around 1,000 LaGG-3 Series 4 – 7 planes.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=lagg-3-4 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''\n\n{{AirManufacturer Lavochkin}}\n{{USSR fighters}}\n{{USSR premium aircraft}}"}}