{"title":"MiG-9 (l) (China)","pageid":7371,"wikitext":{"*":"{{About\n| about = jet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = MiG-9 (Family)\n}}\n{{Specs-Card\n|code=mig-9_late_china\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese jet fighter {{Battle-rating}}. It was introduced in [[Update 1.91 \"Night Vision\"]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nWhen looking at this fighter, a pilot may complain at the lack of ordnance options available, being only limited to a single 37 mm and two 23 mm cannons with what seems to be only a handful of ammunition rounds between them. Without the addition of suspended ordnance, the flight model will not change due to added weight of bombs, missiles, rockets or gun pods, since none are available and the aircraft wasn't designed to use them.\n\nAs such, this fighter was built almost like a rocket, needing to get to bomber altitude as fast as possible and intercept inbound bombers. The limited ammunition prevents the pilot from just ''spraying-and-praying'', but instead requires trigger control to maximize rounds on target. This is especially important in realistic and simulator battles where after the ammunition is expended, the pilot must return to base to reload.\n\nThe MiG-9 has enough speed to get to 5,000 m within about 4 minutes, however once there, it is best to either target bombers and go higher if needed (13,500 m is maximum altitude for the fighter) or to then turn the MiG-9 into a diving fighter and going for quick hits before zooming back up. Immelmanns and Split-S manoeuvres are recommended to change directions as this fighter is a very slow turner, taking about 30 seconds to make a complete circle. It is important to keep the speed up on this fighter due to when it becomes slow, it then becomes an easy target for enemy aircraft.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 1,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 916 || 890 || rowspan=\"2\" | {{Specs|ceiling}} || 27.2 || 27.9 || 22.8 || 21.5 || rowspan=\"2\" | 800\n|-\n! Upgraded\n| 986 || 967 || 25.0 || 26.0 || 33.8 || 28.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| X || ✓ || ✓ || X || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || N/A || 434 || 300 || ~12 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 550 || < 600 || < 720 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"5\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | {{Annotation|Basic mass|Mass of the aircraft with pilot and engine oil, but no fuel or weapons load}} || colspan=\"3\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | Klimov RD-20A-2 || 2\n| colspan=\"2\" | 3,790 kg || colspan=\"3\" | 279 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"4\" | Mass with fuel (no weapons load) || rowspan=\"2\" | Max Takeoff<br>Weight\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 9m fuel || 20m fuel || 30m fuel || 31m fuel\n|-\n| 670 kg || colspan=\"2\" | Axial-flow turbojet\n| 4,177 kg || 4,597 kg || 5,001 kg || 5,079 kg || 5,590 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB/SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"5\" | Thrust to weight ratio @ 0 m (108%)\n|-\n! Condition || 100% || 108%\n! 9m fuel || 20m fuel || 30m fuel || 31m fuel || MTOW\n|-\n| ''Stationary'' || 898 kgf || 1,000 kgf\n| 0.48 || 0.44 || 0.40 || 0.39 || 0.36\n|-\n| ''Optimal'' || 898 kgf<br>(0 km/h) || 1,000 kgf<br>(0 km/h)\n| 0.48 || 0.44 || 0.40 || 0.39 || 0.36\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 12 mm steel plate - in front of the 37 mm & 23 mm magazines\n* 12 mm steel plate - in front of the pilot, between the instrument panel and the 37 mm & 23 mm magazines\n* 55 mm bulletproof glass - canopy windscreen\n\nThe MiG-9, unfortunately, is not built like a tank and as a bomber interceptor, it had to be constructed like one, sacrificing armour for speed. The aircraft does feature 55 mm of bulletproof glass on the canopy windscreen and two 12 mm steel plates on both sides of the 37 mm ammunition magazine, but that is it for aircraft protection. All the protection is in the front which is meant to offer defence from any defensive gunners on enemy bombers. From the front profile, the armour plates and glass do a good job of shielding the critical components, however, from just about any other angle, the pilot, engines and fuel tanks are clustered in the centre of the aircraft and are all vulnerable from machine gun, cannon, missile and rocket damage. The MiG-9 (l) does have a little more of a weight issue that the standard [[MiG-9]] in that it has fuel pods at the end of the wing-tips which both add more weight and slightly decrease manoeuvrability.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|N-37D (37 mm)|NS-23K (23 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 1 x 37 mm N-37D cannon, nose-mounted (40 rpg)\n* 2 x 23 mm NS-23K cannons, chin-mounted (80 rpg = 160 total)\n\nTo fulfil the role of a bomber hunter, the best weapons for mid to late 1940s aircraft was rockets and cannons. Bombers were typically large aircraft and machine guns would not do the job. Bomber interceptors needed to get to the target and spend the least amount of time on target not only for their own safety but to be able to intercept multiple targets before needing to return to base to refuel or rearm. The N-37D and NS-23 cannons centrally mounted on the MiG-9 virtually nullify the need for messing with convergence, allowing the pilot to sling both ammunition types at bombers at 690 m/s. In a high speed pass only so many rounds could be fired off before the MiG was zooming past and needed to set up for another run if they missed.\n\nHaving the 37 mm and 23 mm cannons helped ensure if the critical areas are hit, only one pass is needed. Without rockets or missiles to provide backup or alternative weapon options, proficiency with the cannons is a must. The \"Air targets\" ammunition belt provides provide a large amount of HE ammunition, which will critically damage enemy targets, even without a precise hit.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe MiG-9 (l) requires altitude to be most effective in either of its two main roles. While flying full throttle into the middle of the map may seem like the noblest thing to do, it may end your piloting career faster than you care for, not allowing you to reach your full potential during the match. Best bet for this fighter is to start side climbing on the map or working on gaining altitude away from where the main group of aircraft are flying as this provides you with a relatively safe area to climb and allows you to see any enemy aircraft which may be gunning for you and give you enough time to respond or dive away. It is important to begin your side climb flying straight until the fighter reaches speeds of about 500-550 km/h when the climb angle can be increased to about 15°.\n\nWhen you reach an altitude of where the bombers are at, you can then begin to patrol and set up for any attack runs. Typically it is best to have some altitude over the bombers as this will allow you to gain more speed when driving and make it that much more difficult for the defensive gunners to hit you. Flying towards the rear of the bomber is the worst angle to come at, while it makes it easy for you to line up the target, you will actually be flying into bullets fired at you causing them a chance for deeper penetration into your jet than if you came from another angle. Due to the limited amount of ammunition, controlled bursts are best especially when aimed at engines, cockpits or fuel tanks. Carefully aim at these critical components and let the ammunition do the rest for you. It is best not to linger around a target, instead, add full power and zoom away until you are at least a kilometre or two away and outside of the range of any defensive turrets before manoeuvring for another run.\n\nIf there are no bombers to attack, either because they have all been destroyed or waiting for more to spawn (in Arcade battles, some pilots tend to leave their attackers/bombers as late match reserves), then when at altitude, you can patrol and look for unsuspecting fighters or you can work to lure aircraft up into a stall fight. From your perch, you can start to dip down towards a fighter as if you are going to pounce on it, if they take the bait and climb to meet your MiG-9 (l), then pull up as if you ''chickened-out'' and are running, begin a moderate climb with your speed and watch as they follow up, especially watch for the condensation trails coming from their wings, this is a good indication that they are beginning to stall and are an easy target. The MiG-9 (l) has a rather larger rudder and can make use of it for a wing-over manoeuvre which will put you in line with the stalled out target allowing for you to get a quick shot off before returning to your patrol altitude. It is recommended to take 20 minutes of fuel; even though it greatly reduces performance at the start of the match, it allows for you to freely use 108% as well as having a much longer-lasting presence over the battle.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Powerful armament for bomber hunting\n* All armour is in the front of the aircraft to protect against defensive weapons\n* Engines do not overheat at 100% throttle\n* Is able to land quite well on engines like the Me 262\n* Has two engines, can still return to base if one is critically damaged\n* High rip speed for an early Soviet jet (a little over 1,000 km/h)\n* Can outrun almost anything it fights\n\n'''Cons:'''\n\n* Two different trajectories for both guns\n* Limited ammunition of 160 (NS-23) and 40 (N-37D)\n* No access to bombs or other payload options\n* Underwhelming acceleration (though a bit better than the MiG-9 Early)\n* Unimpressive climb-rate (likewise, improved from the earlier version)\n* Control lock starts at around 800 km/h\n* Loses a lot of speed during turns\n* Very bad turn rate even compared to some jet bombers\n* Difficult jet for beginners (hard to use due to its weapons and flight characteristics)\n* Overheats quickly at 108% throttle and oil cools down slowly\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n{{main|MiG-9#History|l1=History of the MiG-9}}\n\n=== The very first jet on Chinese soil ===\nThe Korean War saw the very first major battle between the East and the West as well as between jet fighters. Mainland China was involved in the 3-year conflict against the UN forces. One major problem for the newly-born PLAAF was that they had no jet aircraft. During the mid-1950, the Nationalist forces and the USAF would often perform air raids to major cities like Shanghai, Guangzhou and the new capital of Beijing. Between August 1950 to January 1951, the Soviet Air Force transferred 13 fighter divisions to defend these cities, with 9 of them equipped with MiG-9s. This was the very first time Mainland China got their hands on jets and later they decided to purchase some MiG-9s from the Soviets as well, both the PLAAF and the Soviet Air Force expected the MiG-9 to be sufficient enough to handle USAF jet fighters.\n\n=== PLAAF service ===\nLater from April till June 1951, the PLAAF received 358 out of the total of 369 MiG-9s in their service, where the Soviet Air Force transferred them straight to the PLAAF at Mainland's airfields, while there were some [[MiG-15 (Family)|MiG-15]] fighters that came into service in PLAAF, most of the new divisions of the PLAAF had only MiG-9s on their hands. While they were handy and sufficient to shoot down propellers, MiG-9s were inferior to the late [[F-84 (Family)|F-84]] used by the USAF, let alone the later [[F-86 Sabre (Family)|F-86 Sabre]]. Thus in mid-1951, the Soviet Union decided to replace all the MiG-9s in service of 6 fighter divisions with MiG-15. Although the MiG-9s had very little contributions to the war due to their performance, the PLAAF saw it as a trainer to train propeller pilots into jet pilots, and they were mostly used as a jet trainer for new units before MiG-15s were delivered.\n\nMiG-9s remained in PLAAF service till 1959 after its decommission order was effective since 3 November 1956 and 2 examples of this aircraft remain till today in different places in Beijing.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=mig-9_late_china Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/264954-mikoyan-gurevich-mig-9-late/ Official data sheet - more details about the performance]\n\n{{AirManufacturer MiG}}\n{{China jet aircraft}}"}}