{"title":"MiG-3-34","pageid":339,"wikitext":{"*":"{{About\n| about = Soviet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = MiG-3 (Family)\n}}\n{{Specs-Card\n|code=mig_3_series_34\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Soviet fighter {{Battle-rating}}. It was introduced in [[Update 1.41]].\n\nThe MiG-3-34 was built with the intention of making a fighter capable of fighting at high altitudes. The MiG-3 series are one of the few Soviet planes that fly decently at high altitudes, although still not as well as German or American planes.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!--''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.''-->\nThe MiG 3-34 is not a turnfighter, it's a Boom & Zoom aircraft. It is a bit sluggish when turning, although the flaps can be used to turn better. This aircraft has a good climb rate for its BR. Once upgraded, the plane is enjoyable, though it may be a bit challenging to master.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 7,800 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 587 || 569 || rowspan=\"2\" | {{Specs|ceiling}} || 23.2 || 24.1 || 12.8 || 12.8 || rowspan=\"2\" | 450\n|-\n! Upgraded\n| 641 || 612 || 20.8 || 22.0 || 20.2 || 16.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 457 || 428 || 280 || ~12 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 350 || < 280 || < 350 || > 370\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 6,000 m || 1,200 hp || 1,446 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!--''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.''-->\nThe plane's protection is average overall. The placement of critical components is good, with fuel tanks being self-sealing and close to the cockpit. The pilot has 8 mm armour in the back of the seat, and 8.5 mm armour under the seat which prevent stray bullets but do not protect against large calibre cannons. The lack of armoured glass and side protection for the cockpit makes it easy to take out the pilot.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|ShVAK (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 20 mm ShVAK cannons, nose-mounted (100 rpg = 200 total)\n\n== Usage in battles ==\n<!--''Describe the tactics of playing in an aircraft, the features of using vehicles in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).''-->\n\nThe MiG-3-34 is an interceptor which are mainly used to ''intercept'' bombers and strike aircraft, and take them out quickly with its 2 x 20 mm ShVAK cannons which can deal large amounts of damage in close range. Be mindful of bombers with large fuselages which are designed to take large amounts of damage; these can drain your ammo quickly. All interceptors get an air spawn behind the base, use this to your advantage and find a good climb ratio that lets you gain both altitude and speed, and keep in mind that MiG series interceptors work best at high altitudes.\n\nUse the high-powered 20 mm cannons wisely, because they have limited ammo try to aim for critical components such as engines and crew members. Avoid getting in direct line of sight of a bomber, as you can easily get the pilot taken out by defensive turrets on a bomber. Try to intercept from the side and aim for the bomber tail, wing or the pilot. \n\nThe plane can to a lesser extent be used as a ground attacker, but it is advised against this due to its lack of armour, low ammo count and the fact that it doesn't have any ordnance.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil\n! Water\n! Type\n|-\n| Controllable || rowspan=\"2\" | Controllable<br>Not auto controlled || rowspan=\"2\" | Controllable<br>Not auto controlled || rowspan=\"2\" | Controllable<br>Not auto controlled || rowspan=\"2\" | Separate || rowspan=\"2\" | Not controllable<br>1 gear || rowspan=\"2\" | Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!--''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".''-->\n\n'''Pros:'''\n\n* 2 x 20 mm ShVAK cannons which are powerful at close range\n* Durable construction which can handle high speeds\n* A great climb rate of climb for its BR\n* Strong flaps which can be used to decrease turn time\n* Roll rate is good at high altitudes.\n\n'''Cons:'''\n\n* Limited ammunition\n* Not very manoeuvrable in turns\n* Pilot and engine are vulnerable due to lack of armour \n* No additional armament other than 20 mm cannons\n\n== History ==\n<!--''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).''-->\n\nThough riddled with shortcomings, the I-200/MiG-1 fighter/interceptor aircraft proved to be both a popular and capable aircraft with pilots that had experience flying them. To address the oft-cited shortcomings, aircraft designers Mikoyan and Gurevich set out to rectify these issues, not only to make the aircraft more pilot-friendly but to make it a more effective fighter/interceptor.\n\nBy utilizing a full-sized model of the aircraft in a wind tunnel, designers quickly set about documenting necessary changes in the aircraft's configuration. The increase of the outer wing dihedral improved the wing's overall stability and lengthening the fuselage by just four inches improved the horizontal stability of the aircraft. By happenstance, the minute change in length created enough space for an additional 66 gallon (250 litres) fuel tank installation behind the pilot seat. Inert exhaust gases were routed to the fuel tanks to help improve the survivability of the aircraft and pilot by reducing the likelihood of fuel fires if enemy gunfire punctured the fuel tanks. Other improvements included strengthening the landing gear, larger main wheels, extending the canopy glazing aft for better visibility, improved gunsight, updated configuration of the instrument panel and an overall increase to 750 rounds of ammunition per machine gun. \n\nAfter making the recommended updates and changes, the heavily modified I-200/MiG-1 (fourth revision) made its maiden flight on 29 October 1940. The Soviet state accepted this version of the aircraft during December 1940 State acceptance trials and due to the significant changes made to the plane was renamed to MiG-3. Though the Mikoyan-Gurevich design bureau rectified many of the MiG-1's deficiencies, unfortunately, the resulting aircraft ended up being 550 lbs (250 kg) heavier and reduced service ceiling by 1,500 ft (457 m). They also took approximately a minute longer to reach 16,000 ft (4,900 m) than the original MiG-1s. Two other positive outcomes for the MiG-3 was an overall increase in the aircraft's speed at altitude and sea-level along with an increase in its service range.\n\nMany of the initial MiG-3 airframes pushed out to the VVS regiments which were considered poor quality and unusable. After an inquiry completed, a panel found that the Soviet Air Force Research Institute was negligent in their duty to monitor the quality of the aircraft coming off the assembly line. After several demotions of senior managers and the execution of the institute head, new management set to address the problems with the MiG-3.  \n\nThough designed as a high-altitude bomber-interceptor, the MiG-3's pilot's oxygen supply was woefully inadequate, both fuel and oil pumps failed to keep necessary pressure at altitude and pilot inexperience with high altitude flying all played against the aircraft's abilities. Once again, the MiG Design Bureau set out to fix these deficiencies and when complete, the MiG-3 design teams optimized it for high altitude operations above 20,000 ft (6,000 m). Here the MiG-3 boasted almost a 20 mph (26 kph) speed advantage over the German Bf 109E, though at sea-level, this advantage disappeared and the MiG-3 had roughly the same top speed as the Bf 109. \n\nThe weapons of the MiG-3 always seemed lacking compared to other aircraft such as the Bf 109 which typically sported a 20 mm canon along with machine guns. MiG-3s of all iterations only had machine guns in the 12.7 mm and 7.62 mm varieties. Though experiments with wing-mounted gun pods and rockets took place, reduction of airspeed due to them often resulted in the pilots having them removed, one of the few times where fighter pilots prefered streamlined aircraft over firepower. Ultimately the new gun sight was not fit for the task, so pilots often relied on getting as close to the enemy aircraft as possible before opening fire, sometimes within point-blank range to ensure a hit.\n\nLeading up to the German invasion titled Operation Barbarossa, MiG-3s found homes at front-line regiments. Here, they could ideally intercept any hostile bomber or reconnaissance aircraft that flew over such as the German Ju-86P. Unfortunately, at the beginning of the German invasion, the MiG-3, though one of the best fighters available to Soviet pilots, proved to be unsuited for the task at hand. Instead of intercepting bombers and reconnaissance aircraft, they instead fought more agile Bf 109s and such in a fashion which negated all of the MiG-3's advantages, and it struggled. With the Bf 109 being more agile and had better weapons, the MiG-3 fought for a foothold but often lost. It was around this time that other Soviet fighters such as the Yak and LaGG series aircraft were debuting and showing their effectiveness at lower altitude combat with more agility and better weapon options. Forcing the aircraft to work as a bomber and ground attack aircraft proved to be an, even more, less effective than as a low-altitude fighter.\n\nSome Soviet pilots did find success while flying the MiG-3. Aleksander Pokryshkin was one such pilot, as his initial foray into air combat was at the controls of a MiG-3. It was while flying the MiG-3 that Pokryshkin scored several victories against the German Bf 109. However, it was also during this time he realized that Soviet air combat doctrine was outdated, and he took detailed notes of his and other's accounts at air combat to determine a better way to fight. Pokryshkin's experience in the MiG-3 helped shape future Soviet air combat tactics for pilots flying more capable aircraft such as the  Yak-1B, P-39K and Lavochkin fighters. Pokryskin was quoted as saying, \"''The operational advantage of the MiG-3 seemed to be obscured by its certain defects. However, these advantages could undoubtedly be exploited by a pilot able to discover them''.\"\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [[https://live.warthunder.com/feed/camouflages/?vehicle=mig_3_series_34 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n[[File:MiG-3-34 Sanya V. Litvyak.mp4|thumb|\"Sanya V. Litvyak\" collaboration camouflage|none]]\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Aircraft of comparable role, configuration and era\n\n* Curtiss [[P-40 (Family)|P-40]]\n* Dewoitine [[D.520]]\n* Kawasaki [[Ki-61 (Family)|Ki-61]]\n* Messerschmitt [[Bf 109 (Family)|Bf 109]]\n* Yakovlev [[Yak-1 (Family)|Yak-1]]\n\n== External links ==\n<!--''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''-->\n\n* [https://forum.warthunder.ru/index.php?/topic/100791-mig-3-34-serii/ Official data sheet - more details about the performance (Russian Forum)]\n\n{{AirManufacturer MiG}}\n{{USSR fighters}}"}}