{"title":"Mosquito FB Mk XVIII","pageid":498,"wikitext":{"*":"{{About\n| about = British strike aircraft '''{{PAGENAME}}'''\n| usage = other versions\n| link = Mosquito (Family)\n}}\n{{Specs-Card\n|code=mosquito_fb_mk18\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} British strike aircraft {{Battle-rating}}. It was introduced in [[Update 1.39]].\n\nThe Mk.XVIII, also known as the \"Tsetse\", was a converted Mk.VI \"FB\". In this aircraft, all four Hispanos are replaced with a single Molins 6-pounder Class M cannon (57 mm). The cannon itself was a modified QF 6-pounder anti-tank gun, fitted with an auto-loader to allow for both semi- and full automatic fire. \n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 3,780 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 555 || 541 || rowspan=\"2\" | {{Specs|ceiling}} || 31.6 || 33.0 || 3.5 || 3.5 || rowspan=\"2\" | 450\n|-\n! Upgraded\n| 642 || 595 || 28.2 || 30.0 || 16.7 || 7.6\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 390 || 356 || 264 || ~7 || ~3\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 360 || < 360 || < 450 || > 360\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 2,819 m || 2,272 hp || 3,612 hp\n|-\n! colspan=\"3\" | Setting 2\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 4,430 m || 2,220 hp || 3,530 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 9.5 mm steel - Around nose and behind pilot/navigator seats\n* 64 mm bulletproof glass - Armoured windscreen\n* Critical components located in the front and wings of aircraft (fuel, pilot, engine, controls)\n* Large amount of fuel tanks in the wings\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Molins Class M (57 mm)|Browning (7.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 1 x 57 mm Molins Class M cannon, chin-mounted (25 rpg)\n* 4 x 7.7 mm Browning machine guns, nose-mounted (500 rpg = 2,000 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nWhen used in Arcade Battles (AB), it is often best to find lone targets away from the main activity due to it's more specialized armament. Like the Mk.VI before it, the Mk.XVIII has no defensive armament; even a well-flown bomber may take you out. The 6-pdr can take out all three kinds of tanks (light, medium and heavy) as well as light pillboxes, the latter being the easiest as they are stationary. Line up your gun sights, aim centre and fire. The distance you fire from is up to personal preference, but a good starting point is 600 m. Light tanks can be taken care of from any angle and medium tanks can be dealt with from the sides and rear, but aiming at their front may cause bounces and is not a guaranteed kill. Heavy tanks are like medium, but a frontal attack is most certainly going to bounce this time. Don't forget that the tanks will be actively moving, which means that you will have to correct for horizontal accuracy as well. A good way to practice this is to jump into a custom game and practice on people driving tanks, as they can be harder to hit then a AI controlled vehicle.\n\nIn mixed ground battles, the aircraft can be used for CAS purposes as the 57 mm gun is effective against armoured targets if used correctly.  Should a player want to use the aircraft in GBR (ground realistic battle) they should either dive on targets and exploit weak roof armour or if the pilot is capable they should try and hit low side armour (this involves flying very low to hit weak points).\n\nIn Realistic Battles (RB), as with AB, you want to try and find some targets away from the main action. This process can be easier in RB and Simulator Battles (SB) as there are usually fewer people and the spotting distance of player-controlled aircraft is reduced. Stick down low and use the terrain to your advantage. Learn to fly low and fast, weaving up and down hills and valleys.\n\nThe same tactic applies with SB, but you are confined to the cockpit. The Mosquito in SB is probably the best mode to play it in for it to play as a ground attacker, and this is due to a few very good reasons. Firstly it is a very stable gun platform at high speed - This makes it easier to use in mouse aim and for beginners as it doesn't wobble as other planes would. The stability allows the Mosquito to fire the rockets or drop the bombs accurately (although still follow the same procedures as above in dive-bombing and rocket attacks). The game mechanics of SB are also in your favour, because flying low to the ground and there is no spotting system except for close proximity allies, you'll be a lot harder for the enemy to see against AB and RB. also being low to the ground will make it easier spotting the enemy, so-called by the SB aviators as \"spot the dot\", and the fully glazed canopy will also give you excellent vision (You had best bound the head's X and Y axis keys to make full use of this). As a fighter, it is also quite decent as long as you go up against aircraft no higher than .3 BR above you. Even stock it can manoeuvre with a 190 in turns and keep up with one in a short dive. The stable gun platform makes it easier to aim and hit the target from longer ranges - This is shown in the video below. There are downsides, however. The targeting sight is located to the right of the default view meaning you'll have to keep on zooming in to see the sight or move the head along the X-axis to see is in normal view. The second is that the artificial horizon has been covered up by the same gun sight. The final downside is that it has a somewhat high stall speed on landing and is quite high up for an aircraft. this makes it difficult to land and can result in an easy prop strike when you first fly it. Lastly, it is also recommended you have a wingman in this mode, be that another Mosquito or something like a Typhoon to cover your back when a more manoeuvrable fighter gets on your back. Just remember to not take any plane above the Mosquito's BR.\n\nThe Mosquito in Sim is a slightly different plane to what it is in RB. The manoeuvrability is somewhat improved with the lack of an instructor allowing it to dogfight more effectively. You can stick to opponents a lot easier and have a higher chance of winning. Against FW 190s the Mosquito can be a very good adversary as in real life and it can cause problems for 109s. Against the Japanese however, it is totally outclassed. All of the Japanese fighters will outmanoeuvre you so like in all other aircraft, don't turn with these. You can perform scissors somewhat better and it has very forgiving flying characteristics and pulls off some more advanced manoeuvres more sharply.\n\nSome tips for taking off in both RB and SB: In RB, apply flaps to take off and set 100% throttle (not WEP). Around 100 km/h (60 mph), level the nose down parallel to the ground and wait until you reach around 200 km/h (120 mph). At this point, gently pitch up and you should slowly ease into the air. As for SB, apply throttle little by little and some counter steer to the right as torque from the engines will try to turn you to the left. Follow as with the RB take-off and bring the nose parallel with the ground around 100 km/h (60 mph) and pitch up a little once you reach 200 km/h (120 mph) to ease into the air.\n\nAs mentioned above, the Mosquito has a rather high stall speed, making it easy to crash onto the runway when landing. If you use the same approach of cutting throttle and using landing flaps during touch down, the Mosquito is very likely to heavily smack into the ground, snapping its gears and causing a failed landing. The trick is to maintain higher speed when landing. You should align yourself with the runway about 1 km away, with an altitude of around 150 m. While you approach the runway, use 40-60% throttle and drop speed to around 230 km/h, and deploy combat/takeoff flaps and landing gears. When you are barely flying above the ground, make sure that your speed is still well over 190 km/h and descend very, very slowly. Only now should you deploy landing flaps. The huge body of the Mosquito allows it to decelerate quickly so don't worry about not having enough runway just because you approached fast. When taxiing, fully deflect elevators upwards and brake. Release brakes immediately as soon as your nose dips down, to avoid propeller strike.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Not controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Combined || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Stable gun platform, moves only a little even when firing the 57 mm Molins Class M cannon\n* Centralized guns, allows destroying targets at ranges up to 2 km with some practice\n* Very good in its role as an attacker\n* Good acceleration due to its light weight\n* Large cockpit with good visibility for SB\n* Has two pilots\n* 57 mm Molins Class M cannon has high penetration\n* Massive fuel load\n\n'''Cons:'''\n\n* No defensive armament\n* Not the most nimble of aircraft, at times it can feel very heavy and clunky, especially with the added weight from the gun and armour\n* Massive fuel load (minimum is 1 hr & 18 min, which adds a lot of weight)\n* Mediocre rate of climb\n* Inflexible with roles, can only be used effectively as an attacker and not much else\n* Single ammunition for 57 mm cannon lacks explosive filler: AP-T\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nThe main role of the \"Tsetse\" was that of anti-shipping and anti-submarine, attacking Axis ships upon orders or while on patrols. When performing an attack run, the \"Tsetse\" would dive at 30º from 5,000 ft (1,500 m), however, the auto-loading system was prone to jamming if the plane moved during the attack run. Carrying 25 solid AP rounds, it could fire them at a rate of 55 a minute, running dry in just under 30 seconds. As a result, pilots would fire a burst of 3 to 4 shells before circling around for the next target, also because they risked the ships returning AA fire. Fortunately, the \"Tsetse\" was fitted with 900 lbs (410 kg) of additional armour to the engine cowlings, belly and under the cockpit for added protection.\n\nThroughout its service, the \"Tsetse\" performed very well; the effectiveness of the new weapon was demonstrated on 10 March 1944 when Mk XVIIIs from 248 Squadron (escorted by four Mk VIs) engaged a German convoy of one U-boat and four destroyers, protected by 10 Ju-88s. Three of the Ju 88s were shot down. Pilot Tony Phillips destroyed one Ju-88 with four shells, one of which tore an engine clean off its wing. The U-boat was damaged. On 25 March, U-976 was sunk by Molins-armed Mosquitoes. On 10 June, U-281 was abandoned in the face of intense air attack from No. 248 Squadron and was later sunk by a Liberator of No. 206 Squadron. On 5 April 1945, five German surface ships in the Kattegat were attacked and again, the \"Tsetse\" demonstrated their value by setting them all on fire and sinking them, a German Sperrbrecher(\"minefield breaker\") was lost with all hands, with some 200 bodies being recovered by Swedish vessels. Some 900 German soldiers died in total. On 9 April, German U-boats U-804, U-843 and U-1065 were spotted information heading for Norway. All were sunk. U-251 and U-2359 followed on 19 April and 2 May 1945.\n\n=== In-game description ===\nThe de Havilland Mosquito was a twin-engine fighter-bomber which entered service with the RAF in 1941. Powered by two Rolls-Royce Merlin engines and constructed almost entirely of wood, the Mosquito possessed remarkable handling characteristics and performance for an aircraft of its size. Initially intended for use as a fast bomber and reconnaissance aircraft, early variants of the Mosquito carried no defensive weapons so as to save weight; the aircraft's defense was its incredible speed and acceleration.\n\nThe Mosquito FB Mk.XVIII was unlike any other variant in that it was fitted with a 57 mm anti-tank cannon in the nose; sources differ in the opinion of whether this was originally intended as an anti-tank or anti-submarine platform, but it was in the anti-shipping role with RAF Coastal Command which the Mk.XVIII would find most success. The 6-pounder cannon came to be known as the Molins gun; Molins were a company who had produced machinery for the cigarette industry in the inter-war period – they were able to adapt some of their designs to provide an auto-loading mechanism for the gun within the tight confines of the Mosquito's nose. Either two or four 0.303 machine guns augmented the Molins gun, and extra armour was added to protect the engines and aircrew. The Mk.XVIII came to be known as the Tse-tse by its crews, named after the notorious African Tse-tse fly as described by one pilot who commented the tse-tses bite was rather nastier than a normal Mosquito.\n\nThe standard attack profile for the Mk.XVIII involved entering a shallow dive from 2,500-3,000 ft (750-900 m), aiming at the target vessel's waterline so that damage would not only be caused on impact, but also below the waterline on the far side of the vessel on exit. With the aircraft's speed already in excess of 300 knots whilst in the dive, the shell's velocity was one of the highest in service. The Tse-tse Mosquito entered service in 1944 and achieved notable successes as part of the Banff Strike Wing operating from the East coast of Scotland against axis shipping around the coast of Norway.\n\nIsolated examples do exist of the Molins gun being used in the air-to-air role, with predictably spectacular results. Only some 45 Mosquito FB Mk.XVIIIs were produced, some converted from the 20 mm cannon armed FB.VI.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=mosquito_fb_mk18 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|4Rw863XFGd8|'''The Shooting Range #13''' - ''Metal Beasts'' section at 00:42 discusses the De Havilland Mosquito.}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Similar aircraft fitted with a 57 mm gun\n* [[Ki-102 otsu]]\n* [[T18B-2]]\n\n== External links ==\n<!--''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''-->\n\n* [https://forum.warthunder.com/index.php?/topic/330723-de-havilland-mosquito-fb-mkxviii/ Official data sheet - more details about the performance]\n\n{{AirManufacturer deHavilland}}\n{{Britain strike aircraft}}"}}