{"title":"Mosquito FB.Mk.26","pageid":7359,"wikitext":{"*":"{{About\n| about = Chinese twin-engine fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = Mosquito (Family)\n}}\n{{Specs-Card\n|code=mosquito_fb_mk26_china\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese strike aircraft {{Battle-rating}}. It was introduced in [[Update 1.91 \"Night Vision\"]].\n\nThe Mosquito FB Mk. 26 is a heavy-hitting fighter-bomber that can cover many roles in War Thunder as it could in real life. With the ability to equip bombs and rockets, it can play a part in both the ground and air war. Use its speed and firepower to show your enemies who really rules the battlefield. With the instructions below you can make full use of the Mosquito and even squad up because as in the war, you can never have enough wooden wonders. If you feel that you want to be like a real wooden wonder pilot give the [https://www.avialogs.com/aircraft-d/de-havilland/item/8501-ap2019e-l-t-pilots-notes-for-mosquito-fbvi-fb26 pilot's manual] a read.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nThe Mosquito is famed for its outstanding agility in the war, pilots often remarked it as being on par with fighters and nothing like what they had flown before. This was thanks to its light yet strong balsa and plywood frame while housing a pair of Rolls Royce Merlin engines.\n\nIn War Thunder, the manoeuvrability can seem far from the legend that surrounds it. Stock it is a heavy and somewhat lumbersome fighter that relies on slow-moving enemies to target. However, as the upgrades are unlocked and installed it slowly comes out of its shell to start being the plane so many grew up wanting to fly. The roll rate of the Mosquito is quite underwhelming as sometimes expected from such a large aircraft, being best at around 380 km/h (240 mph). The upside is that in the roll, the Mosquito has only a small wobble and so will allow for some well-aimed shots. The horizontal turn on the Mosquito is again not that impressive as one might expect but it is not just a brick with wings either. It has a mediocre turn radius in the flat and can turn with and inside other heavy fighters excluding the Japanese ones. It will undoubtedly not be able to out-turn all its single-engine opponents though with the Fw 190 being the exception in a sustained turn. Finally, the vertical manoeuvrability is decent and the Mosquito will only lose a small bit of altitude in a loop with combat flaps deployed. However, there is one upside. In Simulator battles, the Mosquito is not under the control of the instructor and there is an improvement in its performance. This allows it to be better in the fighter role than in RB if it were in the same matchup.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 3,780 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 578 || 564 || rowspan=\"2\" | {{Specs|ceiling}} || 29.4 || 30.5 || 4.0 || 4.0 || rowspan=\"2\" | 450\n|-\n! Upgraded\n| 663 || 618 || 26.7 || 28.0 || 15.1 || 8.5\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 390 || 356 || 264 || ~7 || ~3\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 360 || < 360 || < 450 || > 360\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 2,896 m || 1,215 hp || 1,725 hp\n|-\n! colspan=\"3\" | Setting 2\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 4,940 m || 1,130 hp || 1,605 hp\n|-\n|}\n\nIt is a good idea to set the compressor to the 2nd position while not using WEP at low altitudes in Realistic Battles. This will prevent the engines overheating, and will generate almost as much power as they do on 1st compressor's position with WEP. This will maximize motors' efficiency, especially because there is no need to open the radiator and increase drag.\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 64 mm Bulletproof glass - Armoured windscreen\n* 9.5 mm Steel plate in pilot seats\n* 9.5 mm Steel plate in the nose\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Hispano Mk.II (20 mm)|Browning (7.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 4 x 20 mm Hispano Mk.II cannons, chin-mounted (150 rpg = 600 total)\n* 4 x 7.7 mm Browning machine guns, nose-mounted (500 rpg = 2,000 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|G.P. Mk.IV (250 lb)|G.P. Mk.IV (500 lb)|RP-3}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 2 x 250 lb G.P. Mk.IV bombs (500 lb total)\n* 2 x 500 lb G.P. Mk.IV bombs (1,000 lb total)\n* 8 x RP-3 rockets\n\nThe Mosquito FB Mk. 26 has a fixed forward-mounted armament of four 7.7 mm Browning machine guns (500 rpg) and four 20 mm Hispano Mk.II (150 rpg) both with a variety of belts. For the machine guns, the \"Universal\" belt is highly recommended as it suits both ground attack and air combat although only for the use of tracers in the latter. Use the machine guns for ranging and attacking light targets, don't waste the cannons on those. The cannons are specific to their role, so you may want to think about what you want to do before you spawn. In the ground attack role, the \"Ground targets\" belt is the obvious choice for the cannons as 60% of the ammo is armour-piercing. This ammo can kill targets up to light tanks (attack from behind) and light pillboxes (through windows and doors). For anti-air, the belt of choice is \"Air targets\". This ammo makes light work of any aircraft. \"Stealth\" can also be used as it does not contain any Tracer component, sometimes allowing you to sneak attack unsuspecting opponents. This is also why the \"Universal\" belt on the machine guns are useful as it allows you to adjust your aim while using \"Stealth\" belts.\n\nThe cannons are mounted under the nose and so will need more lead than wing-mounted Hispanos, but the close grouping makes it far less affected by convergence. To use the cannons to kill ground targets, go into the virtual cockpit to gain the best accuracy. For tanks, line up behind them at least 0.6 km away and low to the ground. Begin to fire at the target at about 0.4 km, by aiming for the top armour of tanks and the back of the turrets as these areas are more likely to be penetrable. As for light pillboxes, these are stationary targets they will be easier to kill and so don't need as much setting up. Aim for the back of the pillbox or the window at the front. Of course, you will need ground target ammo to penetrate the armour of both targets. Flaps should be deployed as they will help you elevate quicker and stop you from crashing into trees or buildings. The tactics and knowledge you build from this will then come in very useful when playing the [[Mosquito FB Mk XVIII]] in the British Tech Tree as it is an even better ground attacker.\n\nThe 250 lb bombs are only useful if you are a skilled dive-bomber pilot as most targets need a direct hit or both 250 lb bombs to destroy them. The 500 lb is a better choice as it gives some leeway if the target is only slightly missed; they can also kill destroyers in one direct hit. To attack with bombs you want to line up with target >1 km out and change to the virtual cockpit. Dive on the target at 30 degrees or more with the steeper the dive the better. Release the bomb at around 300 m above the target, this should give you enough time to pull out of the dive and not blow yourself up. Bombs are recommended for pillboxes and stationary targets above all else. Rockets can be used both for anti-bomber as well as anti-ground. The rockets can also be used against destroyers and pillboxes although you need 4 rockets to hit to kill them allowing you to attack two with each loadout. Note when attacking ships come at their broadside at around -30 degrees, this will give you the largest target.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe Mosquito is one the best multi-role planes in the game due to its many redeeming aspects even at its high BR. The Mk 26 is at home as both a ground attack aircraft and a heavy fighter with the ability to easily switch roles in battle. Firstly, the plane packs a devastating punch with the quad 20 mm and can snipe pretty well due to its nose-mounted guns. This makes it a brilliant anti-bomber aircraft, especially with rockets. It is also decent against other heavy fighters, but never expect an easy fight (although the same could be said for the enemy). It can outrun a [[Bf 109 G-6]] at low altitude, although this doesn't mean you should always avoid using it as a fighter. With its rockets or 500 lb bombs, it can deal with 2 pillboxes while the cannons with ground ammunition can kill light pillboxes and medium tanks from behind, and the MGs can then tear up soft targets making it an awesome ground attack aircraft. The only real major downside is that the flight model and weapons profile match that of the series 1 Mk VI Mosquito. This means that the engines and the payload are both worse (less powerful Merlin 21 engines instead of the 25, and no external bomb storage) than what they would be if this was the series, two models, instead.\n\n'''Arcade Battles'''\n\nIn Arcade the best loadout will be the 500 lb bombs, with the artificial crosshairs it makes dive-bombing very accurate and easier to use than the rockets, they also have more flexibility in targets. The rockets aren't as good in Arcade due to the crosshairs making bombs the more accurate ordnance however they can still be useful for taking out bombers quickly and somewhat brutally providing they are well aimed. The cannon ammo will probably favour the universal belt as you'll have to be more diverse in the role played in Arcade matches than in RB/ SB. For attacking aircraft, bombers are a good target as the Mosquito can take some punishment (although not to the engines) and will quickly deal with the bombers with its cannons. For fighters stay fast and use it like a Beaufighter to quickly kill a target and get out, do not get caught up in dogfights. Remember you can't do anything if you're dead.\n\nThe best mode is Ground strike for Arcade, this gives a few choices that the Mosquito can undertake. Firstly the anti-bomber role can be played to stop the opposing team base rushing the match to a quick end. It will also provide plenty of air kills while little interference from other fighters. The second is to pray on the low and ground attacking aircraft or the enemy aircraft that are attacking the friendly ground strike aircraft as they will also be low and vulnerable. Attack these by \"Boom and Zoom\" tactics as turning will slow the Mosquito down and make it an easy target. Finally, you can go ground strike yourself. The 500 lb bombs will hit the heaviest of targets and destroy them while also being very accurate with the bombsight. You can engage in normal fighter combat but this will be riskier.\n\nDomination mode is a good mode if a bit of luck is added. Stay high and above the fight and pick off enemies that present an easy target (like capping an airfield or at the top of a loop). Again use diving attacks to stay at an advantage over other enemy aircraft and engage from as far out, the domination mode does allow for some ground attack gameplay but it is only recommended you make one pass then engage fighters and other aircraft.\n\nThe air domination mode. This is the worst mode for the Mosquito as there will always be high altitude players and few bombers to prey on. The only safe way to play this mode is to take targets of opportunity while keeping a reasonable height. However, there is always the tactic of going in headfirst and with a whole lot of luck having an amazing game.\n\n'''Realistic Battles'''\n\nThe approach into battle is dictated by what the role want to achieve in that game. For heavy fighters, climb into battle to obviously get altitude and hopefully be above the enemy, however, this is hard to achieve due to the bad climb rate. Climb at around 150 mph/ 240 kilometres per hour*, WEP from takeoff allows the Mosquito to climb at 180 miles an hour/ 290 km an hour* at around 15 degrees. Also, side climbs until around 2,500 m. At this altitude, the water will start to overheat and so release the WEP and lower the angle to 10 degrees to keep the speed up. At around 3,500 m, begin to climb into the battle area maintaining the 10 degrees angle of attack. This will take the Mosquito to the same altitude as the bombers or just below the highest enemy players (you'll be at a minimum of 4,500 m). This should allow you to engage the targets you want.\n\nFor ground attackers, go for a more unconventional approach. Fly low to the ground and use the terrain to the advantage to stop you being seen, never above 400 m of the ground. Fly around the map and not through the middle this will stop the Mosquito flying into enemy view ranges and to get the target unnoticed. Avoid going to the map edges as this will be a waste of time for everyone. Alternate history Krymsk is a good example of this. As on takeoff, stay low to the sea and fly close to the mountains on the right. As the destroyers come in range the then fly in between the mountains and to avoid being shot down by them. You'll then be able to attack the enemy pillboxes without the enemy knowing until the first few ground targets have been destroyed.\n\nUsing the Mosquito is quite difficult due to its enemies and its own rather lacking speed. You want to keep your speed up and don't dogfight if you don't have to as any fighter will be able to get on the six of the Mosquito. The best way to play the Mosquito is like most other heavy fighters, and that's to do single diving attacks and get as much damage in as possible. To make full use of the Mosquito you want to be using Air targets belts for the cannons and open fire at around 400-500 m. Take appropriate aim but remember the cannons are mounted under the nose so they require a bit more lead than nose-mounted ones. The reason for shooting at a long distance is that usually the enemy will only just start to react and so the shot will be easier than a close-range snapshot. Use vertical manoeuvres to engage an opponent but if you are on a higher energy state or barrel roll to get some more deflection shots. The best targets are other heavy fighters, attackers and best of all are bombers. The Mosquito is somewhat manoeuvrable and so can dogfight if needed but it will be a hard fight. Scissors are an option depending on the opponent but aren't recommended- these can be used on other heavy fighters or 190s if they try and follow you in flat turns.\n\nTo defend against a diving opponent apply downwards rudder and then immediately apply some roll. This will throw most of the initial shots of the target and cause the enemy to react quickly or pull off for another attack. You can also begin a flat tun with combat flaps deployed. Then once they are about to enter firing range apply full upwards elevator and roll under your self but elongate the roll slightly. If they overshoot they will either go vertical or carry on in their bearing. If they go vertical begin a flat turn and react to what they do next. If they immediately begin the other attack roll out of the way or if you have height do a split-S in hope of throwing off their attack. It is not much you can do to get back on the offensive so just focus on being defensive and call for help. If they do overshoot and carry on their bearing without climbing, try and take a few ranging shots as you have a good chance of hitting but the window of opportunity will only be open for a short period of time.\n\n'''Simulator Battles'''\n\nThe Mosquito in SB is probably the best mode to play it in for it to play as a ground attacker, and this is due to a few very good reasons. Firstly it is a very stable gun platform- This makes it easier to use in mouse aim and for beginners as it doesn't wobble as other planes would. The stability allows the Mosquito to fire the rockets or drop the bombs accurately (although still follow the same procedures as above in dive-bombing and rocket attacks). The game mechanics of SB are also in your favour, because flying low to the ground and there is no spotting system except for close proximity allies, you'll be a lot harder for the enemy to see against AB and RB. also being low to the ground will make it easier spotting the enemy, so-called by the SB aviators as \"spot the dot\", and the fully glazed canopy will also give you excellent vision (You had best bound the head's X and Y axis keys to make full use of this). As a fighter, it is also quite decent as long as you go up against aircraft no higher than .3 BR above you. Even stock it can manoeuvre with a 190 in turns and keep up with one in a short dive. The stable gun platform makes it easier to aim and hit the target from longer ranges - This is shown in the video below. There are downsides, however. The targeting sight is located to the right of the default view meaning you'll have to keep on zooming in to see the sight or move the head along the X-axis to see is in normal view. The second is that the artificial horizon has been covered up by the same gun sight. The final downside is that it has a somewhat high stall speed on landing and is quite high up for an aircraft. this makes it difficult to land and can result in an easy prop strike when you first fly it. Lastly, it is also recommended you have a wingman in this mode, be that another Mosquito or something like a Typhoon to cover your back when a more manoeuvrable fighter gets on your back. Just remember to not take any plane above the Mosquito's BR.\n\nThe Mosquito in Sim is a slightly different plane to what it is in RB. The manoeuvrability is somewhat improved with the lack of an instructor allowing it to dogfight more effectively. You can stick to opponents a lot easier and have a higher chance of winning. Against FW 190's the Mosquito can be a very good adversary as in real life and it can cause problems for 109s. Against the Japanese however, it is totally outclassed. All of the Japanese fighters will outmanoeuvre you so like in all other aircraft, don't turn with these. You can perform scissors somewhat better and it has very forgiving flying characteristics and pulls off some more advanced manoeuvres more sharply.\n\nAs mentioned above, the Mosquito has a rather high stall speed, making it easy to crash onto the runway when landing. If you use the same approach of cutting throttle and using landing flaps during touch down, the Mosquito is very likely to heavily smack into the ground, snapping its gears and causing a failed landing. The trick is to maintain higher speed when landing. You should align yourself with the runway about 1 km away, with an altitude of around 150 m. While you approach the runway, use 40-60% throttle and drop speed to around 230 km/h, and deploy combat/takeoff flaps and landing gears. When you are barely flying above the ground, make sure that your speed is still well over 190 km/h and descend very, very slowly. Only now should you deploy landing flaps. The huge body of the Mosquito allows it to decelerate quickly so don't worry about not having enough runway just because you approached fast. When taxiing, fully deflect elevators upwards and brake. Release brakes immediately as soon as your nose dips down, to avoid propeller strike.\n\n===== Armament options =====\n'''Belt type recommendations'''\n\n'''20mm Hispano belts'''\n\n* '''Default:''' HEF-I{{-}}HEF-I{{-}}P{{-}}T - As stated, the default belt is very average and due to no Armour-Piercing shells it cannot penetrate armoured targets.\n* '''Universal:''' HEF-I{{-}}HEF-SAPI{{-}}AP{{-}}T - An all-round belt that is reliable for air targets but with only one Armour-Piercing shot every 4th shell it is not a reliable anti-armour belt.\n* '''Ground targets:''' AP{{-}}AP{{-}}AP{{-}}HEF-I{{-}}T - A belt to destroy armoured targets, it has 60% Armour-Piercing and so is reliable in its role. It can double up as an anti-air if needed but the AP shots will do little damage so aim for the engines or cockpit.\n* '''Air targets:''' T{{-}}HEF-I{{-}}HEF-SAPI{{-}}HEF-I{{-}}HEF-SAPI - The best anti-air belt but won't be able to penetrate armoured targets.\n* '''Tracers:''' AP{{-}}T{{-}}HEF-I - Another all-round belt, if you are not confident with aiming this can help you practice and then you'll know how to adjust it. It can kill armoured and air targets but is by no means the best for either (Bad for stealth attack).\n* '''Stealth:''' HEF-I{{-}}HEF-I{{-}}HEF-SAPI{{-}}AP - Much like the Air targets belt but without the Tracer bullet for a completely invisible belt. Good if you are confident in your aim for the occasional small advantage of surprise.\n\n'''7.7 mm Browning .303 belts'''\n\n* '''Default:''' T{{-}}AP{{-}}AP-I{{-}}Ball{{-}}Ball{{-}}I - Average belt, can score a critical semi-regularly.\n* '''Universal:''' T{{-}}AP{{-}}AP-I{{-}}AP-I{{-}}I - Same as the Default belt but removal of the useless ball round and is the best for ground attack.\n* '''Tracers:''' IT{{-}}AP-I - Best anti-air belt and most likely 7.7 mm belt to cause a fire.\n* '''Stealth:''' AP-I{{-}}AP-I{{-}}I - Technically the best belt for soft targets but Universal is more useful as it has tracers allowing you to adjust the fire.\n\n'''Recommended Payloads in Realistic and Simulator battles'''\n\nAI Ground Targets the Mossie can kill (with minimum weapon needed)\n\n7.7 mm Browning .303\n\n* AAA/ Artillery\n* Armoured car/ Mobile AAA/ vehicle\n* Landing craft\n\n20 mm Hispano\n\n* Patrol boats\n* Light tanks - 20 mm\n* Light pillbox - 20 mm (Aim for the [http://i.imgur.com/wOFFdBd.webm front window])\n\n250 lb bomb / 1 rocket\n\n* Bridge\n* Cargo ships\n* Medium tanks (very hard to do with the 20 mm)\n\n500 lb bomb/ 4 rockets\n\n* Destroyer\n* Pillbox\n* Heavy tank (not rockets)\n\n===== Attack methods =====\n'''How to dive bomb in the Mosquito'''\n\nAlthough the basics are the same for dive-bombing in general, the Mosquito has no air brakes and a low red-line speed making speed management very important. This also stops you from getting very steep angles, as you run a very high risk of crashing. If you don't keep one eye on the speed then you will either red-line before you know it or be a victim of control stiffening. You'll need to learn how to dive-bomb at a more shallow angle with less speed.\n\nApproaching the target you want to around 1,000 m (3,000 ft) of altitude, any more and you'll start to over-speed in the dive and any less won't give you enough time to aim. Fly true to the target but keep an eye on it with the target lock. Once the target is at the bottom of the screen, cut the throttle and begin the dive. Begin at -30° for the first 400 meters (1,200 ft) then you'll need to go down to -40°/-45°. This should bring the gun sights over the target although a little adjustment will need to be made as every situation is different. Release the bomb(s) 300 m from the ground and pull up. Bring the throttle to WEP and climb out at +30° and level off when you like (+30° gives you the most altitude for the speed in tests).\n\n'''How to use the rockets on the Mosquito'''\n\nUnlike dive-bombing where you have to be slightly different, you can use the same techniques with the rockets as you do any other aircraft. The thing to watch out for on the Mosquito is the wide wingspan making it less forgiving on when they converge. However, this isn't a massive hindrance. Tanks are hard to hit unless you use them a lot and know how to fully work them. Therefore the two types of targets you should use the rockets for are both Naval and stationary land targets.\n\nFor ships, you should almost treat it like your dive bombing but with a few changes. You can be at any altitude between 600 m and 1,000 m although 1,000 m is recommended as you'll see now. Firstly line up to to the ship's broadside (ahead of it if it's moving), level out and switch to the virtual cockpit. Begin your dive once the ship is near the bottom of the screen aiming for about -35° angle of attack. As you dive you may have to go slightly steeper to keep the crosshairs on the target. At 250-300 m fire the rockets and full elevator, climb away at 30°. Again adjust if you need to and here is a short clip demonstrating an attack in a test flight.\n\nThe second way is the more common attack. Come in low to the ground and level out by at least 800 m away. Deploy combat flaps to give you more lift and so the Mosquito will be able to pull up easier and will also give you the ability to bring the nose down a bit more. Once you are at the convergence range fire the rockets and pull up. This is a more simple attack and will be easier after a few attempts.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Not controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Combined || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Extremely good manoeuvrability for a twin-engine fighter\n* Four nose-mounted cannons with a good amount of ammunition\n* Usable payload that can have a large impact on the ground battle\n* Cockpit has good visibility\n* Great turning ability compared to other twin-engine aircraft, further benefited with combat flaps\n\n'''Cons:'''\n\n* Large default fuel load\n* Large engines are prone to damage\n* Wooden airframe can't take as much damage as other twin-engine fighters\n* Copilot/navigator appears to not count in damage model, so losing the front pilot will make you lose the plane\n* Flaps appear to tear at lower speeds than that of most other aircraft\n* As with all British aircraft, Hispano cannons overheat and jams easily\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n=== Development ===\nThe Mosquito began life in a more than shaky start. In 1936 the Ministry issued Specification P.13/36 that stated a twin-engine bomber that could carry a payload of 3,000 lb for 3,000 miles while having a maximum speed of 275 mph. It was also stated that it should also carry 8,000 lb at shorter ranges. Geoffrey de Havilland sent a letter to an Air ministry council member Air Marshal Wilfrid Freeman stating that a high-speed bomber could be made out of wood and powered by RR Merlin engines as there would be a shortage of strategic metals in a war. However, Freeman replied that it would fall short of the specification by either bomb load or speed both of which were important.\n\nDe Havilland believed that the adjustment was too large and that he should design the new bomber with no unneeded equipment. He began to base his new design on the DH. Albatross airliner. He would add a tail turret and around two manual guns to the design and replace the power plants with Merlin X engines. There would be a crew of 3 and a top speed of 300 mph. Although de Havilland still believed the design could be improved more and looked at other designs based on the albatross.\n\nThe new design would be more aerodynamic, wooden and powered by the Merlin engine. He also wanted to remove any gun turrets to make less weight and manufacturing easier. It would also be manoeuvrable to make it easy to avoid fighters and future fighters. However, the design was the opposite of the Air Ministry's current ideology and so little interest was shown. By the 4th of October 1939, the design had become a fast twin-engine light bomber and had moved to the secure location of Salisbury Hall for further work. However, the design was still too radical for the Air Ministry. The outbreak of war made the now DH. 98 a bit more attractive but the lack of defensive armament still made the Air Ministry cautious of the design. A small remote-controlled turret was added at the back of the cockpit to please the Ministry. On the 12th of November, during a meeting between the Air Ministry and the aircraft companies, de Havilland showed that his design could reach 500 mph and so was able to drop the requirement for a turret.\n\nA month later the Vice-Chief of the Air Staff, Director General of Research and Development, Air Officer Commanding-in-Chief of RAF Bomber Command had a meeting to see where the DH.98 could fit into RAF service. the Air Officer Commanding-in-Chief of RAF Bomber Command refused the design for a fast bomber but instead believed it would fit in as a photo-reconnaissance aircraft. On the first of January, the DH.98 received backing after a mock-up was inspected resulting in an order of a prototype. Two months later in March 50 bomber reconnaissance variants were ordered and the May specification of F.21/40 resulted in the cannon-armed fighter variant. The fighter variant kept the mosquito alive due to its performance numbing the criticism from the government and Air Ministry even after it had shown its performance.\n\n=== Joining the Chinese forces and their quick demise ===\nDue to the severe losses of [[B-25J-30 (China)|B-25s]] during the Chinese Civil War, ROCAF bought 205 Mosquitos from Canada in 1948; after losing one-third of these new aircraft during flight trainings, they soon joined the major battles in the civil war, 4 were captured by PLAAF and one of them defected. Although their performance in the European battlefield was wonderful, due to the humid environment at Taiwan, the remaining Mosquitos in ROCAF were all dismantled in 1950. While they were still flown by the PLAAF, they soon joined their fellow brothers in the graveyard in 1953 after the import of [[IL-10 (1946) (China)|IL-10s]].\n\nThe only remaining Mosquito FB.26 in Asia is in Beijing Aviation Museum at Xiaotangshan, assembled with parts from those 5 remaining Mosquito in Mainland China. Parts of it served as the repair reference for Mosquitos T.III TV959, one of the four airworthy Mosquitos.\n\n== Media ==\n''Excellent additions to the article would be video guides, screenshots from the game, and photos.''\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''encyclopedia page on the aircraft;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/114476-de-havilland-mosquito-fb-mk-vi/ Official data sheet - more details about the performance]\n\n{{AirManufacturer deHavilland}}\n{{China twin-engine fighters and strike aircraft}}"}}