{"title":"P-40C","pageid":169,"wikitext":{"*":"{{About\n|about= premium American fighter '''{{PAGENAME}}'''\n|other\n|usage-1 = other versions\n|link-1 = P-40 (Family)\n|usage-2 = other uses\n|link-2 = P40 (Disambiguation)\n}}\n{{Specs-Card\n|code=p-40c\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_p-40c.jpg\n|market=items_P-40C Warhawk (USA)\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} American fighter {{Battle-rating}}. It was introduced in [[Update 1.75 \"La Résistance\"]] and obtainable during the [[wt:en/news/5224-special-festive-quest-en|2017 \"Festive Quest\"]] event. It was later made available as a battle trophy vehicle in the Warbond shop from the [[Battle Pass: Season I, 75th Anniversary of the Great Victory]] until the end of the [[Battle Pass: Season IV, \"Fearless Voltigeur\"]].\n\nThe P-40C is nearly identical in looks to its successor, the P-40E. However, the distinguishing part of the P-40C are the nose-mounted .50 cal machine guns. This allows you to have a denser cone of fire in contrast to other US aircraft at this battle rating.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,500 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 537 || 521 || rowspan=\"2\" | {{Specs|ceiling}} || 20.0 || 20.7 || 8.8 || 8.8 || rowspan=\"2\" | 343\n|-\n! Upgraded\n| 588 || 561 || 18.0 || 19.0 || 16.4 || 12.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 795 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || 595 || 530 || 245 || ~13 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 420 || < 380 || < 420 || > 310\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 38 mm Bulletproof glass - Armoured windscreen\n* 9.5 mm Steel - Armour plate behind engine\n* 8 mm Steel - Armoured plate behind the pilot\n* Self-sealing fuel tanks (1 under pilot, 1 under pilot's feet, 1 behind pilot)\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M2 Browning (12.7 mm)|Browning (7.62 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 2 x 12.7 mm M2 Browning machine guns, nose-mounted (235 rpg = 470 total)\n* 4 x 7.62 mm Browning machine guns, wing-mounted (490 rpg = 1,960 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|AN-M64A1 (500 lb)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 1 x 500 lb AN-M64A1 bomb (500 lb total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe most plausible manner to use this aircraft is in the Boom & Zoom role, given its fast speed in a dive. In addition, the nose-mounted .50 calibre can help you preform certain attacks a P-40E pilot only could dream of doing. However, there are certain methods to using the plane, as it is an earlier iteration of the P-40.\n\nThe first method is to climb to altitude, and try to intercept enemy attackers and bombers. This tends to play in favour of the P-40C, due to its excellent top speed of 528 km/h (328 mph) at 3,800 meters (12,467 feet.) That being said though, you are inhibited by its relatively slow rate of climb of only 10 meters/second (32 feet/second.) On the contrary, once you reach altitude, Boom & Zoom as much as you want against bombers, as your high dive speed will make it difficult for most gunners to target you. In addition, you have a nice turn speed of 21 seconds, which can allow you to snap over on some opponents with relative impunity. If you do find yourself fighting in the vertical, flaps will also be of use to you, as they do have a decent speed tolerance before they snap off.\n\n* In Simulator, the P-40 can be used for BnZ fighting, bomber hunting and ground pounding. It is a decent plane with distinct pros and cons. Its heavy firepower of 2 x 12.7 mm and 4 x 7.62 mm MGs can critically damage the enemy and rip it apart. It also has great dive speed and decent level speed, capable of outrunning slower opponents like A6M. However, it is a nose-heavy plane so unlike other planes, the P-40 has to trim the elevators upwards. It has extremely limited visibility with lots of canopy frames and a razorback design which obstructs the backwards visibility. The P-40's over-the-nose visibility is one of the worst due to its big, long engine, and the small intake on top of the cowling, making leading very hard. Moreover, its engine tends to overheat frequently even with 95% throttle, meaning you have to cut throttle a lot to avoid damaging the engine. Before entering a battle, it is recommended to set keybinds for trimming and vertical head movements to improve the forward visibility a bit. Take at least 30 minutes of fuel. Set the convergence between 250-500 m, with vertical targeting on.\n* For dogfighting, because almost all aerial battles in Sim occurs at around 3,000 m, the P-40 can easily climb to this altitude and gather up lots of speed before engaging a battle. The tactic is similar to the RB tactics above, which is to keep speed and boom and zoom. If, unfortunately, you find yourself being chased on your six and you don't know how to do any defensive manoeuvres, do a large, smooth turn towards the nearest friendly airfield to avoid bleeding too much speed. Then shallow-dive towards your airfield. The P-40 can quite easily outrun opponents like the [[A6M (Family)|A6M]] or [[I-15 (Family)|I-15]], but struggles to outrun [[Bf 109 (Family)|Bf 109 F/Gs]], [[Fw 190 (Family)|Fw 190 A]] or other [[P-40 (Family)|P-40s]]. Another way of disengaging is to do a sudden Split-S to dodge under the chaser. Average Sim players will now try and see where you went, if not immediately losing track of you. You can then run for your airfield or shallow climb for another attack.\n* You want to be more careful when hunting bombers, since with the Sim control (whether it be mouse joystick or a real stick) the plane will manoeuvre much more gently, making itself a great target for the bomber's gunners. DO NOT follow behind a bomber's six unless you are sure that its tail gunners are unconscious. Chasing behind a bomber makes yourself pretty much stationary for the tail gunners, and you will be showered with bullets. The engine of the P-40 will usually get damaged. Instead, before launching an attack, get an altitude advantage over the bomber by flying around 2 km above it. The bomber should only fill up about 1/6 of your gunsight. The best position for an attack is at the bomber's high six so you can adjust the lead much easier. Dive at the bomber, but not directly at it, try to predict where you two will crash by imagining yourself as a missile, that's where you should aim at (deflection shooting). To maximise the damage it is better to aim for their wings and engines, as the fuselage usually soaks up quite some bullets. Only fire when the bomber passes in front of your guns. This short window might seems inadequate to do anything, but the six MGs on the P-40 are actually pretty destructive, as sometimes it only takes one bullet to set the target aflame.\n\n====Specific enemies worth noting====\n<!--Some concerning vehicles to worry about if playing this plane. (i.e. Japanese fighters will out turn you)-->\nPerhaps the biggest threat comes from facing any Japanese plane at this battle rating. They can turn so much faster than you as to bleed your speed and energy to the point of stalling out. The greatest threats come from the Ki-44s and the [[A6M2-N]]. In addition, the Ki-43 has significantly greater manoeuvrability than you. The vast majority of these planes have guns similar in calibre to a .50 cal, which means that they have the firepower to dispatch you at a fairly fast rate.\n\nIn terms of the British, any Spitfire or Hurricane will out-turn you. While they do not have as heavy of armament as you do, the sheer rate of fire from the .303s can light up exposed ares of the plane, or even score a pilot kill. While it is mostly unlikely, the Spitfire Mk. IIb not only boasts manoeuvrability, but also two 20 mm Hispano cannons, which can tear you to bits. In addition, almost all British fighters can out-climb you, which leaves you at a disadvantage in energy.\n\nThe Germans have the most planes that can give you a problem, due to the vast majority of them having 20 mm cannons. Most notably are aircraft like the [[Bf 110 (Family)|Bf 110]] and the [[Bf 109 E-3]]. You also do have to worry about aircraft like the [[Bf 109 F-1]], which has a 20 mm cannon in the propeller hub. While it is unlikely, you may also face the [[Fw 190 A-1]]. Most German planes will have a significantly better climb rate than you and be able to energy fight you more efficiently. As mentioned earlier, most German planes boast much heavier firepower than you, which renders you at a disadvantage in punching power.\n\nMost Soviet planes will also give you a run for your money. Almost all of the Soviet planes boast only nose-mounted weaponry, giving them a significant advantage over most allied planes. The most common enemies to worry about are any plane with the prefix \"Yak\". Perhaps the most common cause of US teams being defeated by the Soviets, is the fact that they head on an IL-2. Never under any circumstance head on an IL-2.\n\n====Counter-tactics====\n<!--What to expect, if it would be in command of the enemy and how to counter it. (i.e. They will most likely BnZ, etc.)-->\nAs mentioned earlier, the P-40C has nose-mounted .50 cals, which can make short work of almost any fighter at its battle rating. The aircraft also has a tighter turning time than the P-40E, which can give a P-40C pilot a small advantage. If a P-40C finds its way onto your tail, try to make the pilot over-shoot or bleed energy. The cockpit, while having more protection than an open top and a bubble canopy, is still a fairly vulnerable spot, so pilot snipes aren't uncommon.\n\nHeads up for German and Soviet pilots! While aircraft like the Bf 110, LaGG-3 and the Yaks have nose-mounted weaponry, an experienced P-40C player can still make you pay dearly in a head-on. If you find yourself in a head on with a P-40C, fire a short burst, then hit the deck to avoid being hit by return fire. This is especially true with the Soviets due to their wooden airframe.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Auto control available || Not controllable<br>Not auto controlled || Controllable<br>Auto control available || Combined || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Rather sturdy airframe\n* Dense firepower\n* Plentiful .30 cal ammunition\n* Able to carry a 500 lb bomb, which can be useful against ground targets (mixed ground battles)\n* Slightly tighter vertical turning circle than the P-40E\n* Strong rudder authority\n* High rip speed\n\n'''Cons:'''\n\n* Scarce .50 cal ammunition\n* Low energy retention\n* Modest rear-cockpit visibility\n* Modest climb rate\n* Somewhat slow roll\n* Very hard compression beyond 600 km/h\n* Poor high altitude performance\n* Rather unstable in pitch axis in SB\n* Extremely bad visibility over the nose in SB\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nThe P-40C Warhawk, known as the Tomahawk IIB in British service, was an improvement of the P-40B. The P-40C added provisions for underbelly fuel drop tanks and bomb shackles, added self-sealing fuel tanks, and also featured numerous minor improvements. All of these changes increased the weight of the aircraft, which had already suffered from a low power-to-weight ratio.\n\nIn the European and Mediterranean theaters, the P-40 was used heavily from 1942-1943. Notably, the first confirmed shoot down of a German aircraft by a USAAF unit occurred on 14 August 1942.  2nd Lt Joseph D. Shaffer of the 33rd Fighter Squadron, intercepted a Focke-Wulf Fw 200C-3 maritime patrol aircraft that flew over his base in Reykjavik, Iceland. Flying a P-40C, he damaged the Fw 200, which was finished off by a P-38F Lightning. P-40s were used heavily during the African Campaign, especially during Operation Flax; this operation resulted in large numbers of Axis transport aircraft shot down, along with many fighter aircraft.\n\nIn the Pacific theater, the P-40 was one of three types that did the most to curb the Japanese air power in the early war, along with the P-39 Airacobra and the F4F Wildcat. It was the most numerous fighter aircraft in service with the USAAF in that theater from 1942-1943.\n\nIn the China Burma India Theater until 1944, notably being used by the American Volunteer Group (AVG) - known as the Flying Tigers. In that theater, the P-40 was used to establish complete air superiority over China, and was also used to attack ground targets such as bridges.\n\nAfter 1943, in most theaters (all but the China Burma India Theater) the P-40 was replaced by P-51 Mustangs, P-38 Lightnings, and P-47 Thunderbolts.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=p-40c Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|omfXnBHSFws|'''Premium Review: P-40C [Flying Tiger!]''' - ''Jengar''|WCXeaXW2y1g|'''\"The P-40C is it worth it?''' - ''Ash''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n* Curtiss [[P-36 (Family)|P-36]] Hawk\n\n;Aircraft of comparable role, configuration and era\n* Bell [[P-39 (Family)|P-39]] Airacobra\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/5220/current|[News] P-40C: Flying Tiger]]\n* [https://forum.warthunder.com/index.php?/topic/395303-curtiss-wright-p-40c/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Curtiss}}\n{{USA fighters}}\n{{USA premium aircraft}}\n{{Winter Event}}"}}