{"title":"P-40E-1 (USSR)","pageid":430,"wikitext":{"*":"{{About\n|about=Soviet fighter '''{{PAGENAME}}'''\n|other\n|usage-1 = other uses\n|link-1 = P40 (Disambiguation)\n|usage-2 = other vehicles of the family\n|link-2 = P-40 (Family)\n}}\n{{Specs-Card\n|code=p-40e_ussr\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_p-40e_ussr.jpg\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium rank {{Specs|rank}} Soviet fighter {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27.\n\nThe P-40E Kittyhawk is mainly used as a fighter, but can also be converted to a fighter-bomber with the option of adding bombs. The 6 x 12.7 mm Brownings make excellent air-to-ground combat weapons, with an excellent ammo count, but this can leave the Kittyhawk weak if doing constant manoeuvres for a firing position. The aircraft is designed as an all-round fighter, but any RB Kittyhawk flyer will tell you it is best at medium and lower altitudes (3,000 m is normally that middle altitude). This is because the engine's performance is poor at higher altitudes, unlike its successor, the [[P-51D-5|P-51]] and overall, the engine isn't the best at its tier: the aircraft's main asset is straight-line speed- it will easily outrun [[Bf 109 E-3|E-3s]] (though not out-climb) and the [[A6M2|A6M2 Zero]]. Head-ons are somewhat advisable against lightly/ un-armoured targets, such as the Zero, but otherwise, the best attack plan is to use the straight speed to catch, then energy-save-climb a few 100 meters and then dive onto the opponent before running again.\n\nAlthough it can be used as a fighter-bomber, it is recommended to not use bombs on the plane to keep its manoeuvrability up for its main purpose: dog-fighting.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 3,810 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 533 || 514 || rowspan=\"2\" | {{Specs|ceiling}} || 22.0 || 22.8 || 6.8 || 6.8 || rowspan=\"2\" | 343\n|-\n! Upgraded\n| 592 || 560 || 20.3 || 21.0 || 15.9 || 10.6\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 819 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || 595 || 530 || 245 || ~13 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 420 || < 380 || < 420 || > 340\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 38 mm Bulletproof glass to the front\n* 9.5 mm Steel plate in front\n* 8 mm Steel plate in the pilot's back\n* 6.35 mm Steel plate flaps attached to the rear\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M2 Browning (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 6 x 12.7 mm M2 Browning machine guns, wing-mounted (312 rpg outer + 291 rpg middle + 240 rpg inner = 1,686 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|FAB-100sv (100 kg)|FAB-250sv (250 kg)|FAB-500sv (500 kg)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 1 x 500 kg FAB-500sv bomb (500 kg total)\n* 1 x 250 kg FAB-250sv bomb + 2 x 100 kg FAB-100sv bombs (450 kg total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n'''Air RB'''\n\nThe P-40 is good at low altitude and turn-fights. Compared to planes like Bf-109's that it faces, eg [[Bf 109 E-3|the E-3]], [[Bf 109 G-2|G-2s]] and [[Bf 109 F-4|F-4s]], these aircraft can't keep up in a turn but are overall faster. The speed of this aircraft, 560 km/h makes it pretty fast for its tier and battle rating, however, this is only applied at lower altitudes. An important point to remember is that this aircraft '''cannot''' perform above 5,000 m. While it can eventually reach 9,555 m, it is all but useless at this altitude, since any aircraft it would typically meet at that height would have superior engines that work best at these altitudes.\n\nWhen you dive on other planes, watch your speed! This aircraft is nearly uncontrollable at a speed of 600 km/h or faster when in dive. It is advised to stay at a perfect combat speed of 400 - 500 km/h. The Kittyhawk's 6 x 12.7 mm makes it very powerful for its tier because other planes at this tier have only started utilizing cannons and are typically outfitted with mostly lower calibre guns such as 7.7 mm or the like. The 1686 Round of the 12.7 mm can be conserved, however spraying will cause the ammo count to reduce very quickly- hitting the target well ( wings and control surfaces )is very effective. An aware and good pilot can make up to 5 kills in a single round against human pilots. Watch your engine temperature when you climb- if you climb- as it will sit at an acceptable level of heating unless damaged. When diving, set the throttle to 0% to reduce temperature and speed when diving- the most embarrassing thing would be to crash into the ground due to control lock-up!\n\n'''Ground RB'''\n\nThe P-40 can excel as a fighter as air battles often take place at lower altitudes in order to support allied ground units. The P-40 can out-turn most of its contemporaries and can also boom and zoom on slower, less armoured targets (i.e. a lot of Japanese air vehicles). Below is a list of some air units you will face and should take care in engaging.\n\n'''Air SB'''\n\nThe P-40 can be used for BnZ fighting, bomber hunting and ground pounding in Sim. It is a decent plane with distinct pros and cons. Its heavy firepower of 6 x 12.7 mm MGs can critically damage the enemy and rip it apart. It also has great dive speed and decent level speed, capable of outrunning slower opponents like A6M. However, it is a nose-heavy plane so unlike other planes, the P-40 has to trim the elevators upwards. It has extremely limited visibility with lots of canopy frames and a razorback design which obstructs the backwards visibility. The P-40's over-the-nose visibility is one of the worst due to its big, long engine, and the small intake on top of the cowling, making leading very hard. Moreover, its engine tends to overheat frequently even with 95% throttle, meaning you have to cut throttle a lot to avoid damaging the engine.\n\nBefore entering a battle, it is recommended to set keybinds for trimming and vertical head movements to improve the forward visibility a bit. Take at least 30 minutes of fuel. Set the convergence between 250-500 m, with vertical targeting on.\n\nThe tactics against fighters remain the same as above - BnZ them.\n\nYou want to be more careful when hunting bombers, since with the Sim control (whether it be mouse joystick or a real stick) the plane will manoeuvre much more gently, making itself a great target for the bomber's gunners. DO NOT follow behind a bomber's six unless you are sure that its tail gunners are unconscious. Chasing behind a bomber makes yourself pretty much stationary for the tail gunners, and you will be showered with bullets. The engine of the P-40 will usually get damaged. Instead, before launching an attack, get an altitude advantage over the bomber by flying around 2 km above it. The bomber should only fill up about 1/6 of your gunsight. The best position for an attack is at the bomber's high six so you can adjust the lead much easier. Dive at the bomber, but not directly at it, try to predict where you two will crash by imagining yourself as a missile, that's where you should aim at (deflection shooting). To maximise the damage it is better to aim for their wings and engines, as the fuselage usually soaks up quite some bullets. Only fire when the bomber passes in front of your guns. This short window might seems inadequate to do anything, but the six MGs on the P-40 are actually pretty destructive, as sometimes it only takes one bullet to set the target aflame.\n\n'''The Ground Attack Role''' <br>\nSince the P-40E could carry a bomb payload of the 2 x 100 lbs or 1 x 500 lbs or 2 x 100 lbs + 1 x 500 lbs (700 lbs) is it a good attack aircraft for its tier. If you select Ground targets belt you can destroy most land based units- even pillboxes; ground belt ammunition also works most excellently against aircraft.\n\nIn Ground RB, the 500lbs bomb can easily dispatch tanks at higher BRs, as long as you are accurate in dropping the bomb. Taking a leaf from the Stuka's book and diving from altitude is the best way to directly target heavy and medium tanks. You can climb to a higher altitude and look out for cannon flares and flak/machine gun fire. By using the zoom camera (bound to Z on PC by default) you can target and dive on an enemy vehicle. Make sure to drop from a reasonable altitude if the assault fuse is used as the shockwave and shrapnel from the blast will easily shred the P-40's airframe. Using a timed fuse will allow you to drop closer to your target safely but gives the target the chance to move from the bomb into safety.\n\nGround target belts are excellent at attacking open top and lightly/non armoured vehicles like SPAA but beware that by targeting them you can be easily shot down by SPAA. Normally a quick but accurate burst can easily neutralise even the most stubborn SPAA units at its BR with the Kittyhawks 6 .50 cals.\n\nUsing the test-flight arena is a great way to hone your bombing and .50 cal aiming skills, as both the Panzer and Sd.K.Fz offer good targets that reflect in battle targets very well.\n\nNote that in SB, the P-40 will wobble a lot (sideways mainly) so you must get used to smoothing the plane down in order to hit ground targets.\n\n====Specific enemies worth noting====\n<!--Some concerning vehicles to worry about if playing this plane. (i.e. Japanese fighters will out turn you)-->\nSome concerning fighters the P-40E-1 has to watch out for are the:\n\n* Bf 109s: [[Bf 109 E-3|Emil]], [[Bf 109 F-4|Friedrich]]\n* [[A6M2|A6M2]]\n* [[Yak-1B|Yak 1B]]/[[Yak-7B|Yak-7B]]\n* Spitfires: [[Spitfire Mk IIb|Mk II]], [[Spitfire Mk Vb/trop|Mk Vb]]\n\n'''Against the Bf 109:'''<br>\n\n*Turn-fighting, since the Bf 109s beyond F models can't turn so well, especially at higher speed- if your opponent does lose their energy advantage, you can then catch and destroy them in a turn-fight.\n\n'''Against the A6M:'''<br>\n\n*Boom & Zoom- dive on the target and engage. Due to its lack of armour and large fuel tanks, the A6M is easy to destroy.\n*Outrun the A6M- the A6M isn't a really high-speed plane, the P-40E can outrun it flat-out easily, so turn around after 3-4 km and try to head on or start climbing then. The A6M might start to climb to try and gain energy- if you keep running from it, you will put enough space between you and your opponent to climb to an acceptable altitude, or re-group with allies.\n\n'''Against the Yak-1/7:'''<br>\n\n*Turn-fighting is recommended as a last resort, especially with the Yak-1B's superior handling and turn-radius. You will not be able to outrun a Yak and head-ons are not advised due to the Yak's nose weapons. Try and get a friend to assist you, without losing speed- avoid engaging and losing speed, otherwise, the Yak will catch you. If you are in a squad, stick together and use the scissor-baiting method, until an opponent locks onto one of you, then you can destroy it. Boom and zoom should be used, but the circumstances often don't arise.\n\n'''Against Spitfires:'''<br>\n\n*Try to Boom and Zoom, if given the position to do so. In a straight line ,the P-40 will outrun a Spitfire at lower altitudes, but not out-climb it. The performance of the Spitfire makes it a difficult enemy, only turn-fight with it at high speed- wingmen or more teammates is the optimal solution, strength in numbers.\n\n'''Against the [[H6K4]]/[[B18A]]'''\n\n* These bombers all have fairly deadly defensive guns. The H6K has a powerful 20 mm cannon facing backwards, so avoid tailing it from its six unless its gunner is unconscious. Engage from its sides or high six and aim for its wings. Your 6 x 12.7 mm MG will destroy its wing structures easily or set it aflame. For the B18, their 13.2 mm MG will easily snap the P-40's wing off with a short burst so avoid attacking them from behind. Utilise deflection shooting against them, to give their gunners little chance of targeting you.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Auto control available || Not controllable<br>Not auto controlled || Controllable<br>Auto control available || Combined || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Decent roll rate\n* Good armament\n* Good flat out speed\n* Very good dive speed (throttle to 0% or face control surface compression)\n* Overall good plane\n* Can take substantial damage\n\n'''Cons:'''\n\n* Poor climb rate\n* Relatively poor turn time\n* Due to lack of two-stage supercharger high altitude performance suffers\n* Overall slow for its rank\n* Rather unstable in pitch axis in SB\n* Extremely bad visibility over the nose in SB\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe P-40 was born in 1938 when Curtiss realized the need for a replacement to the P-36. The P-36 was a formidable aircraft, but top speeds of newer fighter designs were quickly passing it. Donovan Berlin a former Northrop engineer who was employed by Curtiss went to work on the redesign of the Hawk. The radial engine was replaced with a turbo-supercharged version of the Allison V-1710 inline engine. The cockpit was moved to offset the weight of the new engine. This delivered a performance boost and higher top speeds when tested. The Army ordered thirteen versions of this prototype built for additional testing. Unfortunately, the experimental turbo-supercharged engine was unreliable and poor visibility from the cockpit forced the project to be abandoned.\n\nThe next attempt at design was a simpler one. Berlin recognized the U.S. Army believed they only needed a fighter effective to only 15,000 ft. The aircraft's engine was replaced with a simpler super charged Allison engine and was designated XP-40. The new prototype first flew on October 14, 1938. The aircraft flew and looked good but various adjustments were quickly made. These included moving the radiator and a more powerful version of the Allison V-1710. The XP-40 was quickly recognized for its good handling and dive speeds.\n\nOn April 26, 1939, Curtiss was handed a record-setting contract of 524 P-40s for $13 million. The primary reason Curtiss won the contract was due to availability. Other manufacturers still needed a couple of years before they could launch their aircraft into production (Examples: P-38, P-39). The first production P-40 rolled off the factory line in March of 1940. The first P-40s to see action were RAF Tomahawks over North Africa in June of 1941. The aircraft was quickly noted for being a stable gun platform and capable of withstanding more battle damage than its counterparts. The aircraft's altitude limitations quickly forced pilots to accept they would have to endure higher flying opponents.\n\nWhen the P-40 reached the D and E variants many changes had to be made. Allison redesigned its V-1710 and the aircraft's fuselage when need to accommodate the higher thrust and additional horsepower from the new engine. Curtiss removed all armament from the nose of the aircraft and placed four 12.7 mm [[Browning M2 (12.7 mm)|M2 Browning]] machine guns in the wing. In the later E model that number would be increased to six. The P-40 was also fitted with an improved cockpit enclosure, larger windshield, and a better canopy. The P-40E-1 was also capable of carrying six small bombs under the wings. In late production models, a small dorsal fin was added near the base of the tail for added stability.\n\nThe P-40E saw extensive combat in the Pacific theatre, China, and North Africa.\n\n=== In-game description ===\nCurtiss P-40E (Kittyhawk) single-engine front-line fighter/fighter bomber/interceptor fighter of the Air Force of the Workers' and Peasants' Red Army\n\nA single-seat, single-engine, all-metal cantilever monoplane fighter with an enclosed cockpit and a retractable landing gear system, including a tail wheel.\n\nP-40E aircraft were built on a full scale both for the USAAF and the RAF under the designation of Kittyhawk Mk.I. The British variant differed in some components and was delivered to the USSR as part of the Lend-Lease programme.\n\nThe first fighters for the Air Force of the Workers' and Peasants' Red Army were re-exported from Great Britain to the port of Arkhangelsk in late 1941. This export was made up of 14 Tomahawk Mk.II (P-40C) aircraft. They were used for the first time on the northern flank of the Soviet-German front. Upgraded P-40Es were subsequently given to fighter regiments which had mastered flying the previous variants. A total of 487 Kittyhawks were delivered to the Soviet Union during 1942. In 1943, this number increased even more, to 939.\n\nBased on their experience flying the P-40 on the Soviet-German front, pilots of the Air Force of the Workers' and Peasants' Red Army noted the following positive features of the aircraft: powerful armament, considerable flight range, good survivability, good (according to Soviet standards of the same period) radio and instrumental equipment. The unique five-spar wing, notable for its colossal safety factor, earned the fighter the nickname \"the King of Ramming\" in the USSR. Soviet pilots made the best use of this advantage and carried out brave ramming attacks. On April 8, 1942, Alexey Khlobystov, who was later awarded the Gold Star of the Hero of the Soviet Union, piloted a Tomahawk Mk.II and performed a ramming attack twice in one air duel, destroying two German fighters.\n\nThe main spheres of the Kittyhawk's combat use in the USSR included covering large cities and important facilities as part of the Air Defence Force, accompanying bombers (including torpedo bombers), independent bomb and ground attacks, and air reconnaissance.\n\nCombat experience showed that the P-40 was not then able to face the new Luftwaffe fighters on equal terms, but its speed and powerful armament made the Kittyhawk an effective means of fighting enemy bombers. So, beginning in 1943, most P-40s were sent to fighter regiments in the Air Defence Force. By the end of 1944, the Air Defence Force had over 900 planes of this type.\n\nThe P-40's longer flight range attracted the attention of the Naval Aviation Command. Naval Kittyhawks were extensively used as fighter bombers.\n\nIt was standard for the P-40E to have one FAB-250 suspended under its fuselage. In combat conditions, the aircraft could carry a FAB-500 bomb suspended underneath, as well as one FAB-250 under the fuselage and two FAB-100TsKs under the wings or one FAB-250 and two ZAB-100s.\n\nSome P-40Es were equipped in the USSR with Klimov M-105P and М-105R engines with VISh-61P propellers. This refitting was an attempt to improve on the Allison V-1710 engine's low operating characteristics under the cold conditions of the Far North and the Arctic. Externally, these aircraft differed quite significantly from their prototypes.\n\nDeliveries of P-40s to the USSR ceased in December 1944. A combined total of 1,887 Kittyhawks were received by the Air Force of the Workers' and Peasants' Red Army and the Air Defence Force. 311 more P-40s were received by the Naval Aviation force. The aircraft were withdrawn from service in 1946.\n\n== Media ==\n''Excellent additions to the article would be video guides, screenshots from the game, and photos.''\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n\n* Curtiss [[P-36 (Family)|P-36]] Hawk\n* Curtiss [[P-40 (Family)]]\n\n;Aircraft of comparable role, configuration and era\n\n* Bell [[P-39 (Family)|P-39]] Airacobra\n* Dewoitine [[D.520]]\n* Grumman [[F4F (Family)|F4F]] Wildcat\n* Hawker [[Hurricane (Family)|Hurricane]]\n* Kawasaki [[Ki-61 (Family)|Ki-61]]\n* Lavochkin-Gorbunov-Gudkov [[LaGG-3 (Family)|LaGG-3]]\n* Macchi [[C.202]]\n* Messerschmitt [[Bf 109 (Family)|Bf 109]]\n* Mikoyan-Gurevich [[MiG-3 (Family)|MiG-3]]\n* Mitsubishi [[A6M (Family)|A6M]] Zero\n* Supermarine [[Spitfire (Family)|Spitfire]]\n* Yakovlev [[Yak-1]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''encyclopedia page on the aircraft;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.ru/index.php?/topic/206120-p-40e/ Official data sheet - more details about the performance (Russian Forum)]\n* [[wikipedia:Curtiss_P-40_Warhawk|[Wikipedia] Curtiss P-40 Warhawk]]\n* http://ww2db.com/aircraft_spec.php?aircraft_model_id=36\n\n{{AirManufacturer Curtiss}}\n{{USSR fighters}}\n{{USSR premium aircraft}}"}}