{"title":"P-47D-16-RE (Germany)","pageid":12217,"wikitext":{"*":"{{About\n| about = fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = P-47 (Family)\n}}\n{{Specs-Card\n|code=p-47d_16_re_germany\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium rank {{Specs|rank}} German fighter {{Battle-rating}}. It was introduced in [[Update \"New Power\"]], replacing the [[P-47D (Germany)]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 9,144 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 666 || 649 || rowspan=\"2\" | {{Specs|ceiling}} || 26.2 || 27.2 || 6.5 || 6.5 || rowspan=\"2\" | 400\n|-\n! Upgraded\n| 719 || 692 || 23.8 || 25.0 || 13.7 || 9.7\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 498 || 469 || 320 || ~13 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 400 || < 420 || < 470 || > 335\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\nThe pilot and fuel tanks have decent armour protection from the front, but the engine is vulnerable from the front. The pilot has no armour protection from the rear, leaving him vulnerable.\n\n* 38 mm Bulletproof glass - Windshield\n* 9.5 mm Steel - Below windshield\n* 9.5 mm Steel - Behind engine, in front of fuel tanks and pilot\n* Self-sealing fuel tanks (1 under pilot, in front of pilot's legs)\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M2 Browning (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 8 x 12.7 mm M2 Browning machine guns, wing-mounted (425 rpg = 3,400 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nAs with the other P-47's in-game, this aircraft should be primarily played using Boom and Zoom tactics. You may need to side climb in order to get into a viable position, given that Allied aircraft will be at a higher altitude than you a good amount of the time. It is highly recommended to not try and turn with the aircraft you are tailing, as this is how you will quickly lose energy and become easy pickings. Instead, after your first pass, initiate a relatively steep climb. This will allow you to once again take the altitude advantage on the enemy, which will further give more opportunities for BnZing. When climbing back up, however, pay attention to what aircraft may be around. You are essentially a free kill for anyone in the vicinity if you are not aware of what is around.\n\nThis variant of the P-47 does not offer any payload options, so using it in a CAS (Close Air Support) role may not be as effective versus the other P-47 variants.\n\n'''Simulator/EC'''\n\nIn Simulator/Enduring Confrontation, bulkier planes that suffer in AB & RB shine and that of course includes the P-47. Sitting at BR 3.7, the lowest BR for rank 3 EC, it can respawn infinitely which makes it a great learning platform for new EC players. In Sim, the P-47 has a stable control handling, all-round unobstructed vision and fast speed. However, as mentioned above, this German P-47 has no suspended armaments, limiting its use to bomber intercepting, traditional BnZ fighting and maybe ground pounding.\n\nBe very careful when hunting bombers, since with the Sim control (whether it be mouse joystick or a real stick) the plane will manoeuvre much more gently, making itself a great target for the bomber's gunners. DO NOT follow behind a bomber's 6 unless you are sure that its tail gunners are unconscious. Chasing behind a bomber makes yourself pretty much stationary for the tail gunners, and you will be showered with bullets. The big radial engine of the P-47 will usually get damaged. Instead, before launching an attack, get an altitude advantage over the bomber by flying around 2 km above it. The bomber should only fill up about 1/6 of your gunsight. The best position for an attack is at the bomber's high 6 so you can adjust the lead much easier. Dive at the bomber, but not directly at it, try to predict where you two will crash by imagining yourself as a missile, that's where you should aim at (deflection shooting). To maximise the damage it is better to aim for their wings and engines, as the fuselage usually soaks up quite some bullets. Only fire when the bomber passes in front of your guns. This short window might seems inadequate to do anything, but the 8 MG on the P-47 are actually quite destructive, as sometimes it only takes one bullet to set the target aflame.\n\nAs for dogfighting, because almost all aerial battles in Sim occurs at below 3,000 m, the P-47 can easily climb to this altitude and gather up lots of speed before engaging a battle. The tactic is similar to the RB one above. If, unfortunately, you find yourself being chased at your 6 and you don't know how to do any defensive manoeuvres, do a large, smooth turn towards the nearest friendly airfield to avoid bleeding too much speed. Then shallow-dive towards your airfield. The P-47 can quite easily outrun opponents like the I-16 or IL-2, but might struggle to outrun F6F, P-38 or other P-47. Another way of disengaging is to do a sudden split-S to dodge under the chaser. Average Sim players will now try and see where you went, if not immediately losing track of you. You can then run for your airfield or shallow climb for another attack.\n\nFor ground pounding, dive at a shallow angle to approach the target, try to get as close as possible but avoid crashing into the ground. The 8 MGs are perfect for killing trucks, AA guns and artilleries as they have plenty of ammo. However, constantly watch your surrounding, especially your high 6 for any incoming enemies.\n\n'''Enemies worth noting:'''\n\n*[[Me 264]] (mixed battle): This giant is one of the few bombers who get air spawns in Sim, so it usually flies higher than you think. On top of this, the Me 264 is armed with large calibre machine guns and cannons all over it, therefore tailing a 264 is basically suicide unless all of their gunners are knocked out. You can treat the 264 almost like a B-29 or B-17 as they are very similar in both design and defensive capabilities. It is best to head-on the 264 if you can as you can easily knock out the pilots due to its glazed nose while also taking minimal damage. However the bomber lacks a ventral turret on its belly, making it easy to deal damage from below, but be wary of the downwards facing rear 20 mm cannon near the tail. The safest way to attack is from a higher altitude, dive at an oblique angle and focus fire on the wings and nose. Never engage if you have no altitude advantage.\n\n*[[Bf 110 (Family)|Bf 110]], [[Ki-45 (Family)|Ki-45]], [[A-26 (Family)|A-26]]: As mentioned before, those twin engine aircraft are a big threat since their lack of manoeuvrability comparing to single engine fighters are minimised in Sim. They are usually armed with heavy guns & cannons in the nose, so an accurate burst will tear any plane apart, including the P-47. The P-47 manoeuvres rather sluggishly and you might get out-turned from even those heavy fighters, so engage them with either altitude or speed advantage to avoid being targeted. If they are not manoeuvring aggressively, aim for their wings or engines. If the fight is intense and you cannot smooth the aim, just burst anywhere as long as you hit them, the 12.7 mm bullets will damage their flight models quite a bit.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Auto control available || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Separate || Controllable<br>1 gear || Auto controlled\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Great bomber destroyer against a lone bomber\n* Excellent high altitude performance\n* If taken care of, can easily fly with one wing\n* Muscle car with wings, excellent at Boom and Zoom tactics\n* 8 M2 Browning machine guns are accurate at a longer range than most cannons at its BR\n* High speed, even while stock\n* Very durable which semi-compensates with its lacklustre turn rate\n* Plenty of ammo\n* Can easily escape enemies with its high speed for its rank\n\n'''Cons:'''\n\n* Frontal armour can easily be penetrated by 20 mm rounds\n* Can easily snap a wing when even the slightest gunfire hits it\n* Poor stall characteristics\n* Mediocre climb performance (side climbing recommended)\n* Slow and hard to manoeuvre at low altitudes\n* Larger than average fighter\n* Big engine easily hit during a head-on attack\n* Worse cockpit visibility than in the other bubble canopy P-47s\n* No armour protection for pilot from behind\n* Unlike other P-47s, lacks the ability to carry payloads, limiting its usefulness in battles\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThere are a few instances of captured P-47s having been used by the Luftwaffe. On 7 November 1943, a P-47 piloted by U.S. 2nd Lt. William E. Roach made an emergency landing on a German airfield. The pilot was made prisoner and the Thunderbolt was given German markings T9+LK, presumably having been used for reconnaissance over England before D-Day. This plane was recaptured later by the Americans when they took the airfield it was based at. At least two other captured P-47s saw service in the German ranks, being used for reconnaissance, testing and propaganda.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=p-47d_16_re_germany Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/504127-p-47d-16/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Republic}}\n{{Germany fighters}}\n{{Germany premium aircraft}}"}}