{"title":"P-51D-10","pageid":176,"wikitext":{"*":"{{About\n|about= gift American fighter '''{{PAGENAME}}'''\n|usage= other versions\n|link= P-51 (Family)\n}}\n{{Specs-Card\n|code=p-51d-10\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_p-51d-10.jpg\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} American fighter {{Battle-rating}}. It was introduced as a [[wt:en/news/3071--en|premium pack]] as the ''P-51D Daddy's Girl'' in [[Update_1.49_\"Weapons_of_Victory\"|Update 1.70.1945 \"Weapons of Victory\"]]. It was removed from the Gaijin store in [https://forum.warthunder.com/index.php?/topic/311904-clearance-sale-50-off-various-packs33 May 2016]. It was obtainable in-game with Warbonds {{wb}} in [[wt:en/news/4435-shop-how-can-you-get-premium-vehicles-warbonds-en|January 2017]] and [[wt:en/news/4815-shop-how-can-you-get-premium-vehicles-warbonds-en|July 2017]]. It was then added to the Steam store in November 2018 and removed in January 2020. In parallel, it was made available for purchase briefly in the Gaijin store once or twice a year for seasonal sales or recurring events from 2016 to 2021. Finally, it was made available for purchase in-game with Golden Eagles {{ge}} for the [[wt:en/news/7344-special-us-air-force-day-en|2021 \"US Air Force Day\"]] mini-event.\n\nThis P-51D-10 model is based on the plane flown by Ray S. Wetmore, an American WWII fighter ace who is credited with destroying 21 German aircraft. The D-10 variant is only different from the [[P-51D-5|D-5]] in that it has a dorsal fin on the tail, the first of the P-51 models to do so.\n\nThe P-51D is best flown as boom & zoom fighter and bomber interceptor. Its impressive speed and armament can give experienced players quite the advantage over enemy fighters. The aircraft also performs surprisingly well in the role of an attacker/light bomber.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nThe P-51D-10 is a very fast and quite agile plane, it is one of the fastest fighters at its Battle Rating. Thanks to the higher engine settings and the use of the 150 octane fuel, it can easily reach 610 km/h at the sea level and 710 km/h at the optimal altitude. By average it is 20 km/h faster than the D-5 and, just like that variant, it has a really high dive speed limit. The climb rate, while not being as good as in the German interceptors, is quite good compared to previous planes from the American tech tree, climbing from the sea level to 5000 m altitude in over 4 minutes. Acceleration in a level flight is quite decent, it is comparable to the P-38 series and better than in any P-47. The addition of the dorsal fin makes the P-51D-10 more stable in yaw axis compared to the previous variant. Turn rate of both those planes is still almost the same. At low speed it is quite bad, but as soon as the plane gets faster it also starts to turn tighter, even at a really high speed near the maximum allowed speed.\n\nThe stall characteristics in the Mustang depends a lot on its fuel load, it is really hard to stall out while turning at the lowest one and is able to fly at almost full elevator deflection. On the other hand, it stalls quite fast with full fuel tanks, also it gets less stable after loading it with more than 30 minutes of fuel. The plane reaches its critical angle of attack near the half of elevator deflection below 500 km/h. The P-51D-10's stalling speed is very similar to those of the P-47 or P-63 series, and so has a high stall speed compared to other planes it can meet. Therefore, the P-51D-10's pilot should do their best to not fly at a low speed in order to stay above stall speed and also to make the most of the plane's performances in the skies.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 7,620 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 682 || 662 || rowspan=\"2\" | {{Specs|ceiling}} || 23.1 || 23.9 || 14.9 || 14.9 || rowspan=\"2\" | 396\n|-\n! Upgraded\n| 742 || 710 || 20.9 || 22.0 || 24.3 || 18.9\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 644 || 512 || 265 || ~11 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 500 || < 300 || < 500 || > 400\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 19.05 mm Steel - Prop hub armour plate\n* 6.35 mm Steel - Forward cockpit armour plate\n* 8 mm Steel - Pilot's seat back\n* 11 mm Steel - Pilot's headrest\n* 38 mm Bulletproof glass - Windscreen\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M2 Browning (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 6 x 12.7 mm M2 Browning machine guns, wing-mounted (500 + 270 + 270 rpg each wing = 2,080 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|AN-M30A1 (100 lb)|AN-M57 (250 lb)|AN-M64A1 (500 lb)|AN-M65A1 (1,000 lb)}}\n{{main|HVAR|M8}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 6 x HVAR rockets\n* 6 x M8 rockets\n* 2 x 100 lb AN-M30A1 bombs (200 lb total)\n* 2 x 250 lb AN-M57 bombs (500 lb total)\n* 2 x 500 lb AN-M64A1 bombs (1,000 lb total)\n* 2 x 1,000 lb AN-M65A1 bombs (2,000 lb total)\n* 6 x HVAR rockets + 2 x 100 lb AN-M30A1 bombs (200 lb total)\n* 6 x HVAR rockets + 2 x 500 lb AN-M64A1 bombs (1,000 lb total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\n'''Offense'''\n\nProbably the best asset P-51D has is its speed and its ability to achieve it and maintain it. Like with all planes, higher attitude should be achieved. Although its climb rate is nice, there are enough planes with better and therefore pilots of P-51D should plan ahead and not wait for the last second to climb. Best way to climb at the start is to climb towards the corner of the map, so the enemy will be encountered later when P-51D is already high enough. When an enemy is spotted, heading in another direction than P-51D, P-51D can enter mild dive and go for strafe run. After that, it is important to continue heading in the same direction, so the speed is maintained. Even the most agile fighters won't be able to turn quickly enough to fire just one shot at you. If feeling confident or sure about the kill, P-51D should get at least 2+ km away from the enemy and then start to turn towards him, depending on its speed. If speed is under 500 km/h, a bigger distance should be achieved before attempting a turn. This ensures that turn will be completed before the enemy gets to 1 km distance, so you won't give your enemy opportunity for the first shot. However, head on assault should be done only against weaker opponents, since 50 cal does not have the punch of 20 mm or 30 mm that same tiered planes carry. Salvo of 50 cal rounds from tracer belt can easily and often does ignite enemy engines upon impact, but few hits from 30 mm will tear wings of P-51D, while fire can be taken out. When engaging enemy bombers, aim for their engines. When engine catches on fire, focus on another engine until it also burns and so on. It is likely that fire will be taken out, but the damage done by 2 to 4 burning engines will be so severe that enemy bomber will either crash within next minute even without one more hit or he will lose altitude so much that it will be an easy target for lower flying teammates. Bigger bombers like B-17 should not be followed for more than few seconds, as the engine of P-51D is too fragile and often will turn red upon first few hits, which gives you about 1 to 2 minutes before its engine dies completely. It is especially important to engage B-17 from relative higher altitude, gain little more speed and aim for engines. Well aimed burst of tracer belt rounds should be enough to ignite 1 or 2 engines during this. Keep in mind that B-17 can fly even with just one single engine and maintain its altitude and speed. Do not attempt to cut off wings of bomber like with bigger guns, as it is quite hard to do so with 50 cal. When engaging bomber with huge glass cockpit like on He 111, front assault with a salvo of 50 cal rounds has high chance to kill its pilot with the number of rounds that will be fired.\n\n'''Defense'''\n\nIt may seem that agility of P-51D is lacking at first sight, but it is not that bad when used correctly. P-51D has a good turn rate at higher speeds and its pilots should try to keep well above 400 km/h. When at a speed around 500 km/h, even Spitfires will have troubles getting behind you. However, P-51D should avoid these encounters as this will bleed its speed to the point that P-51D will be no longer able to turn with the enemy. If a window of opportunity arises, for example when an opponent starts his turn into the wrong direction after attempting to outmanoeuvre P-51D, P-51D can enter mild dive and go for a run. P-51D can get to its top speed quite fast, especially when in mild dive. Top speed of P-51D is one of the best on its tier. These three-speed factors will help you run away from many opponents, giving you a chance to set your own rules of engagement with them. When running away with the enemy closing in, try to avoid climb at all. If a climb is desired, it is best to wait until it is safe. If climb cannot wait, try to climb below 10 degrees. When an enemy with much higher speed is catching up with you at higher attitude, mild dive may not get you fast enough to your top speed. In these situations, deep dive can be done. During this, the enemy will get even closer to P-51D. As the top speed of P-51D is quite high, after the enemy loses his initial speed advantage, P-51D will probably already start to get away. After this deep dive runaway, start to climb around 10 degrees. P-51D is good at maintaining its speed, so it is likely that while P-51D will continue to move around 800-850 km/h after deep dive for a couple of seconds, many opponents will quickly slow down to their listed top speed. This should be enough to provide a safe escape. If running away is not an option, high-speed turn fight can be done for a short while. P-51D shouldn't prolong these encounters and should as soon as possible try to get away as already described in turn fights. When an enemy is going head-on, he should be avoided. As already said, 50 cal cannot match 20 mm and bigger guns head on. Additionally, such an encounter will probably damage the engine, which will at the start take away the most important asset of P-51D and after a few minutes will lead to its failure. The vitality of pilot is average, so he may survive and so is the durability of its wings. However, control surfaces of P-51D are quite fragile. Head on should be done only with a weaker opponent, who has either much weaker armament or is already critically damaged. If the engine turns red, airfield should be sought as fast as possible. With red engine try to climb as much as possible in a way that speed will be at least slowly increasing. When the engine dies, glide towards airfield in a way little to none speed is lost to avoid a stall. If speed reaches 200 km/h and dive is not possible if the airfield is to be reached, use flaps as they will keep you in the air for little longer even at a lower speed. If combat flaps are not enough and even then P-51D starts to stall, raise flaps, open gear, use landing flaps and retract gear. Landing flaps will keep you in the air for even longer than combat flaps, but if they are deployed too soon, they will serve as air brake, which is not desired during glide.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Not auto controlled || Controllable<br>Auto control available || Controllable<br>Auto control available || Separate || Not controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Armed with 6 x .50 cals with tracers, basically a flamethrower if you hit a plane in the right spot\n* Very good Boom and Zoom aircraft\n* Bubble Canopy gives 360° view\n* Very fast at all altitudes\n* Carries a lot of ammunition\n* Very manoeuvrable at high speeds\n\n'''Cons:'''\n\n* Sluggish when carrying a payload\n* Sluggish at low speeds\n* High stall speed\n* Average climb rate\n* Sheds speed when turning excessively\n* .50 cals don't have the punch cannons have\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nIn April of 1940, the British Purchasing Commission visited the United States in the hope of securing a new fighter to supplement their Spitfire and Hurricane. They approached the North American Aircraft Company with the proposal to build P-40s under license from Curtiss. Instead, North American proposed the idea of building a brand new superior fighter. The BPC accepted the proposal and the first prototype was set to be completed within 120 days. The design team was led by Lee Atwood, Raymond Rice, and Edgar Schmued (a German-born Austrian who was previously employed by Fokker). They quickly set to work on the new prototype designated NA-73X. The original prototype was assembled in 117 days and first flew on October 26, 1940. A majority of the early Mustangs produced were primarily used for testing by the USAAC. Shortly thereafter 320 NA-73s were ordered by the BPC. The first production model destined for the RAF made its maiden flight on May 1, 1941. The Lend-Lease contract was approved later that year on September 25th. These aircraft were designated Mustang I.\n\nThe Allison power-plant used on the early Mustangs was not designed for high altitude performance. In August of 1942, Major Thomas Hitchcock approached senior officers in the U.S. Army for a solution. He proposed the Mustang could be easily developed into a high altitude long-range fighter through the conversion to the Rolls-Royce Merlin engine. America's World War I ace Eddie Rickenbacker also endorsed the idea. Five Mustang Is were delivered to Rolls-Royce for the conversion and Merlin 65 engines were fitted to the airframe. Rolls-Royce would allow the Packard company to build the Merlin engines under license and this would be the answer to the USAAF's long-range fighter problem.\n\nThe P-51D was powered by a Packard Merlin V-1650-7 engine. The aircraft was fitted with six 12.7 mm Machine guns, a reflex gunsight, and a bubble canopy. A total of 7.956 D variant Mustangs were built.\n\nThe P-51D saw front-line service with the Eight Air-force immediately following D-Day. It quickly excelled as a high-altitude escort fighter.\n\n=== In-game description ===\nThe North-American P-51 Mustang was an American fighter designed in the early 1940s and is considered the best US fighter of WWII. It was widely exported to countries in Europe, Asia, Africa and South America. The P-51 participated in the Korean War and other post-WWII conflicts.\n\nThe most famous Mustang version was the P-51D with teardrop (or bubble) canopy. The main problem for the pilots of the earlier variants was a huge blind spot at the rear of the aircraft due to the canopy design. An earlier attempt to address the issue was a British-designed Malcolm hood, installed on many P-51Bs. It improved rearward visibility, but the search for a better solution continued. In January 1943, USAAF's Colonel Mark Bradley, while stationed in Britain, was introduced to the then-new \"bubble\" canopy, designed for use on Spitfires and Typhoons. The canopy had no framework and offered near 360-degree vision. To install the new canopy, the rear fuselage section of the Mustang had to lose some height. However, this change required minimal redesign to the airframe. The inaugural flight of the new P-51D took place at Inglewood, California on 17th November 1943.\n\n===Namesake Pilot===\n[[User:U64962917#Wetmore,_Ray_S.|Ray S. Wetmore]] (September 30, 1923 – February 14, 1951) was a U.S. ace of World War II. He joined the U.S Army Air Corps in 1941 at the age of 18 and was assigned to the 359th fighter group. He achieved his first 4 victories in the sky while flying a [[P-47D-25|P-47 Thunderbolt]] before making the switch to a '''P-51B''' and then a '''P-51D-10''' named 'Daddy's Girl.' He was later shot down by friendly anti-aircraft fire during the battle of the Bulge but survived, finishing the war with a documented 21 German aircraft destroyed. He died in 1951 while flying a [[F-86A-5|F-86 Sabre]] that he suddenly lost control of during an approach to an airfield.\n\n=== Notable pilots ===\n[[File:Ray_S_Wetmore_portrait.jpg|thumb|none|200px|link=User:U64962917#Wetmore,_Ray_S.|United States ace pilot [[User:U64962917#Wetmore,_Ray_S.|Ray S. Wetmore]], four times ace, once with a P-47 and thrice with a P-51.]]\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=p-51d-10 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|jIHCXcEIao0|'''P-51D-10 - Rusty in the Best P-51D''' - ''AdamTheEnginerd''|Rj1jgYC7Q5Q|'''The Highly Capable Plane That No One Loves: P-51D-10''' - ''Spit_flyer''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/3010-weapons-of-victory-p-51d-daddy-s-girl-en|[News] P-51D Daddy's Girl]]\n* [https://forum.warthunder.com/index.php?/topic/405630-p-51d/ Official data sheet - more details about the performance]\n\n{{AirManufacturer NAA}}\n{{USA fighters}}\n{{USA premium aircraft}}"}}