{"title":"P-51","pageid":86,"wikitext":{"*":"{{About\n| about = American fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = P-51 (Family)\n}}\n{{Specs-Card\n|code=p-51_mk1a_usaaf\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_p-51_mk1a_usaaf.jpg\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} American fighter {{Battle-rating}}. It was introduced in [[Update 1.49 \"Weapons of Victory\"]].\n\nThe P-51 Mustang retains a lot of the traits that may be found in its later variants. The main difference comes from the limited Allison power plant and its formidable armament of 4 x 20 mm [[Hispano Mk.II (20 mm)|Hispano Mk.II]] cannons. The plane may not climb very well but does retain the traits of an energy fighter. Even with its limited climb rate the aircraft's dive-speed is excellent, but manoeuvrability is average at best. The armament is the true advantage of this aircraft. The 20 mm cannons are powerful, but with only 500 rounds do not try to go for more than what the P-51 can handle. The best way to use the P-51 is for [[Boom & Zoom]].\n\nThe P-51, when fully upgraded, is an extremely deadly opponent, especially as a rank II. The engine will have a hard time hitting the \"overheated\" mark, even when using WEP. Use caution though, as the engine will retain its heat when constantly on 100% power, so it takes a bit to cool down. Also be sure to utilise the flaps: they are a major asset to the plane's overall turn-fighting ability and sometimes allow it to survive a turn-fight with Soviet aircraft. This is an awesome plane for those just starting out in Realistic Battles, as the 20 mm cannons are good at scoring quick victories.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\"The Need for Speed\" is a worthy credo for all [[P-51 (Family)|Mustangs]]. This initial iteration boasts a significant speed advantage over many [[:Category:Third rank aircraft|Rank III]] aircraft, but sacrifices are obvious. On the upside, the good maximum velocity greatly benefits the energy retention coming out of dives and for staying out of trouble.\n\nManoeuvrability is nothing to write home about (except roll-rate), especially without speed to burn. The control surfaces lock up at high speeds which makes the Mustang a comparatively agile fighter when initiating combat, but this is quickly lost. Fortunately the combat flaps have a very high speed tolerance and greatly benefit it in dogfights. Overall the P-51 likes to bleed speed in manoeuvres and the lost energy cannot be easily regained. For another downside is the sluggish acceleration which further causes a low rate of climb. Managing both disadvantage is the Ace's true skill for this elite [[Boom & Run|Boom and Run]] fighter. However this is for an altitude range up to 4,000 m (13,000 ft). High altitude performance suffers which in combat, due the slow climb rate, is rarely reached anyway.\n\nThus all engagements, may they be Boom & Zoom or Boom & Run style, should be performed below said altitudes.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 5,200 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 592 || 578 || rowspan=\"2\" | {{Specs|ceiling}} || 21.2 || 22.0 || 9.2 || 9.2 || rowspan=\"2\" | 491\n|-\n! Upgraded\n| 673 || 631 || 18.9 || 20.0 || 18.6 || 13.1\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 650 || 520 || 280 || ~12 || ~6\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 500 || < 230 || < 550 || > 340\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Compressor\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n! Setting 1\n| 3,597 m || 1,150 hp || 1,598 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 19.05 mm Steel - Upper engine cowl armour plate\n* 6.35 mm Steel - Fore cockpit armour plate\n* 15.87 mm Steel - Armour plate behind pilot's seat\n* 38 mm Bulletproof glass - Armoured windscreen\n* Self-sealing fuel tanks (1 in each wing)\n\nWhile the Mustang looks quite defensive on first glance, it is a deceptive one. The fuel tanks are wing-mounted and prone to fires (the D-series has got an inline one). The very small engine cowl plate could just as well be absent. Both issues combined leave many pilots a gliding and/or burning example of why to avoid bomber's defensive fire. The P-51's prime form of defense is speed. As a ''Boom & Run'' fighter, avoiding air-drag inducing bullet holes by not getting hit is a far preferable option anyway. Whilst setting up another attack (a.k.a. retreating from combat) the very generous backseat armour will absorb any stray shots. In general the pilot's survivability is great.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nThe P-51 Mustang can seem a very underwhelming aircraft at first. The primary module to focus on for early success is the 20 mm ammo belts. Ground targets belts will give more consistent results as an attacker and the Air targets belts can be devastating against flying opponents. After improving the firepower on the aircraft, begin focusing on performance upgrades.\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|Hispano Mk.II (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 4 x 20 mm Hispano Mk.II cannons, wing-mounted (125 rpg = 500 total)\n\nQuadruple Hispanos are devastating: pressing the trigger will significantly slow down the P-51. Now how is that for firepower? Although this is caused by the too light air-frame which further causes vibrations and heavy shaking due to the wing-mounted position of all arms. Hence the accuracy is appalling after the first shots leave the barrels. Trigger control is important, even more so as the Hispanos tend to overheat during long bursts. Full automatics firing will result in depleting your rounds in approximately 12.5 seconds (if the guns do not overheat and jam), conversely the reload time is quite long at 40 seconds. This gives an incentive to play more of a boom and zoom playstyle.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nIn an RPG the Mustang would be a rogue, the damage dealer. Quickly darting in and out of combat to deal devastating blows, the P-51 in War Thunder is a DPS main, too. Featured playstyles are [[Boom & Zoom]], repeatedly diving on enemies and returning up high, and [[Boom & Run]], flying into danger zone, picking of a target and retreating, all while running at top speed. Coupled with its manoeuvrability and acceleration deficits, the P-51 punishes any pilot who does not play to its strength, namely the top speed. Only late war or diving aircraft are able to catch a Mustang on the run and for the latter only with the correct timing and plenty of altitude to burn. Maintaining a cool head and areal observation are important. Retreating may look the cowardice choice, but with the speed to disengage many options open up for reversals. Note, do not perform flat turns, but rather slow, deliberate high Yo-Yos or Immelmanns for turning around. A careful approach when leading up for a shot helps in conserving precious momentum, too.\n\nIn Arcade Battles the option for in-air reloads may tempt the pilot to spray & pray and dump all the ammunition. However, with the inaccuracy issues and the short fire windows, a more deliberate approach is necessary. Waiting outside a furball or dogfight for the right moment to intercept is key, as the key role for the Mustang is heavy fire support. This is especially helpful against armoured attackers such as the [[Ju 87 (Family)|Stuka]] or [[IL-2 (Family)|IL-2]]. Due to the lack of climb rate and poor altitude performance, bombers should not be sought out. In general the P-51 plays akin to many heavy fighters in Arcade mode.\n\nIn Realistic Battles the combat role is a tricky game. Lacking climb rate and high altitude performance the Mustang pilot needs to wait for the combat to come down to about 4,000 m (13,000 ft). Climbing should be done away from the expected combat zone (a.k.a. side-climbing) and at 20° with or 14° without WEP. At this point initial combat should be Boom & Run, utilizing the superior top speed to avoid combat while the enemy is focused on other team mates. Once the hostiles have dropped to a lower altitude Boom & Zooming can be engaged in. With 125 rounds per gun the fighter has got plenty of ammo to kill about six aircraft and with 30 min of fuel minimum, returning to base will be a rare occurrence. Overall this is a support fighter as in the current climbing meta engagements against higher flying interceptor-fighters are often deadly, as the Mustang then lacks the critical ability to choose the time of engagement.\n\nSimulator Battles is where the P-51 (NA-91) truly shines. Flying at top speed with military rated power (100%) keeps the engine cool and enemies usually far away at one's tail. Most of all combat happens slightly below the Mustang's preferred altitude and the cockpit view is great, albeit with limited rearward view. Without the instructor the manoeuvrability markedly improves in comparison, for the P-51 has generous stall characteristics and is an overall stable gun platform, as long as one does not pull the trigger. Only the lack of acceleration in prolonged dogfights is a trap that even experienced pilots still fall into. An emergency dive to top speed will however fix this, if the pilot remembered to keep some altitude. And one should, for the greatest advantage is the ability to disengage any unfavourable battle and like with many things, the early Mustangs do not disappoint.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Auto control available || Not controllable<br>Not auto controlled || Controllable<br>Auto control available || Combined || Not controllable<br>1 gear || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Great flight performance\n** Great dive-speed and acceleration\n** High energy retention\n** Good performance at high speeds\n** Good roll rate\n* Powerful armament\n** Gains access to British belt load-outs, incl. the devastating air-targets belt\n** Very efficient at destroying bombers\n* 20 mm guns on the Mustang are mounted in close proximity, dealing a deadly double punch when hitting\n* Can easily tackle higher BR foes\n* Can be very deadly in the hands of a skilled pilot\n\n'''Cons:'''\n\n* Mediocre climb rate\n* Low maximum altitude\n* No separate gun control\n* No payload options available\n* Firing guns slows the plane down\n* Poor visibility in simulator mode\n* Hispano cannons overheat extremely quickly and are inaccurate unless upgraded\n* Low ammo capacity compared to machine gun-armed variants\n* Priority target when in AB mode due to its reputation of destroying planes with relative ease, smart players will try to eliminate the P-51 first.\n* Minimal elevator authority without the engine producing net thrust as the plane relies heavily on streamline effect along the tail for elevator authority. Aircraft should not be landed with flaps down without an engine.\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe North American P-51 was born when the British Government showed interest in purchasing the Curtiss P-40C. Curtiss was at max production capacity, so the British inquired to North American Aviation if they would build it under license for them. North American agreed, but they wanted to build a better aircraft. A condition of the sale from North American to the British was to supply the U.S. Army with two samples free of charge. The original prototypes were designated XP-51. The U.S. Army was given fourth and tenth aircraft. One of them can still be found at the EAA Museum in OshKosh, Wisconsin. Testing of the two prototypes started in October of 1941. The new aircraft received high marks and were clearly superior to other U.S. fighters at that time. Although, the U.S. Army decided to not immediately place orders.\n\nThe first order of Mustangs to the British were designated Mustang I. The RAF received these aircraft behind schedule in October of 1941. Problems showed up immediately including the Allison power-plant and other design flaws. It is also important to note the Mustang Mk I's armament consisting of four .30 Cal machine guns mounted in the wings, as well as a set of two .50 Cal mounted in the wings and two .50 Cal machine guns mounted in the nose.\n\nThe next evolution of this aircraft was designated [[Mustang Mk IA (Great Britain)|Mustang Mk IA]]. Due to the recently signed Lend Lease Act the U.S. Army was able to place an order for 150 more Mustangs on behalf of the British. These aircraft were equipped with four 20 mm [[Hispano Mk.II (20 mm)|Hispano Mk.II]] cannons mounted in the wings. Only 93 of the new Mustangs made it to the RAF. The U.S. Army pulled 55 for themselves and they immediately saw service. Two were kept by North American Aviation for internal use.\n\nThese P-51 Mustangs first saw service in April 9th of 1943 and the first combat loss came shortly afterwards on April 23rd. Mustangs saw action against the Japanese in the Aleutian Islands but a majority of them found their way to the Mediterranean theatre. The Mustang saw combat early on in the country of Algeria. Over time these P-51 Mustangs were converted to Reconnaissance planes. A K-24 camera was placed in the left window behind the pilot. The camera faced towards the back and down and took pictures providing battlefield reconnaissance. These aircraft saw continued service until the later part of 1944 continuing to fill the Attacker and Recon role.\n\n=== In-game description ===\nThe North American P-51 Mustang was a single seat fighter which was designed, developed and entered service all during the course of the Second World War. The origins of the aircraft came about in April 1940, when the British Purchasing Commission approached the North American aviation company to design a fighter to augment those already in service with RAF Fighter Command. The prototype first flew on October 26th 1940 and, after a highly successful test and evaluation period, 320 aircraft were ordered and the first production aircraft flew on May 1st 1941. Delivered to No.26 Squadron at Gatwick, the new American fighter was designated the Mustang Mk.I by the RAF. It was considered to be superior to any other American fighter at the time, particularly at low level. However, the 1100 hp Allison V-1710 engine had a poorer performance at high altitude, particularly above 15,000 feet which was above where the engine supercharger was optimized for.\n\nFor this reason, the Mustangs were used in support of ground operations rather than in their intended original role as a fighter. The Mustang was very successful in this role and an additional order for a further 300 aircraft was placed. The new batch was modified by fitting self sealing fuel tanks and replacing the earlier Mustang's eight machine guns with a new armament of four 20 mm cannon, to create the Mustang Mk.IA. The RAF's successes with the Mustang led to a good deal of attention from the United States Army Air Force; after highlighting the fighter's only serious shortcoming as its high altitude performance, inquiries were made into fitting the aircraft with a different engine. The British Rolls-Royce Merlin was selected for testing in five converted Mustangs, and the performance of the fighter increased dramatically. The airframe and wings were strengthened to harness the power of the Merlin engine, which also resulted in the fitting of under wing stores now being an option. Mustangs could now carry bombs, rockets or long range drop tanks. Now more than capable of competing across all altitude bands and boasting a particularly long range for a single engine fighter, the Mustang was rapidly evolving into one of the most capable air assets of the entire war. However, with British and American interest in the fighter still growing, future variants of the Mustang would show yet more improvements.\n\nGenerally regarded as the greatest American fighter of the Second World War, Mustang pilots were to claim nearly 5,000 air-to-air kills by the end of the conflict. The Mustang would go on to serve the USAF in the Korean War, and was exported to over 50 foreign air forces.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicleCountry=usa&vehicleType=aircraft&vehicleClass=fighter&vehicle=p-51_mk1a_usaaf Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n* [https://live.warthunder.com/post/393387/en/ \"Big Mac Junior\" - ''PROx'']\n* [https://live.warthunder.com/post/359448/en/ Fictional; USAAF motto \"Aim high... fly, fight, win\"  ''pathaber'']\n* [https://live.warthunder.com/post/508720/en/ RAF experimental marking scheme - ''JohnnyAlpha65'']\n\n;Videos\n{{Youtube-gallery|qsWhqJrd4og|'''War Thunder Realistic: P-51 Mustang [Speed is Vital]''' by ''Jengar''|aKgfzlJMxQU|'''P-51: The Altitude Advantage (Lite New Player Tutorial)''' by ''MagzTV''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n* North American [[P-51 (Family)|P-51 Mustang]] all variants\n** [[P-51A|P-51A ''TL'']] Thunder League Event vehicle, version armed with 0.50 cal Browning MGs (12.7 mm)\n** [[Mustang Mk IA (Great Britain)|Mustang Mk IA]] for Great Britain, better horse power due higher manifold pressure\n** [[A-36]] Attacker variant, with bomb pylons and six 0.50 cal MGs.\n** [[P-51C-10|P-51''C'']]\n\n;Aircraft of comparable role, configuration and era\n* [[Fw 190 A-5]]\n* [[Typhoon Mk Ib]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.ru/index.php?/topic/277120-mustang-mk-ia/ Official data sheet - more details about the performance]\n* [[wikipedia:North_American_P-51_Mustang_variants#P-51/Mustang_IA_(NA-91)|[Wikipedia] P-51 (NA-91)]]\n* [http://www.wwiiaircraftperformance.org/mustang/mustang-I.html <nowiki>[wwiiaircraftperformance.org]</nowiki> P-51 Mustang (Allison Engine) Performance Trials]\n\n{{AirManufacturer NAA}}\n{{USA fighters}}"}}