{"title":"P-51D-5","pageid":97,"wikitext":{"*":"{{About\n| about = American fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = P-51 (Family)\n}}\n{{Specs-Card\n|code=p-51d-5\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|cockpit=cockpit_p-51d-5.jpg\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} American fighter {{Battle-rating}}. It has been in the game since the start of the Open Beta Test prior to Update 1.27.\n\nThe P-51D is, undoubtedly, the shining star of the USAF branch. With its sleek laminar-flow wing, classic American M2 Brownings, high-visibility cockpit, and immensely powerful engine, the P-51 is most definitely a force to be reckoned with. It is endowed with very good high-altitude traits, endurance, and speed. Use it accordingly.\n\n[[File:HistoricImage P51 assembly.jpg|thumbnail|left|P-51D on the Inglewood assembly line, the fully \"semi-monocoque\" fuselage lowered on the one piece wing. ''From'' -> \"[https://forum.warthunder.com/index.php?/topic/264749-historical-structures-of-aircraft/ Structures of aircraft]\" article]]\n\nAs standard with the USAAF, the Mustang has six M2 Browning machine guns in the wings. It can load bombs and rockets like most other planes in the USAAF. The armament, though effective, still requires patience to master. The M2s have a great range, but the damage decreases substantially as your proximity from your opponent increases. It is best to shoot for the engines and wings of any plane, because fuselage shots will waste your ammunition.\n\nThe armament is pretty versatile; the 12.7 mm M2 machine guns can easily destroy most soft targets: [[:Category:Light tanks|light tanks]], AAA, [[:Category:Anti-aircraft vehicles|SPAA]], soft ground units, artillery, etc. Against bombers and heavy fighters the incendiary rounds will effectively set them alight.\n\nThe ground attack capability of the Mustang is notable, as it can carry 2 heavy 1000 lb bombs, as well as 6 rockets. Thus, the Mustang is also an effective attacker/ground attack aircraft.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 7,620 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 673 || 652 || rowspan=\"2\" | {{Specs|ceiling}} || 24.0 || 24.9 || 14.9 || 14.9 || rowspan=\"2\" | 396\n|-\n! Upgraded\n| 724 || 698 || 22.0 || 23.0 || 21.7 || 18.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 644 || 512 || 265 || ~11 || ~5\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 500 || < 300 || < 500 || > 400\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 2,400 m || 1,580 hp || 1,728 hp\n|-\n! colspan=\"3\" | Setting 2\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 6,400 m || 1,320 hp || 1,444 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 38 mm Bulletproof glass - Pilot's windscreen\n* 19.05 mm Steel - Fore engine plate\n* 6.35 mm Steel - Fore cockpit armour plate\n* 8 mm Steel - Plate behind pilot's seat\n* 11 mm Steel - Pilot's headrest\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nThe stock Mustang has fairly poor performance. Acceleration and climb rate is terrible. This can be rectified by grinding down the performance modifications. The \"Offensive 12.7 mm\" should be researched immediately for ammo flexibility such as the \"Stealth\" belt. Avoid researching ground attack modules until you research performance mods first, that includes the very important \"G-Suit\", as it greatly increases high-speed g-tolerance.\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|M2 Browning (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 6 x 12.7 mm M2 Browning machine guns, wing-mounted (2 x 270 rpg outer + 500 rpg inner = 2,080 total)\n\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|AN-M30A1 (100 lb)|AN-M57 (250 lb)|AN-M64A1 (500 lb)|AN-M65A1 (1,000 lb)}}\n{{main|HVAR|M8}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* Without load\n* 6 x HVAR rockets\n* 6 x M8 rockets\n* 2 x 100 lb AN-M30A1 bombs (200 lb total)\n* 2 x 250 lb AN-M57 bombs (500 lb total)\n* 2 x 500 lb AN-M64A1 bombs (1,000 lb total)\n* 2 x 1,000 lb AN-M65A1 bombs (2,000 lb total)\n* 6 x HVAR rockets + 2 x 100 lb AN-M30A1 bombs (200 lb total)\n* 6 x HVAR rockets + 2 x 500 lb AN-M64A1 bombs (1,000 lb total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe {{PAGENAME}} is the breakout fighter from the original [[P-51]] design with some major changes which include the beefier Packard V-1650-7 inline engine, bubble canopy for increased pilot visibility and replacement of four 20 mm cannons for six 12.7 mm M2 Browning machine guns. While not the refined thoroughbred compared to Mustangs of later in the War, the D-5 comes into its own as a multi-purpose fighter depending on the theatre of operation and mission requirements.\n\nFor the D-5 Mustang to work properly as a fighter/interceptor, it needs to maintain its speed to catch enemy aircraft off-guard or to get away when the odds start to look grim. Immediately after spawning, this aircraft should begin its climb to higher altitudes where it can then capitalize on its potential energy, however, side-climbing is recommended otherwise the Mustang will end up in the middle of two layers, lower and slower aircraft which don't climb well and those like the [[Spitfire (Family)|Spitfire]], [[J2M (Family)|J2M]] or [[Bf 109 (Family)|Bf 109]] which will easily out-climb the P-51. Side climbing affords the calculating pilot the opportunity to reach a good altitude from which targets can then be selected and taken out. Here, options will include bomber hunting and Boom & Zooming. Keeping the aircraft's airspeed around 400 km/h (248 mph) will allow the pilot to play more on the offensive than running on the defensive.\n\nUnless you are a skilled head-on attacker, this should be avoided as the airframe is fairly fragile, the engine will most likely absorb most of the damage leaking essential fluids or outright quitting, plus the pilot does not have very much protection from the canopy. If forced into a head-on, take evasive manoeuvres and make it difficult for the enemy fighter to get their sights lined up for a firing solution while they waste ammunition.\n\nAgain, while this aircraft becomes difficult to handle when flying slow, it is important to refrain from taking this fighter to the stall point unless you are specifically dragging an enemy fighter into a rope-a-dope or other stall-tactic fighting style. The Mustang does not have a very strong rudder (avoid hammerheads or wing-overs), however, when working into a stall manoeuvre, before the aircraft's energy if fully depleted, perform a Split-S manoeuvre and let gravity help the engine get the fighter into a raging dive. Another option with stall-tactics is to work with a wingman, where one aircraft dupes an enemy to follow up in a climb as energy bleeds off, at that point, a wingman with plenty of energy can dive and take out the climbing enemy when they are reaching their apex and are going to be at their slowest, making for an easy target. Wing mates can alternate roles to ensure a continual supply of enemy aircraft to attack.\n\nThe P-51D-5 is agile enough to dogfight around larger fighters, attackers and bombers, however, it does lack when going against other single-engine fighters around its rank. To counter this inherent weakness, the Mustang should maintain its speed and concentrate on utilising Boom & Zoom tactics allowing it to flee the scene and set up for another attack on its terms. Even missing the target (or not fully destroying it) should not tempt the pilot to chase it down to finish it as this will ultimately bleed of crucial energy and even though successful in chasing down the enemy aircraft and finishing it off, the P-51 is left in a vulnerably slow position where it then has to scrape back up to altitude as a potential easy pickings for any patrolling enemy aircraft.\n\nWhile this version of the Mustang is not outfitted with 20 mm cannons, having six [[Browning M2 (12.7 mm)|12.7 mm M2 Browning]] heavy machine guns can still result in devastating damage inflicted on the enemy. There are several options of ammunition which can be outfitted with this aircraft and they all have their purpose, however, utilising the \"Tracer\" belt can be truly effective. The tracer belt is composed entirely of the extremely effective M20 API-T rounds which when concentrated on a bombers engine or fuel tank can produce some spectacular shows of colour as flames erupt out of the defending aircraft. One thing the pilot must keep track of is the amount of ammunition left after firing because two of the six guns have more ammunition than the other four; at one point damage output will decrease, however, the decrease in weight from the firing of the rounds will increase the aircraft's performance until the reload timer resupplies the aircraft or the pilot returns to base for a reload. Alternatively, for an even more effective method of downing enemy aircraft, use the \"Stealth\" belt.\n\nWhile a very capable Boom & Zoom fighter, there are several suspended armament options which can be outfitted to the aircraft depending on the mission. While the additional bombs or rockets will increase the damage potential of the aircraft, there is a trade-off, a critical one, more weapons mean increased aircraft weight and therefore less manoeuvrability and engine performance. Rockets and bombs will turn this aircraft into a force multiplier as the rockets can be used against both aircraft (bombers), ground targets and fleet targets. Bombs, on the other hand, are strictly for land-based and fleet targets, however, they will be less effective against bases in compared to softer ground targets like anti-aircraft cannons, trucks, light tanks and some smaller pillboxes. While the armament on the Mustang will be less effective against a base, it will allow the pilot to chip away at it barring any enemy fighters finding their way over to your location.\n\nThe P-51D-5 has many strengths and weaknesses compared to other aircraft in which it will face, the key is to know these limitations and to know which ones you can push and be successful and others which will leave you an easy enemy target. The key point to remember is speed is key, staying around 400 km/h (248 mph) will keep many options open to either run or attack and can be the deciding factor when facing an aircraft with superior qualities and still come out the victor and be credited with the title \"rank does not matter.\"\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Not controllable || Controllable<br>Not auto controlled || Controllable<br>Auto control available || Controllable<br>Auto control available || Separate || Not controllable<br>2 gears || Not controllable\n|-\n|}\n\nThe MEC controls on this plane are incredibly simple. Put out both radiators to 100%, and keep it like that for the whole game, as your engine will never overheat. Due to the position of the radiators, it gives a small amount of jet thrust to counteract the little drag it creates.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Outstanding Boom & Zoom capability\n* Great performance at altitude\n* Very fast at all altitudes, especially with a leveling-out dive\n* Due to wing shape, very agile at high speeds\n* Good cockpit visibility\n* Plenty of ammo\n* Large fuel capacity\n* Tracers belt consists entirely of API-T rounds, giving the 12.7 mm a significantly bigger punch than other machine guns\n* Fantastic top speed and acceleration when spaded\n* Very good sustained climb rate when spaded\n* Incredibly simple MEC controls\n\n'''Cons:'''\n\n* Relatively prone to catching fire\n* Loses quickly energy during turning manoeuvres\n* High stall speed\n* Only utilises machines guns, no cannons\n* Poor performance and climb, relatively low acceleration when stock\n* Sluggish when carrying bombs and rockets\n* Pilot is prone to being easily hit and knocked out in engagements, even by bombers\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nIn April of 1940, the British Purchasing Commission visited the United States in the hope of securing a new fighter to supplement their Spitfire and Hurricane. They approached the North American Aircraft Company with the proposal to build P-40s under license from Curtiss. Instead, North American proposed the idea of building a brand new superior fighter. The BPC accepted the proposal and the first prototype was set to be completed within 120 days. The design team was led by Lee Atwood, Raymond Rice, and Edgar Schmued (a German-born Austrian who was previously employed by Fokker). They quickly set to work on the new prototype designated NA-73X. The original prototype was assembled in 117 days and first flew on October 26, 1940. A majority of the early Mustangs produced were primarily used for testing by the USAAC. Shortly thereafter 320 NA-73s were ordered by the BPC. The first production model destined for the RAF made its maiden flight on May 1, 1941. The Lend-Lease contract was approved later that year on September 25th. These aircraft were designated Mustang I.\n\nThe Allison power-plant used on the early Mustangs was not designed for high altitude performance. In August of 1942, Major Thomas Hitchcock approached senior officers in the U.S. Army for a solution. He proposed the Mustang could be easily developed into a high altitude long-range fighter through the conversion to the Rolls-Royce Merlin engine. America's World War I ace Eddie Rickenbacker also endorsed the idea. Five Mustang Is were delivered to Rolls-Royce for the conversion and Merlin 65 engines were fitted to the airframe. Rolls-Royce would allow the Packard company to build the Merlin engines under license and this would be the answer to the USAAF's long-range fighter problem.\n\nThe P-51D was powered by a Packard Merlin V-1650-7 engine. The aircraft was fitted with six 12.7 mm Machine guns, a reflex gunsight, and a bubble canopy. A total of 7.956 D variant Mustangs were built.\n\nThe P-51D saw front-line service with the Eight Air-force immediately following D-Day. It quickly excelled as a high-altitude escort fighter.\n\n=== In-game description ===\nThe North-American P-51 Mustang was an American fighter designed in the early 1940s and is considered the best US fighter of WWII. It was widely exported to countries in Europe, Asia, Africa and South America. The P-51 participated in the Korean War and other post-WWII conflicts.\n\nThe most famous Mustang version was the P-51D with teardrop (or bubble) canopy. The main problem for the pilots of the earlier variants was a huge blind spot at the rear of the aircraft due to the canopy design. An earlier attempt to address the issue was a British-designed Malcolm hood, installed on many P-51Bs. It improved rearward visibility, but the search for a better solution continued. In January 1943, USAAF's Colonel Mark Bradley, while stationed in Britain, was introduced to the then-new \"bubble\" canopy, designed for use on Spitfires and Typhoons. The canopy had no framework and offered near 360-degree vision. To install the new canopy, the rear fuselage section of the Mustang had to lose some height. However, this change required minimal redesign to the airframe. The inaugural flight of the new P-51D took place at Inglewood, California on 17th November 1943.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=p-51d-5 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/405630-p-51d/ Official data sheet - more details about the performance]\n* [http://forum.warthunder.com/index.php?/topic/12541-p-51d-mustang/ <nowiki>[Forum]</nowiki> P-51D Mustang]\n\n{{AirManufacturer NAA}}\n{{USA fighters}}"}}