{"title":"Tu-4","pageid":405,"wikitext":{"*":"{{About\n| about = Soviet heavy bomber '''{{PAGENAME}}'''\n| usage = other versions\n| link = B-29/Tu-4 (Family)\n}}\n{{Specs-Card\n|code=tu_4\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Soviet heavy bomber {{Battle-rating}}. It was introduced in [[Update 1.59 \"Flaming Arrows\"]]. Though it's an almost identical structure copy of the American [[B-29A-BN|B-29 bomber]], the Tu-4 features an improved 23 mm defensive armament and a very large payload.\n\nSoviet engineers reverse-engineered an interred B-29 to develop an \"exact\" copy per Stalin's request. Challenges were met as available materials were developed using the metric system and the B-29 had been developed using the standard imperial system. Equipment had to be retooled and new supplies had to be developed to match the metric version of the imperial standard sizes. In the end, between the two aircraft, the Soviet Tu-4 only weighed 340 kg more than the B-29, a difference of less than 1%. So stringent was the bureaucratic process for manufacturing parts and equipment, special permission from a high-level general was required to allow Soviet-made parachutes to be utilized in the Tu-4.\n\nThe Tu-4 is a heavy bomber, able to load up to 12,000 kg of bombs. It is able to fully destroy all three bases in one run, while also dealing significant damage to the enemy's airfield. Its defensive armament consists of 5 x turrets with each having 2 x 23 mm cannons (a total of 10 x 23 mm cannons). These guns can annihilate enemy fliers in seconds while covering a wide area, making a Tu-4 tough to approach, let alone attack. However, don't be fooled, it is a huge target and thus nearly impossible to miss. With its battle rating of 8.0 in RB, it faces top rank jet fighters most of the time.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 9,100 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 618 || 604 || rowspan=\"2\" | {{Specs|ceiling}} || 33.4 || 35.0 || 4.7 || 4.6 || rowspan=\"2\" | 1,500\n|-\n! Upgraded\n| 665 || 641 || 30.4 || 32.0 || 10.5 || 6.5\n|-\n|}\n\n==== Details ====\n[[File:Tu-4 WTWallpaper001.jpg|thumb|300px]]\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| ✓ || ✓ || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || 332 || 322 || 270 || ~4 || ~2\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 340 || < 350 || < 290 || > 400\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Compressor (RB/SB)\n|-\n! colspan=\"3\" | Setting 1\n|-\n! Optimal altitude\n! 100% Engine power\n! WEP Engine power\n|-\n| 9,720 m || 2,200 hp || 2,499 hp\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 60 mm Bulletproof glass in front of the pilots.\n* 6.5 mm Steel plates in front of the pilots.\n* 6.5 mm Steel plates behind the pilots.\n* 6.5 mm Steel plates in front of tail control tractions.\n* 6.5 mm Steel plates boxing around rear dorsal gunner and beam gunners.\n* 6.5 mm Steel plate behind the rear ventral turret.\n* 60 mm Bulletproof glass in front of tail gunner.\n* 6.5 mm Steel plate in front of tail gunner.\n\nDo not be fooled of its nickname of \"The Russian Death Star\". Even with its powerful defensive armament, it does have weak spots.\n\nWhile playing the [[Hunter F.1]] or the [[S.O.4050 Vautour IIA|Vautour IIA]], it is easy to send this monster of an aircraft back to base with just one burst. Engaging in a head-on is recommended, as the pilots have little protection, usually knocking them both out.\n\nHowever, the Tu-4 is a monster of an aircraft in terms of its profile and size, making it very easy to hit. Wings and the tail control are weak spots, so hitting the wings will result in severe wing damage on the Tu-4, forcing it to return to base or even sending it back to the hangar.\n\nWhile flying the Sabres, try to aim for the fuel tanks in the wings. Most of the time, just set the fuel tanks ablaze, or even blowing off the wing, sending the foe back to the hangar.\n\n'''Do not engage the Tu-4 from the six!''' Engaging the Tu-4 at its tail, especially from below, '''is''' asking for trouble. Always try to engage the Tu-4 from the top, or in head-ons, the fuselage turrets have dead zones when engaging from >~70 degrees.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Suspended armament ===\n{{Specs-Avia-Suspended}}\n<!-- ''Describe the aircraft's suspended armament: additional cannons under the wings, bombs, rockets and torpedoes. This section is especially important for bombers and attackers. If there is no suspended weaponry remove this subsection.'' -->\n{{main|FAB-100sv (100 kg)|FAB-250sv (250 kg)|FAB-500sv (500 kg)}}\n{{main|FAB-1000 (1,000 kg)|FAB-1500M-46 (1,500 kg)|FAB-3000M-46 (3,000 kg)}}\n\nThe '''''{{PAGENAME}}''''' can be outfitted with the following ordnance:\n\n* 40 x 100 kg FAB-100sv bombs (4,000 kg total)\n* 40 x 250 kg FAB-250sv bombs (10,000 kg total)\n* 12 x 500 kg FAB-500sv bombs (6,000 kg total)\n* 20 x 500 kg FAB-500sv bombs (10,000 kg total)\n* 8 x 1,000 kg FAB-1000 bombs (8,000 kg total)\n* 8 x 1,500 kg FAB-1500M-46 bombs (12,000 kg total)\n* 4 x 3,000 kg FAB-3000M-46 bombs (12,000 kg total)\n\n=== Defensive armament ===\n{{Specs-Avia-Defensive}}\n<!-- ''Defensive armament with turret machine guns or cannons, crewed by gunners. Examine the number of gunners and what belts or drums are better to use. If defensive weaponry is not available, remove this subsection.'' -->\n{{main|NR-23 (23 mm)}}\n\nThe '''''{{PAGENAME}}''''' is defended by:\n\n* 2 x 23 mm NR-23 cannons, front dorsal turret (275 rpg = 550 total)\n* 2 x 23 mm NR-23 cannons, front ventral turret (250 rpg = 500 total)\n* 2 x 23 mm NR-23 cannons, rear dorsal turret (275 rpg = 550 total)\n* 2 x 23 mm NR-23 cannons, rear ventral turret (500 rpg = 1,000 total)\n* 2 x 23 mm NR-23 cannons, tail turret (275 rpg = 550 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nLike most planes of its class, the Tu-4 relies on its defensive turrets for aerial combat. A few good hits from its 10 x 23 mm guns can send an attacker back to base, with critical damage or, if not, credit the player with the victory.  Maxing out the crew stats is a good idea, it will allow the player to focus more on flying while the AI does the gunning. Don't get too arrogant, remember, the Tu-4 is a huge plane. It is easy to hit, and as mentioned above, especially when the opponents could be jets.\n\nAll in all, pay attention to the aircraft's surroundings. The Tu-4 can easily net the team a win so don't let the feeling of invincibility get imbued, or the only reward will be a fiery end.\n\nWith this bomber's high battle rating, you should be actively looking out for enemy vehicles. It is possible for an attacker to have a relative closing speed of over 1000 km/h. Relying solely on the spotting system will allow some fighters to get so close it will be impossible for you to react. It is especially common for the enemy to approach either in a 30° cone straight ahead or to trail behind and below you, generally outside gun range before pulling up sharply.\n\nWhen first starting with this aircraft, the payload option is 40 x 100 kg bombs which are able to destroy numerous bases. One of the best ways to maximize the payload's effectiveness, 15 x 100 kg bombs are needed for one base. The A.I. gunners will be able to defend the plane as bombs are dropped from the bombsight until switching back to the pilot seat, ready to head to next objective. The best option for base bombing is the 8 x 1,500 kg payload. A single bomb will be enough to destroy a base, provided you do not miss.\n\nOnce the Tu-4's bombing run is complete, start descending towards the friendly airfield; enemy fighters '''will''' be hunting for the Tu-4, so be more alert. The Tu-4 has a very powerful defensive system installed with 5 turrets, each with two 2 x 23 mm cannons, so the Tu-4 should be able to defend itself reasonably well. If you believe that landing would be putting the aircraft in grave danger, it is worth considering to instead stay high and shoot down approaching fighters, calling out your position will often lower the stigma associated with this action.\n\n'''Do not''' rely on the AI gunners. The Tu-4 will often face powerful jets including [[Hunter F.1]]s and [[F-86F-2]]s. These adversaries are usually experienced and will not foolishly tail the bomber for long and try to engage at ranges greater than 1 km or engage in a head-on pass. These manoeuvres render the AI gunners largely useless. Laying down a stream of 23 mm rounds is recommended, but beware of jamming. Hits can be scored within 1.5 - 2 km, if somebody is tailing the Tu-4 or engaging in a head-on pass, they can also occur at greater ranges. Combine the turret shooting with a defensive style of flying to utilize it to its full potential; the Tu-4 offers good handling for its size. Be very careful when putting the Tu-4 into a dive. It is just as prone as any other aircraft to suffering structural damage if its limitations are exceeded. Do '''not''' rely on flaps to slow down, their weak construction will let you down.\n\nThe two most dangerous opponents of the Tu-4 are the [[S.O.4050 Vautour IIA]] and the [[Hunter F.1]]. With their 30 mm cannons, one burst will be devastating against the Tu-4. The [[F-86F-2]] is also a dangerous opponent, with four 20 mm cannons with a very high velocity and rate of fire.\n\nWhen down-tiered, the most dangerous opponents are the [[Me 163 B]], the [[Me 262 C-2b]] and the [[R2Y2 (Family)|R2Y2 KAI]]s. All equipped with 30 mm cannons, they are able to send the Tu-4 back to the hangar within one burst. The Me 163 and [[Ki-200]]'s extreme mobility are something to be wary of. It isn't uncommon for bomber pilots to lose track of the attacker after a fly by.\n\nDon't underestimate the other Sabres, such as the [[F-86F-40 (Japan)|F-86F-40]] and the [[CL-13A Mk 5|CL-13A]]. Their 12.7 mm machine guns can do a lot of damage, crippling or setting the Tu-4 afire, which could end the match for the plane there.\n\nDo not consider any enemy bomber or attacker as a neutral or even friendly party. It is quite common for [[Canberra B (I) Mk 6|Canberra]]'s or even [[B-57B|B-57]]'s to try and engage you if the opportunity presents itself.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Auto control available || Not controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Combined || Controllable<br>1 gear || Auto controlled\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n[[File:Tu-4 going in the sunset.jpg|thumb|350px]]\n\n\n'''Pros:'''\n\n* Very strong and fast climber once flight performance modifications have been purchased\n* Very heavy payload (up to 12,000 kg / 26,500 lbs)\n* All payload options are internal and has next to no effect on flight performance\n* Offers effective defensive 23 mm turrets that have very few dead zones\n* Gunners are located separately from the gun turret with the exception of the tail turret\n* Lots of ammo for defensive armaments\n\n'''Cons:'''\n\n* Does not offer any payload modification immediately, unlike the B-29\n* Prone to fires and wing damage\n* Will be ripped to shreds by cannons with a calibre of 20 mm and beyond, especially the [[MK 108 (30 mm)|30 mm MK 108]] and the [[ADEN (30 mm)|30 mm ADEN]]/[[DEFA 541 (30 mm)|30 mm DEFA 541]]\n* Matchmaking will make this aircraft face early jets\n* Unable to reliably defend itself from multiple opponents attacking at once from multiple directions\n* Huge aircraft, making it easy to spot from distance and making it close to impossible to miss\n* Has a low dive top speed\n* Takes a while to reach an optimal altitude\n* Having altitude doesn't do much because jets can reach you in a matter of minutes\n* Landing gear takes a long time to deploy and retract\n* Wings are considered weak spots, damaged wings will hinder the plane's control\n* Flaps are one piece, making it frequent for a wing to lose the whole piece at once. This can affect lift significantly.\n* Can be hard to handle during landing, especially on short runways.\n* Takes a while to reach the ground (in one piece)\n* Against missiles you are hopeless\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nThe Soviet Tu-4 strategic bomber is a copy of the B-29 with more powerful engines and armament. The USSR did not possess strategic aviation capacity in 1945 while having a great requirement for it as the Cold War was about to begin. A group of B-29 accidentally flew into Soviet territory and the B-29 plane was captured. The B-29's that ended up in the hands of Soviet engineers seemed to be a technological miracle and a vast gap between the long-range bomber technologies of the US and the USSR was soon discovered. This lead to a hurried cloning effort while created the Tu-4, a Soviet copy of the American bomber with a few modifications. The Soviets copied the bomber so closely that some Tu-4 had bullet hole patches from the B-29 that weren't meant to be there.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=tu_4 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|G-sMfeWsEq0|'''The Shooting Range #148''' - ''Pages of History'' section at 07:12 discusses the Tu-4.|gxIVvUZGptw|'''The Shooting Range #51''' - ''Special'' section at 00:29 discusses the B-29 & Tu-4.|RaxLXgQ61yo|'''Realistic: Tu-4 [8.0 BR change]''' - ''Jengar''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [http://warthunder.com/en/news/3756-development-b-29-superfortress-tu-4-the-new-face-of-the-giant-en/ [Devblog<nowiki>]</nowiki> B-29 Superfortress/Tu-4 – the new face of the giant]\n* [https://forum.warthunder.com/index.php?/topic/315758-tupolev-tu-4/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Tupolev}}\n{{USSR bombers}}"}}