{"title":"Yak-3P","pageid":320,"wikitext":{"*":"{{About\n| about = Soviet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = Yak-3 (Family)\n}}\n{{Specs-Card\n|code=yak-3p\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Soviet fighter {{Battle-rating}}. It was introduced in [[Update 1.35]].\n\nThe Yak-3P is a fantastic all-around fighter. It has the manoeuvrability of an A6M, the armament of an Fw 190, the speed of a P-63, all combined into one fantastic combo.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nLike most Yaks, the 3P has good manoeuvrability, and you can out-turn pretty much everything except for the A6M, some of the Bf 109s, and Spitfires. Fortunately, the 3P also has another ace-in-the-hole. In arcade mode, WEP provides a very good rate of acceleration, so running away from a battle poses no challenges. However, the climb-rate is also pretty good, but not as great as the Spitfire or Fw 190. Thus, Yak-3P is one of the best \"dive-into-battle\" and destroy planes. Performance is terrible above 3 km. Below that altitude performance is fantastic.\n\nIn Arcade mode, this is one of the best planes available. The wings are not affected by high speeds, so you can push the 3P to the limits. However, in RB or SB, watch your speed if you use Boom & Zoom. Any speed higher than around 660 km/h (410 mph) will cause the control surfaces to lock up and any attempt to make a hard turn at this point will break your wings. The 3P also has really bad high altitude performance, so you are limited to around 2,000 m before your speed and performance drastically decrease.\n\nUnlike the Yak-9s and 7s, the 3P is a fully composite plane. This means the wings have higher durability than the wooden-supported Yak-9, but it is still recommended you do not push the plane's manoeuvres to the limits, as the wings will still break in a high-speed dive or manoeuvres. The engine will also overheat extremely quickly.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,100 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 622 || 604 || rowspan=\"2\" | {{Specs|ceiling}} || 18.4 || 19.0 || 17.7 || 17.7 || rowspan=\"2\" | 348\n|-\n! Upgraded\n| 663 || 643 || 17.2 || 17.5 || 24.0 || 21.1\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| X || X || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 685 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || N/A || N/A || 320 || ~12 || ~9\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 380 || < 420 || < 490 || > 340\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\nThe Yak-3P does not have a lot of protection in armour plates, it only offers protection from the rear of the cockpit, with a steel plate behind the pilot, a thick bullet proof glass head rest, with a small steel panel installed above it.\n\n* 8.5 mm Steel - Plate behind the pilot\n* 10 mm Steel - Plate above pilot's seat on the canopy\n* 64 mm Bulletproof glass - Rear glass/headrest\n\nThe durability of the plane is not great. Try not to be shot at all, because even a Spitfire with 8 x 7.7 mm can set you aflame.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|B-20M (20 mm)|B-20S (20 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 1 x 20 mm B-20M cannon, nose-mounted (120 rpg)\n* 2 x 20 mm B-20S cannons, nose-mounted (130 rpg = 260 total)\n\nThe armament is fantastic- three 20 mm cannons mounted in the nose can rip apart pretty much every plane you will face. However, they do not pack the punch of Hispanos or AN/M2 cannons, or the unlockable belts, for that matter. Thus, it is recommended you research the belts as quickly as possible because the Ground Targets ammunition will increase performance markedly. One great advantage of the B-20M/S cannons is that they take much longer to jam than their American/British cannon counterparts. Watch your ammo count, it's best to attack at an angle with short bursts to maximize damage while preserving ammo.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe Yak-3P is much the same as the [[Yak-3]], however it has some differences such as armament, instead of the one cannon and two machine guns. It has no secondary armament, thus using it as a ground attacker or bomber is not advisable, it lacks the ordnance to perform that role. It should only be used as a fighter, using the boom and zoom tactic, to dominate and own the battlefield of the deep blue sky. A Yak-3P is equipped with three cannons, two B-20S and a single engine mounted B-20M.\n\nThe armament provides the Yak-3P with some of the best armament at its rank. The three cannons are able to make quick work of any enemy aircraft, using short bursts of about one second are able to knock the enemy aircraft out. The placement of the three cannons are all located in the front of the fuselage, making accuracy very good, at all ranges.\n\nTo get the best out of this legendary aircraft, climb between 4,000 and 5,000 m, it will only take a few minutes to reach this height. Once at this height level off and keep your eyes open, find an enemy target you want to engage and overshoot it then dive down on to it. Cut the throttle back as you dive, if you don't watch your speed, you will rip the wings clean off.\n\n====Engaging fighters====\nMost enemy fighters will be between 3,000 and 3,800 m, using your height advantage, drop down from your height and and get behind it. Once behind the fighter, do not engage until you are close enough to rip them in half with your three 20 mm cannons. If you miss and they turn, pending how sharp the turn is follow them. However, if it's a very sharp turn do not turn with them, instead open the throttle and climb back up to gain a height advantage. Then either try it again or find a new bandit to knock out.\n\n====Engaging bombers====\nEngaging enemy bombers, since the Yak-3P does not have any frontal protection the engine will get shot out or badly damaged, to mitigate this do not travel in a straight line. Instead, zig-zag behind it, the additional benefit of this move makes it harder for the enemy to knockout your pilot. The Yak-3P does not have any bullet proof glass on the front of the canopy, allowing enemy machine gun or cannon fire to penetrate inside of the cockpit from the front.\n\nSince the Yak-3P has three powerful cannons, a short burst on the enemy tail will see that the slight surfaces get ripped off. Then move to one of the wings and fire a two-second burst, this will knock the engines out and cause fuel leaks in the wing, which can turn into fires if you have a HE round on your clip.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Auto control available || Controllable<br>Auto control available || Separate || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Good acceleration\n* Good speed in level flight\n* Good climb rate\n* Good horizontal energy retention\n* Decent roll rate\n* Great armament\n* Sufficient ammunition capacity (by Soviet standards; still needs trigger discipline to control ammunition usage)\n\n'''Cons:'''\n\n* Relatively poor durability\n* Easily catches fire\n* Poor performance above 2,000 m\n* No combat flaps\n* No WEP\n* Low wing rip speed for diving\n* Serious control surface compression above 600 km/h\n* Red paint scheme can be easily seen at long distances\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nThe idea to produce a new fighter for the Red Army Air Force went as far back as 1941. It was then that the Yakovlev Design Bureau presented the I-30 prototype, intended an alternative to the earlier Yak-1 design. However, the German invasion of the USSR, as well as aluminium shortages, meant that the project had to be put on hold. Yakovlev resumed the development in 1943 while working on an upgraded version of the Yak-1 fighter. This time, it was decided that a new aircraft should be produced to completely replace the Yak-1 and Yak-7 models.\n\nBy September 1943, yet another improved variant was ready, designated Yak-1M Dubler, on which the canvas skin on the tail section was replaced with 2 mm plywood, and oil and water radiators were improved. The Dubler also had a new mastless antenna, a ring sight instead of a reflector sight, improved armour and a new propeller. Test pilots were impressed by the new prototype. Their report stated in part: \"''Yak-1M possessed excellent horizontal, and especially vertical, manoeuvrability. Top speed greatly improved compared to earlier serial-production Yaks. Despite the improved performance, the aircraft remains easy to fly and does not require extensive pilot training''.\"\n\nThe new machine was dubbed as the Yak-3 and entered service with the Red Army Air Force in 1944. The Yak-3 was a further modification of the Yak-1, produced in 1944 and 1945, with a total of 4,848 built, and considered one of the best fighters of the war.\n\nThe new fighter quickly became very popular with Soviet pilots. They highly praised its solid armament of two Berezin UBS 12.7 mm machine guns and one ShVAK 20 mm cannon as well as ease of piloting and superb low-altitude performance. Marcel Albert, the top scoring French ace of World War II, cited the Yak-3 as one of the best fighters of the war, along with the P-51 Mustang and the Supermarine Spitfire. After the war, the Yak-3 was also used by the Air Forces of Socialist Yugoslavia and Poland.<ref name=\"forum\">[[wt:en/news/2693--en|[Aircraft Profile] Yak-3]]</ref>\n\nThe Yak-3P was produced from April 1945 until mid-1946, armed with 3 × 20 mm Berezin B-20 cannon with 120 rounds for the middle cannon and 130 RPG for the side weapons. The three-cannon armament with full ammunition load was actually 11 kg (24 lb) lighter than that of a standard Yak-3, and the one-second burst mass of 3.52 kg (7.74 lb) was greater than that of most contemporary fighters. Starting in August 1945, all Yak-3 were produced in the Yak-3P configuration with a total of 596 built.\n\n=== In-game description ===\nA single-seat monoplane fighter with a composite construction, retractable landing gear and a closed cockpit.\n\nA modification of the Yak-3 fighter with improved armament consisting of the 20 mm Berezina B-20M engine cannon and two synchronized 20 mm Berezina B-20S cannons installed instead of the synchronized machine guns. Since the B-20 cannons were modifications of UB machine guns with an increased-calibre barrel, the fighter's design required practically no changes. The aircraft's empty weight increased by only 11 kg, while the weight of its armament and ammunition ended up even lower than that of the Yak-3 with its ShVAK cannon and two large-calibre UB machine guns. The change in weaponry had no detrimental effect on the aircraft's flight characteristics.\n\nThe Yak-3P fighter was armed with one B-20M engine cannon with 120 shells and two synchronized B-20S cannons with 130 shells each. All the cannons were fired using a compressed-air electric mechanism. The PKI-1 sight replaced the PBP-1A sight.\n\nThe Yak-3P had a strengthened airframe (particularly the wing), and clasps were installed on the extra landing gear panels. The aircraft received the new RSI-6M radio.\n\nThe experimental Yak-3P completed its maiden flight on 23 March 1945. The fighter went into series production at several aircraft plants only a few days before the end of the war, so it never reached the front. From August 1945 and to the end of series production, all Yak-3 fighters were built exclusively to the standard of the Yak-3P. In total, 596 were produced between April 1945 and the middle of 1946. The last of them served until 1950.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=yak-3p Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|7UHpIcQQonY|'''{{PAGENAME}}  - Red Dead Yak - Using speed correctly in a fight''' - ''Green Fury''|SlOBjdTVd9M|'''{{PAGENAME}} - Simple Ace And Soviet Teams In General''' - ''Napalmratte'' Review starts at 2:43}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/312313-yakovlev-yak-3p/ Official data sheet - more details about the performance]\n\n=== References ===\n<references/>\n\n{{AirManufacturer Yakovlev}}\n{{USSR fighters}}"}}