{"title":"Yak-3 (France)","pageid":717,"wikitext":{"*":"{{About\n| about = French premium fighter '''{{PAGENAME}}'''\n| usage = other uses\n| link = Yak-3 (Family)\n}}\n{{Specs-Card\n|code=yak-3_france\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium rank {{Specs|rank}} French fighter {{Battle-rating}}. It was introduced in [[Update 1.77 \"Advancing Storm\"]].\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,100 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 633 || 615 || rowspan=\"2\" | {{Specs|ceiling}} || 18.3 || 18.9 || 17.9 || 17.9 || rowspan=\"2\" | 348\n|-\n! Upgraded\n| 674 || 654 || 17.2 || 17.4 || 24.3 || 21.3\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| X || X || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| {{Specs|destruction|body}} || {{Specs|destruction|gear}} || N/A || N/A || 320 || ~12 || ~9\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 380 || < 420 || < 490 || > 340\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 8.5 mm steel behind pilot\n* 10 mm steel on top of rear cockpit\n* 64 mm bulletproof\n* Self-sealing fuel tanks (1 under pilot, 1 in each wing)\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|ShVAK (20 mm)|Berezin UB (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 1 x 20 mm ShVAK cannon, nose-mounted (120 rpg)\n* 2 x 12.7 mm Berezin UB machine guns, nose-mounted (150 rpg = 300 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe Yak-3 is the pinnacle of the piston engine Yakovlev design, with a much more powerful engine, the addition of a second MG (meaning the MGs are viable now!), though metal wings were not yet added until the Yak-9.  The coolant system, now actually somewhat effective, has been moved to the wing roots (no \"smiley face\" below the nose), making the plane more streamlined. The cannon - the same old 20 mm ShVak - receives a pleasant upgrade: very effective Air Targets belts.\n\nBoasting incredible engine performance on a light and agile airframe, you can easily climb with, or even outclimb your contemporary fighters, allowing you maintain an energy advantage over some at the start of a match. Unlike some of the other energy-fighters you will come across (Bf-109s and such), the Yak-3 has incredible maneuverability compared to them, found in its roll rate and turn radius. Its energy retention and engine power alone allow you to almost indefinitely hold a horizontal turn, making this plane an excellent dogfighter and can let you play both as a turn-fighter of sorts or a dedicated energy-fighter.   \n\nFlight performance of the Yak-3 is outstanding. While it can't out-turn the likes of a Zero, or execute Boom-and-Zoom tactics as well as a Bf-109, it can certainly handle nearly everything it will face. This plane truly excels at long and slow dogfights, where the engine power will allow you to recover from any turn with ease. The landing flaps, albeit rather weak, making stall-fighting and turning effectively under 300 km/h trivial, and will certainly help when dealing with enemies that outclass you in one area. The Yak can easily handle said stall maneuvers, and low-speed turns you may find yourself in. Most planes will have lost most of their speed and will struggle to accelerate in these conditions, making maneuvers like the high yo-yo absurdly useful.   \n\nAlways beware of true turn-fighters (Spitfires, Zeros), as they may be able to take you down before you can force them to bleed energy. It is generally recommended to maintain an energy advantage (altitude is best), so they can never have a fight on their own terms. If in a dogfight with a turn-fighter, the Yak's agility can be a major aid in staying out of your opponent's flight path, so capitalize on this as best you can. As stated above, forcing your enemy to turn while staying untouched can allowing you to pull maneuvers quickly and accelerate when speed is needed to get on your enemies tail.   \n\nEven with the climbing performance the Yak offers, bomber-hunting isn't recommended. You have a very limited ammunition supply making even extending dogfights with more than one enemy stressful. Thankfully, the weapons you get won't disappoint. Both your gun and cannon have good muzzle velocities with high rates of fire, and are effective all-around. Try to only hold bursts of a few rounds at a time to maximize damage potential while preserving ammo for later fights.   \n\nWhile certainly outperformed in areas like turn rates and BnZ potential, the Yak can accomplish any feat with proper skill from the pilot, making for one of the best multirole fighters currently in-game.     \n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Auto control available || Controllable<br>Auto control available || Separate || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Stellar engine performance\n* Stall and vertical maneuvers are effective and easy\n* Energy retention is on-par with Bf-109s \n* Surprisingly very agile, with a great turn and roll rate\n* Doesn't struggle or begin to feel sluggish at low speeds \n* Effective armament \n* Great acceleration\n\n'''Cons:'''\n\n* Mediocre rip speed - worsened by its powerful engine\n* No combat flaps, only equipped with landing flaps \n* No WEP, engine overheats at 100%\n* Poor engine performance above 5 km\n* Long bursts and bomber-hunting will quickly drain your ammo pool\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nThe idea to produce a new fighter for the Red Army Air Force went as far back as 1941. It was then that the Yakovlev Design Bureau presented the I-30 prototype, intended an alternative to the earlier Yak-1 design. However, the German invasion of the USSR, as well as aluminium shortages, meant that the project had to be put on hold. Yakovlev resumed the development in 1943 while working on an upgraded version of the Yak-1 fighter. This time, it was decided that a new aircraft should be produced to completely replace the Yak-1 and Yak-7 models.\n\nBy September 1943, yet another improved variant was ready, designated Yak-1M Dubler, on which the canvas skin on the tail section was replaced with 2 mm plywood, and oil and water radiators were improved. The Dubler also had a new mastless antenna, a ring sight instead of a reflector sight, improved armour and a new propeller. Test pilots were impressed by the new prototype. Their report stated in part: \"''Yak-1M possessed excellent horizontal, and especially vertical, manoeuvrability. Top speed greatly improved compared to earlier serial-production Yaks. Despite the improved performance, the aircraft remains easy to fly and does not require extensive pilot training''.\"\n\nThe new machine was dubbed as the Yak-3 and entered service with the Red Army Air Force in 1944. The Yak-3 was a further modification of the Yak-1, produced in 1944 and 1945, with a total of 4,848 built, and considered one of the best fighters of the war.\n\nThe new fighter quickly became very popular with Soviet pilots. They highly praised its solid armament of two Berezin UBS 12.7 mm machine guns and one ShVAK 20 mm cannon as well as ease of piloting and superb low-altitude performance. Marcel Albert, the top scoring French ace of World War II, cited the Yak-3 as one of the best fighters of the war, along with the P-51 Mustang and the Supermarine Spitfire. After the war, the Yak-3 was also used by the Air Forces of Socialist Yugoslavia and Poland.<ref name=\"forum\">[[wt:en/news/2693--en|[Aircraft Profile] Yak-3]]</ref>\n\nThe Yak-3P was produced from April 1945 until mid-1946, armed with 3 × 20 mm Berezin B-20 cannon with 120 rounds for the middle cannon and 130 RPG for the side weapons. The three-cannon armament with full ammunition load was actually 11 kg (24 lb) lighter than that of a standard Yak-3, and the one-second burst mass of 3.52 kg (7.74 lb) was greater than that of most contemporary fighters. Starting in August 1945, all Yak-3 were produced in the Yak-3P configuration with a total of 596 built.\n\n=== In-game description ===\nThe Yak-3 was a Soviet single-engine fighter of the WWII era. It was the first combat aircraft designed by Alexander Yakovlev's construction bureau. The Yak-3 was a further modification of the Yak-1, produced in 1944 and 1945, with a total of 4,848 built, and considered one of the best fighters of the war. In February 1943, a new Yak-1M variant was completed. It was a further development of the Yak-1, differing from it mainly in lower weight and smaller wing span.\n\nBy September 1943, yet another improved variant was ready, designated Yak-1M Dubler, on which the canvas skin on the tail section was replaced with 2mm plywood, and oil and water radiators were improved. The Dubler also had a new mastless antenna, a ring sight instead of a reflector sight, improved armour and a new propeller. Test pilots were impressed by the new prototype. Their report stated in part: \"Yak-1M possessed excellent horizontal, and especially vertical, manoeuvrability. Top speed greatly improved compared to earlier serial-production Yaks. Despite improved performance, the aircraft remains easy to fly and does not require extensive pilot training.\" Therefore, the new modification went into production, receiving a new designation, Yak-3.\n\nOne of the most memorable air battles for the Yak-3 took place on 16th July 1944, when the plane showed it could confidently engage superior enemy forces. On that day, 10 Yak-3s met 8 Bf-109s and 4 FW-190s, with the battle eventually growing to 18 Soviet and 24 German planes. In the end, 15 German planes were shot down, for the loss of a single Yak-3.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=yak-3_france Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|DWfx4FGgO50|'''Premium Review: {{PAGENAME}} [Brilliant Beauty!]\"'''  - ''Jengar''|A5zB4uwfnsk|'''Premium Review. {{PAGENAME}}. An effective Bruiser''' - ''Joseph 2000''|ZQ0XIBPcF4E|'''The Shooting Range #73''' - ''Pages of History'' section at 08:54 discusses the {{PAGENAME}} and the Nomandie-Niemen Regiment.}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/78309-yakovlev-yak-3-1944/ Official data sheet - more details about the performance]\n\n=== References ===\n<references />\n\n{{AirManufacturer Yakovlev}}\n{{France fighters}}\n{{France premium aircraft}}"}}