{"title":"Yak-9U","pageid":321,"wikitext":{"*":"{{About\n| about = Soviet fighter '''{{PAGENAME}}'''\n| usage = other versions\n| link = Yak-9 (Family)\n}}\n{{Specs-Card\n|code=yak-9u\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Soviet fighter {{Battle-rating}}. It was introduced in [[Update 1.37]].\n\nThe [[Yak-9]] was a Soviet single-engine fighter of the WWII era. It was the first combat aircraft designed by Alexander Yakovlev's construction bureau. The most mass-produced Soviet fighter of the war, it remained in production from October 1942 to December 1948, with a total of 16,769 built.\n\nThe Yak-9 was a further modification of the [[Yak-1]] and [[Yak-7B]]. In its core design, it was a redesign of the Yak-7. With few external differences, Yak-9 was at the same time much more advanced internally. This is not unexpected, as almost two years of design and combat experience of the Yak series went into the [[Yak-9]]. Also, at the time aluminium was in much greater supply than it had been two years previously at the start of the war. Amongst other things, the use of metal allowed the plane's weight to be significantly reduced, meaning that more fuel could be stored and that the aircraft could be equipped with more powerful armament and more specialised equipment.\n\nThe Yak-9U is a redesign of the [[Yak-9]]. The Yak-9U entered into service in 1943, less than an year before the [[Yak-3]] (even though the Yak-3 is before the Yak-9U in the Tech Tree) and has the same armament (2 x [[Berezin UB (12.7 mm)|12.7 mm Berezin UB machine guns]] with 170 rounds per gun and 1 x [[ShVAK (20 mm)|20 mm ShVAK cannon]] with 120 shells). The Yak-9U is faster and more resilient, but also heavier.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\nThe Yak-9U is an up-engined Yak-9 equipped with the M-107A engine. It sports competitive speed, far above average turning and roll abilities, good acceleration, a high dive limit (by USSR standards), and keeps nice and crisp controls from speeds as low as 250 km/h to 750 km/h. It is arguably the most underestimated vehicle rank-for-rank in the game and is often skipped by players who view it as just another Yak-9.\n\nUnlike previous Yak-9s equipped with the VK-105PF engine, the Yak-9U gets a significant upgrade in the form of its M-107A engine (which also happens to be the engine utilized by the premium [[Yak-3 (VK-107)]] and the later [[Yak-9P]]/[[Yak-9UT|UT]]). As such, the Yak-9U is one of the fastest planes at sea level at this BR and retains excellent performance up to ~6 km where it can effectively engage higher-speed American and faster climbing German planes. This, combined with the excellent handling and turn-fighting qualities allow the Yak-9U to effectively dictate any engagement- a pilot can turn-fight Bf 109s and P-47s with ease while having the capability to outrun slower yet more manoeuvrable vehicles such as the Spitfire.\n\nAt sea level, the Yak-9U can catch most, if not all, planes at its BR, including [[P-47 (Family)|P-47]] and [[P-51 (Family)|P-51D]]. Beware, however, as the Yak airframe isn't particularly durable in a dive and will rip at speeds above 720 km/h {{Annotation|IAS|Indicated airspeed}}. Thankfully, forcing an opponent down low effectively seals their fate as you and your team perform optimally at low altitude.\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 5,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 652 || 634 || rowspan=\"2\" | {{Specs|ceiling}} || 20.1 || 20.7 || 14.9 || 14.9 || rowspan=\"2\" | 380\n|-\n! Upgraded\n| 699 || 677 || 18.6 || 19.1 || 22.9 || 18.8\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear\n|-\n| X || X || ✓ || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 720 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || N/A || N/A || 280 || ~12 || ~9\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 400 || < 420 || < 490 || > 450\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 64 mm Bulletproof glass in cockpit front and rear.\n* 8 mm Steel plate behind the pilot.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|ShVAK (20 mm)|Berezin UB (12.7 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 1 x 20 mm ShVAK cannon, nose-mounted (120 rpg)\n* 2 x 12.7 mm Berezin UB machine guns, nose-mounted (170 rpg = 340 total)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe Yak-9U offers incredible speed, acceleration, climb and manoeuvrability with the same complementary firepower. Unlike its VK-105 powered predecessors, which suffered significant power loss above 3500 metres, the VK-107 engine of the Yak-9U retains decent performance up to 5000 metres, allowing you to partake in the initial dogfight of a match without being at a massive disadvantage. Once the air battle has gone down to a lower altitude, your engine performance will go from good to incredible. With a sea level top speed of nearly 600 km/h there's not many planes that can catch or outrun you. Your acceleration, climb rate and energy retention are superior to most other aircraft as well. The turn rate, while not top notch, is still better than a good portion of your competition.\n\nHowever, the Yak-9U is not without its flaws. The engine suffers from overheating at lower altitudes, and WEP should be used sparingly. Usage of Manual Engine Controls will slow down the overheating, but not eliminate it. Engine performance above 5000 metres is lacking compared to aircraft of other nations.The armament, while perfectly adequate against fighters, will struggle against heavier targets, and engaging heavy bombers is not recommended unless you're confident in your ability to get a pilot snipe. Due to a somewhat low wing rip speed, most aircraft will outdive you. The acceleration below 200 km/h IAS is poor compared to most fighters, and stall fighting should be avoided unless you started the fight with an energy advantage.\n\nAfter takeoff, you should immediately start climbing up to 5000 metres. The optimal climb speed is around 250 km/h IAS. When initially engaged with the enemy, it's best to start off the fight slowly. Avoid losing altitude immediately. Try to employ hit and run tactics and conserve your ammo. Once all of the enemies in the area start dogfighting and losing altitude, it's time to become more aggressive. With the loss of altitude, you can start to capitalize on you excellent low down engine performance. Stick to boom and zoom tactics if possible, but don't be afraid of engaging in dogfights if necessary. If you find yourself in a bad situation, know that you can outrun and outaccelerate just about any plane that you can meet. Use your superior speed to disengage, and then re-engage after you've built up and energy advantage.\n\n==== In ground & naval battles ====\nThe Yak-9U offers no bombs, rockets or any secondary payloads, it is an air supremacy fighter armed only with machine guns and cannons. They must be used to defend your ground forces or naval fleets from enemy bombers and fighter bombers. Stay high, use the boom and zoom tactics to your advantage - do not strafe tanks or ships, the 20 mm cannons only offer 120 rounds which will be needed in any air to air combat engagement.\n\n=== Manual Engine Control ===\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"7\" | MEC elements\n|-\n! rowspan=\"2\" | Mixer\n! rowspan=\"2\" | Pitch\n! colspan=\"3\" | Radiator\n! rowspan=\"2\" | Supercharger\n! rowspan=\"2\" | Turbocharger\n|-\n! Oil !! Water !! Type\n|-\n| Controllable || Controllable<br>Not auto controlled || Controllable<br>Not auto controlled || Controllable<br>Auto control available || Separate || Controllable<br>2 gears || Not controllable\n|-\n|}\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent cockpit visibility\n* Good handling and manoeuvrability at most speeds\n* Good energy retention\n* Good rate of climb\n* Excellent acceleration above 150 km/h IAS\n* Performs identically to the Yak-9P and Yak-9UT while being at a lower BR\n* Nose-mounted weaponry\n\n'''Cons:'''\n\n* Relatively low ammo count\n* Weaponry inadequate against sturdy targets\n* Overheating is a very real issue, MEC will only delay it\n* Lower wing rip speed than most of its peers\n* Low thrust below 150 km/h IAS\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n=== Historical design and development ===\nDuring December 1943, the creation of a new airframe (Yak-9U) allowed the installation of the M-107A engine, which was more powerful than the previous VK-105PF. The engine mount was brand new and included individual faired exhaust pipes, wings, and fuselage structure that was made of metal while the whole aircraft received a covering of Bakelite skin. The horizontal tail surfaces were slightly reduced in order to afford the aircraft improved pitch control. The oil cooler intake was re-positioned from beneath the nose to the port wing root as well as an enlarged radiator bath being moved further aft under the fuselage. A supercharger intake was centred on the top decking of the engine cowling. The rear antenna cable was moved inside a lengthened rear canopy which featured a more aerodynamically refined shape with a modified fuselage deck contour. The  The typical armament of the Yak-9U was a 20 mm (79 cal) ShVAK cannon with 120 rounds that was fired through the aircraft's hollow propeller shaft, and two 12.7 mm (50 cal) Berezin UB machine guns with 340 rounds.\n\n[[File:Yakolev Yak-9U Frank.jpg|thumb|Yakolev Yak-9U Frank]]\nJanuary to April 1944 marked the commencement of State trials and revealed that the Yak-9U had a superior top-speed compared to all fighters in service on the Eastern front at 6,000 m (19,685 ft). Unlike the [[I-185 (M-71)|I-185]] the Yak-9U was a much simpler to fly and stable aircraft. Ultimately the M-107A engine inherited all the problems of the VK-105PF engine. The engine was prone to overheating, oil leaks, loss of engine pressure during climbs, spark plugs constantly burning out, and intense vibrations which would fatigue assembly bolts leading to a short engine life. These defects forced the first production batches starting during April 1944  to be powered by the reliable M-105 PF-3 engine. Further changes would include the fuel capacity of the Yak-9U being upgraded to 400L (106 US gal) and in order to re-balance the aircraft, the wings where moved 9.906 centimeters (3.9in) forward and the aircraft's VlSh-107LO propeller being replaced with the older VISH-105S. A total production of 1,134 aircraft where constructed by December 1944.\n\nThe model in-game does not sport the production batch's modifications as it is the prototype trial model.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=yak-9u Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|aaTEkyzWsL0|'''{{PAGENAME}}  \"Aaand he's dead.\"''' - ''WeadraPlays''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/109524-yakovlev-yak-9u/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Yakovlev}}\n{{USSR fighters}}"}}