{"title":"Yak-15P","pageid":325,"wikitext":{"*":"{{About\n|about=Soviet jet fighter '''{{PAGENAME}}'''\n|usage=the early version\n|link=Yak-15\n}}\n{{Specs-Card\n|code=yak-15_early\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of and the creation and combat usage of the aircraft, as well as its key features. In the second part, tell the reader about the aircraft in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Soviet jet fighter {{Battle-rating}}. It was introduced in [[Update 1.31]].\n\nThe Yak-15P is arguably one of the most underestimated planes in the game. Although its statcard reveals what would be considered \"sub-par\" performance and armament, the Yak-15P is both a unique and deadly fighter. Unlike its propeller-driven counterparts, this first generation jet aircraft wields the ability to hold on to energy in a straight line, whereas prop aircraft will slowly lose speed. Holding speed coupled with its excellent rate of turn allows the Yak-15P to defend itself against both propeller and jet-powered fighters, which is what it will typically face in all game modes.\n\nThe Yak-15P's major faults include a low top speed, poor acceleration, little armour protection, and small ammunition pool which collectively make this aircraft harder to use than even other first generation jet aircraft such as the [[He 162 A-2]], the [[Meteor F Mk 3]], and the [[F-80A-5]]. Although it is driven by a jet engine, it is important to recognize the faults and oddities within this aircraft series as they are not representative of the traditional \"jet fighter\" at all. The Yak-15P is most easily viewed as a late-war [[Yak-3]] powered by a jet engine and with a different armament. The only difference between the Yak-15P and its predecessor the Yak-15 is the armament - the Yak-15P only has a single 23 mm instead of 2.\n\n== General info ==\n=== Flight performance ===\n{{Specs-Avia-Flight}}\n<!-- ''Describe how the aircraft behaves in the air. Speed, manoeuvrability, acceleration and allowable loads - these are the most important characteristics of the vehicle.'' -->\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"70%\"\n! rowspan=\"2\" | Characteristics\n! colspan=\"2\" | Max Speed<br>(km/h at 4,000 m)\n! rowspan=\"2\" | Max altitude<br>(metres)\n! colspan=\"2\" | Turn time<br>(seconds)\n! colspan=\"2\" | Rate of climb<br>(metres/second)\n! rowspan=\"2\" | Take-off run<br>(metres)\n|-\n! AB !! RB !! AB !! RB !! AB !! RB\n|-\n! Stock\n| 719 || 699 || rowspan=\"2\" | {{Specs|ceiling}} || 19.1 || 20.1 || 19.7 || 19.2 || rowspan=\"2\" | 366\n|-\n! Upgraded\n| 792 || 755 || 18.3 || 18.5 || 26.5 || 23.0\n|-\n|}\n\n==== Details ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"6\" | Features\n|-\n! Combat flaps !! Take-off flaps !! Landing flaps !! Air brakes !! Arrestor gear !! Drogue chute\n|-\n| X || X || ✓ || X || X || X     <!-- ✓ -->\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"7\" | Limits\n|-\n! rowspan=\"2\" | Wings (km/h)\n! rowspan=\"2\" | Gear (km/h)\n! colspan=\"3\" | Flaps (km/h)\n! colspan=\"2\" | Max Static G\n|-\n! Combat !! Take-off !! Landing !! + !! -\n|-\n| 750 <!-- {{Specs|destruction|body}} --> || {{Specs|destruction|gear}} || N/A || N/A || 320 || ~12 || ~9\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"4\" | Optimal velocities (km/h)\n|-\n! Ailerons !! Rudder !! Elevators !! Radiator\n|-\n| < 380 || < 420 || < 500 || N/A\n|-\n|}\n\n==== Engine performance ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! colspan=\"3\" | Engine\n! colspan=\"5\" | Aircraft mass\n|-\n! colspan=\"2\" | Engine name || Number\n! colspan=\"2\" | {{Annotation|Basic mass|Mass of the aircraft with pilot and engine oil, but no fuel or weapons load}} || colspan=\"3\" | Wing loading (full fuel)\n|-\n| colspan=\"2\" | Klimov RD-10 || 1\n| colspan=\"2\" | 2,120 kg || colspan=\"3\" | 183 kg/m<sup>2</sup>\n|-\n! colspan=\"3\" | Engine characteristics\n! colspan=\"4\" | Mass with fuel (no weapons load) || rowspan=\"2\" | {{Annotation|Max Gross<br>Weight|Mass of the fully equipped aircraft with heaviest weapons load}}\n|-\n! Weight (each) || colspan=\"2\" | Type\n! 9m fuel || 20m fuel || 30m fuel || 32m fuel\n|-\n| 760 kg || colspan=\"2\" | Axial-flow turbojet\n| 2,296 kg || 2,484 kg || 2,667 kg || 2,708 kg || 2,714 kg\n|-\n! colspan=\"3\" | {{Annotation|Maximum engine thrust @ 0 m (RB/SB)|The maximum thrust produced by each engine, while mounted in the aircraft. NOTE: Thrust varies significantly depending on speed & altitude.}}\n! colspan=\"5\" | Thrust to weight ratio @ 0 m (100%)\n|-\n! Condition || 100% || WEP\n! 9m fuel || 20m fuel || 30m fuel || 32m fuel || MGW\n|-\n| ''Stationary'' || 910 kgf || N/A\n| 0.40 || 0.37 || 0.34 || 0.34 || 0.34\n|-\n| ''Optimal'' || 910 kgf<br>(0 km/h) || N/A\n| 0.40 || 0.37 || 0.34 || 0.34 || 0.34\n|-\n|}\n\n=== Survivability and armour ===\n{{Specs-Avia-Armour}}\n<!-- ''Examine the survivability of the aircraft. Note how vulnerable the structure is and how secure the pilot is, whether the fuel tanks are armoured, etc. Describe the armour, if there is any, and also mention the vulnerability of other critical aircraft systems.'' -->\n\n* 8.5 mm Steel - armour plate behind the pilot seat\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nObtaining the \"Offensive 23 mm\" modification is the best choice as it allows for more flexibility in armament. Next, try to obtain the \"compressor\" and \"engine\" upgrades as they both increase engine thrust which is essential in escaping from a dogfight turned sour. Finally, obtain the rest of the performance upgrades as they will all collectively increase top speed, turn time, and rate of climb.\n\n== Armaments ==\n{{Specs-Avia-Armaments}}\n=== Offensive armament ===\n{{Specs-Avia-Offensive}}\n<!-- ''Describe the offensive armament of the aircraft, if any. Describe how effective the cannons and machine guns are in a battle, and also what belts or drums are better to use. If there is no offensive weaponry, delete this subsection.'' -->\n{{main|NS-23K (23 mm)}}\n\nThe '''''{{PAGENAME}}''''' is armed with:\n\n* 1 x 23 mm NS-23K cannon, nose-mounted (60 rpg)\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the aircraft, the features of using aircraft in a team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view, but instead, give the reader food for thought. Examine the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nIn Realistic battles, climbing with this aircraft at the start of a match is not always the best course of action, considering how poor the Yak-15P's rate of climb is. Instead of the traditional and slow angled climb, the Yak-15P is best used in a \"zoom climb\" where once enough energy has been built up at a low altitude the Yak-15P pilot will pitch up, thus gaining altitude quickly. This way, if attacked during the first few minutes of the match, the Yak-15P still wields some energy whereas had the Yak-15P been slowly climbing, it would have had to face another aircraft's guns. To shake an enemy, especially a prop driven enemy, dive low to the ground to ensure your assailant's speed only decreases. This dive is called a \"speed trap\" and is effective when followed by either a \"hammerhead\" attack or a continuation of the escape. This tactic of utilising the Yak-15P's ability to hold on to energy in a straight line is negated when facing other jet aircraft who wield the same ability; however, this is where the Yak-15P's dogfighting abilities come into play. Because it is so similar to the Yak-3, the Yak-15P retains some of its manoeuvrability characteristics, namely its turn time. This facet often proves an indispensable one as other first-generation jets will not be able to maintain a tight enough turn circle.\n\nHowever, the Yak-15P is '''severely''' hampered in its damage output due to its reliance on a single  23 mm NS-23K cannon, with 60 shells total. Expending this pool in seconds is possible. The Yak-15P shares this downfall with aircraft like the [[Ki-200]], and the [[Me_163_B|Me 163]]. Firing in small, accurate bursts negates this and is the most efficient way of destroying enemies. The 23 mm shells these cannons fire are extremely deadly when they hit and often rip enemies apart.\n\nTo use the guns most effectively, be close to your target. The reason for this is twofold: First, the limited ammo means you want your shots to count. Being close to your target will give your cannons the highest chance of hitting. The second reason is that of the ballistics of the 23 mm shells - their muzzle velocity is not very high, meaning you have to lead your targets by quite a bit. If you are closer to your mark, you won't have to lead them by quite as much, although still more than most other cannons.\n\nWith some practice, it is possible to consistently get about two fighter kills with one load of ammunition in realistic battles. Using the Air Targets belt is the most effective. However, attacking bombers is best left to other planes with more firepower, since the Yak-15P does not have the firepower or ammunition to kill heavy bombers without sustaining massive damage reliably. Heavy fighters such as the [[F7F-1]] may also take longer to destroy than other opponents.\n\nIn Arcade battles, the Yak-15P is capable of breaking up a \"furball\" due to its impressive turn time. The turn time coupled with its hard-hitting cannon makes any Yak-15P pilot an indispensable asset to any Arcade team.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in the bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent turn time\n* Good armament\n* Outstanding roll rate\n* Fairly responsive at higher speeds\n* Great visibility in cockpit, good for spotting\n\n'''Cons:'''\n\n* Slow for a jet fighter\n* Extremely low ammunition count\n* Poor rate of climb\n* Poor acceleration\n* Lacks bulletproof glass\n* Inability to carry suspended armament\n* Low wing rip speed for a jet fighter\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the aircraft in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n=== In-game description ===\nAn all-metal, single-seat fighter equipped with a turbojet engine.\n\nIts development started at the end of World War II, when the Soviet Union captured numerous German components, including Junkers Jumo-004 jet engines. This engine was studied in the USSR, and the Klimov OKB created a domestic counterpart under the designation RD-10. In turn, the Yakovlev OKB used the design to produce a jet fighter based on the latest version of the well-liked Yak-3.\n\nThe designers decided in favor of the pod-and-boom layout. A turbojet engine with 900 kg thrust was mounted instead of the old VK-107A piston engine. The engine was inclined so that the jet stream exited underneath the fuselage and wing. The rest of the airframe was left almost unchanged, except for an additional heat shield, made of refractory steel, located in the exhaust section. The aircraft's armament included two Nudelman-Suranov NS-23KM cannons with 60 rounds each. The cannons were housed in the forward fuselage above the engine. The new Yakovlev fighter was originally called the Yak-Jumo but later obtained the designation Yak-15.\n\nThe first flight of the Yak-15 was on April 24, 1946, and the plane was launched into full-scale production in the autumn of the same year. Production Yak-15 planes had a different engine, the RD-10, manufactured in the USSR. The service life of the earliest engines was officially claimed to be 25 hours, but in reality it was 17 hours at best. Nevertheless, the Yak-15 was very easy to pilot, and its steering was similar to that of the Yak-3, which had been the basis of its development. As a result, it was decided that although the Yak-15 did not meet the requirements of the Air Force for a modern combat fighter, it was perfectly suitable as a transition from prop to jet aircraft.\n\nIn addition to its engine's limited service life, the Yak-15 had a number of distinctive disadvantages. The most commonly encountered defects during its operation included hydraulic fluid leaks (through the sealing rings of the landing gear shock struts), the rupturing of rudder control cable threads, and the deterioration of tail wheel springs (probably caused by overheating). But the Yak-15's main disadvantage was its very short flight range.\n\nNevertheless, the significance of the Yak-15 in the history of Soviet aviation should not be underestimated. Hundreds of pilots underwent training on planes of this type, and it was the Yak-15 that became the first Soviet jet aircraft officially accepted for service in the Air Force as well as the first jet fighter that enabled military pilots to master advanced aerobatics.\n\nProduction of the Yak-15 was discontinued in 1947. In all, 280 planes were constructed.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=yak-15_early Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the aircraft;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [https://forum.warthunder.com/index.php?/topic/320875-yakovlev-yak-15/ Official data sheet - more details about the performance]\n\n{{AirManufacturer Yakovlev}}\n{{USSR jet aircraft}}"}}