{"title":"CCKW 353 (M45)","pageid":12993,"wikitext":{"*":"{{About\n| about = Chinese SPAA '''{{PAGENAME}}'''\n| usage = the other CCKW 353\n| link = CCKW 353 AA\n}}\n{{Specs-Card\n|code=cn_gmc_cckw_353_m45_quad\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese SPAA {{Battle-rating}}. It was introduced in [[Update \"Hot Tracks\"]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n\nThe CCKW 353 (M45) suffers from extremely poor survivability that is even worse than some of its SPAA counterparts at a similar BR. Armor scarcely protects the two drivers at the front, the most protection for them being the engine in front of them and the small pieces of metal \"doors\" below them. Therefore they are almost entirely exposed, and can be easily knocked out by any weapon available to the enemy. The only crew member of the vehicle with any protection to speak of is the gunner - a 12.7mm plate covering his position. It likely won't save the gunner however, as it can only protect against rifle calibers. It goes without saying critical components like engine, transmission and gun aiming drives are all poorly protected. Taking all of this into account, stay as far away from any areas receiving artillery fire as it can destroy the vehicle extremely easily. \n\n'''Armour type:''' <!-- The types of armour present on the vehicle and their general locations -->\n<!-- Example: * Rolled homogeneous armour (Front, Side, Rear, Hull roof)\n* Cast homogeneous armour (Turret, Transmission area) -->\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || ___ mm || ___ mm ''Top'' <br> ___ mm ''Bottom'' || ___ mm || ___ - ___ mm\n|-\n| Turret || ___ - ___ mm ''Turret front'' <br> ___ mm ''Gun mantlet'' || ___ - ___ mm || ___ - ___ mm || ___ - ___ mm\n|-\n| Cupola || ___ mm || ___ mm || ___ mm || ___ mm\n|-\n|}\n\n'''Notes:''' <!-- Any additional notes which the user needs to be aware of -->\n<!-- Example: * Suspension wheels are 20 mm thick, tracks are 30 mm thick, and torsion bars are 60 mm thick. -->\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=134|rbMinHp=83}}\n\nThe CCKW 353 (M45)'s mobility is average. Its top speed on hard surfaces (e.g. city road, dry dirt) is quite fast, at ~60 km/h, though it does need a few seconds to accelerate to that speed. It responds well in turns, allowing it to navigate through urban environment with relative ease.\n\nJust like every other wheeled vehicle, however, it is very sluggish on soft terrain such as snow or mud, especially when it is just starting to accelerate. Its reverse speed is poor (only -5 km/h) which is something you need to take into account when you peek out of a cover. It also has low engine power and light weight, making it very difficult to crush obstacles like metal fences, light poles or even a wooden barrel, thus you need to select the best route in a map to avoid driving into similar obstacles scattered on the streets, usually urban maps have a lot of them. In wild maps, select the route that allows you to drive on roads as much as possible, whether it be a concrete road or a dirt path. \n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n# Parts is recommended to be researched first. Although this SPAA is fragile and seems to not be able to survive any damaging hits, its modules (e.g. transmission, turret drives) are actually frequently damaged by bullets, shrapnels, and over-penetrations without destroying the vehicle. Thus it is crucial to be able to repair them.\n# Horizontal drive. It is important to be able to keep your guns on target when fighting aircraft, or to quickly swing them away from the drivers when encountering tanks.\n# API belt. The default belt is already potent against ground and air targets, so the API belt doesn't have to be researched first. It adds an admirable incendiary ability to the bullets, allowing you to more frequently set aircraft aflame.\n# Mobility modifications. They help the CCKW 353 (M45) to drive faster.\n# Other modules.\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|M2HB (12.7 mm)}}\n\nThe firepower of the CCKW 353 (M45) is very effective, but only if it is against aircraft and lightly armoured ground vehicles. The 4 x 12.7 mm M2 have adequate fire rate and great fire density, consistent trajectories and good shell velocity, which makes it fairly easy to lead an aerial target and score constant hits. A few hits can usually damage components like cooling systems and skin, but if you are luck enough you may snipe the pilot. In a head-on with an aircraft, the 12.7 mm AP bullets can go through the armour plates on aircraft around this BR, and reach anything behind. The bullets are also great at setting fuel tanks on fire.\n\nAgainst ground targets, your only targets are wheeled vehicles (e.g. [[Sd.Kfz.234/2]]), SPAA (e.g. [[M16 MGMC]]) and certain light tanks (e.g. [[A13 (Family)|A13]]). The great fire density of the bullets can easily wipe out multiple crew members immediately upon penetrations. However common tanks (e.g. [[Pz.IV C]], [[M3A3 (Italy)|M3A3]]) are very hard if not impossible to penetrate frontally or even from their side.\n\nThe traverse/elevation speed of the gun mount is quite fast, and has great elevation & depression angles of -10/+90 degrees, allowing the player to track fast targets or to combat in hilly battlefield well.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"6\" | [[M2HB (12.7 mm)|12.7 mm M2HB]] (x4) || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 3,200 (200) || rowspan=\"2\" | 576 || rowspan=\"2\" | -10°/+90° || rowspan=\"2\" | ±180° || rowspan=\"2\" | N/A || 52.8 || 73.1 || 88.8 || 98.2 || 104.5 || rowspan=\"2\" | 18.20 || rowspan=\"2\" | 16.10 || rowspan=\"2\" | 14.84 || rowspan=\"2\" | 14.00\n|-\n! ''Realistic''\n| 35.7 || 42.0 || 51.0 || 56.4 || 60.0\n|-\n|}\n\n==== Ammunition ====\n\n* '''Common:''' {{Annotation|API-T|M20 armour-piercing incendiary tracer}}{{-}}{{Annotation|I|M1 incendiary}}{{-}}{{Annotation|AP|M2 armour-piercing}}{{-}}{{Annotation|API-T|M20 armour-piercing incendiary tracer}}: These rounds work well until the others are researched.\n* '''API:''' {{Annotation|API-T|M20 armour-piercing incendiary tracer}}{{-}}{{Annotation|AP-I|M8 armour-piercing incendiary}}{{-}}{{Annotation|API-T|M20 armour-piercing incendiary tracer}}: These are absolutely devastating in the AA role with slightly less performance against enemy tanks than AP.\n* '''AP:''' {{Annotation|AP|M2 armour-piercing}}{{-}}{{Annotation|AP|M2 armour-piercing}}{{-}}{{Annotation|API-T|M20 armour-piercing incendiary tracer}}: These are best against enemy tanks at close range and do good damage to planes.\n* '''APIT:''' {{Annotation|API-T|M20 armour-piercing incendiary tracer}}: Better than API in all regards but not as good against tanks as AP, this is the belt of choice in almost all situations. Since every bullet is a tracer, it makes destroying aircraft much easier and detectability is not greatly increased over AP-I, however is increased a bit over AP.\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"7\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Belt\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| Common || 31 || 30 || 26 || 22 || 18 || 15\n|-\n| API || 30 || 29 || 24 || 20 || 16 || 13\n|-\n| AP || 31 || 30 || 26 || 22 || 18 || 15\n|-\n| APIT || 30 || 29 || 24 || 20 || 16 || 13\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Belt details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Belt\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| APIT || API-T || 929 || 0.04 || N/A || N/A || N/A || 47° || 56° || 65°\n|-\n|}\n\n==== [[Ammo racks]] ====\n<!-- [[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]] -->\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''16''' || __&nbsp;''(+__)'' || __&nbsp;''(+__)'' || __&nbsp;''(+__)'' || __&nbsp;''(+__)'' || __&nbsp;''(+__)'' || __&nbsp;''(+__)'' || __\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nIt is not recommended to bring out the CCKW 353 at the very start, because unlike certain SPAAs, this truck is not fast.\n\nFor anti-air duty, find a spot somewhere between a friendly spawn and a cap point. This way you can react to unexpected situations effectively: if frontline teammates collapse, you can quickly retreat to spawn; if teammates advance, you can also keep up easily. Do not stay too close to the frontline, as you do not want to face enemy tanks. Unlike the similar [[M16 MGMC]] which can resist rifle-calibre bullets, the CCKW 353 does not offer any protection to anything, therefore to protect the two exposed drivers, you will want to find a hard cover, point the truck sideways to only expose the back turret and hide the drivers behind cover. This way strafing planes cannot hurt the drivers, increasing your survivability. Once enemy aircraft spawn, shoot sparse salvos towards them to draw their attention. Do not fire continuously yet, disguise yourself as a slow-firing SPAA (e.g. [[Sd.Kfz. 6/2]]) which is less fearsome in the minds of pilots. Upon seeing your tracers, most pilots might choose to go for a head-on with you, knowing that most SPAAs are easy targets. As they dive towards you, fire a long burst and lay a stream of bullets in their flight path, remember to also aim up a little. A few hits from the .50 cals is enough to damage critical components such as cooling systems, control surfaces or even pilots. Keep firing prolonged bursts even when the target aircraft bank away, as they are now low and slow. If a plane drops bombs at you, immediately move back to cover. If the CCKW 353 is used with the 3.7 lineup, be way more careful since aircraft around this BR have either cannons or numerous MGs comparing to the ones around 2.0, and the increased fire density is very fatal for the exposed crew.\n\nWatch out for remaining ammunition. The CCKW 353 has 200 rounds each gun but reloading is very slow, making the CCKW 353 and the team vulnerable in the worst moments. Total ammunition of less than 130 rounds should be emptied and reloaded with full magazines.\n\nFor anti tank duty, only target the ones you can penetrate, including armoured cars, SPAAs, light tanks, tank destroyers, etc. With the quad .50 cals it is very easy to wipe out these targets with a short burst. Against tanks, you are very much defenceless but if you are in a safe position, shoot at their tracks or gun barrels. Although this might not damage anything, the hits will grant you assists when they are killed by your teammates. Note: always face the side of the truck towards the direction where enemies are most likely to appear, since the CCKW cannot aim directly forwards.\n\nRelocate immediately if the red \"artillery fire\" notification flashes. Shrapnel from nearby explosions can badly damage the truck's tires, transmission and crew.\n\n=== Enemies worth noting: ===\n\n* [[Staghound AA]]: this SPAA may look fragile at a glance as it has a small turret and are wheeled. But it is actually quite strong in terms of armour: its frontal hull glacis is sloped 22 mm armour, and the turret is all-round 31 mm meaning the CCKW 353 will have no chance of penetrating it in those areas. It also has similar speed, faster reverse, and no firing obstruction unlike the CCKW 353. The CCKW 353 can frontally penetrate it on the unsloped driver's port which is only 15 mm thick, or shoot the gunner whose face is exposed behind a crack on the gun shield. You must act quick since you need to aim for weak spots and perhaps turn your truck around so the drivers don't obstruct your guns, while this SPAA can just shoot anywhere at you and cripple the truck very quickly. \n* [[M3 Stuart (Family)|M3]]/[[M5 Stuart (Family)|M5]]: the Stuart light tanks are very fast and agile. They can usually get to positions very fast with their great on and off road speed, meaning they are usually the flankers on the battlefield. A good way to avoid encountering them is to stay around friendly points and teammates so you are covered. If you have to fight a Stuart, know that your quad M2 Browning cannot penetrate their frontal hull and turret armour which have ~50 mm of effective thickness. So the only viable way to destroy them is from the sides or rear where the armour is around 25-28 mm, which is penetrable if you get within 100 m. Be careful though, as they are more agile than the CCKW 353 and has superior firepower. Their 37 mm cannon might overpenetrate the truck, but they still have 2 x 7.62 mm MGs that can easily knock out the unprotected crew of the CCKW 353. \n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Powerful quad .50 cals that can shred planes with well-aimed bursts within 1 km, and have a good chance of setting aircraft on fire\n* AP shells are powerful enough to damage or even destroy enemy light tanks and other SPAAs such as LVT (A)s, and [[Flakpanzer I]]\n* .50 cal bullets have nicer velocity and accuracy than some cannons\n* Nice vertical traverse of -10/+90 degrees, giving it great terrain adaptation\n* Large ammo capacity, each magazine holds 200 rounds, allowing for prolonged firing\n* Fast on flat ground or on road\n* Good acceleration on hard surface\n* Fast turret traverse allows following aircraft easily\n* Due to its lower gun mount, it is a lower target comparing to the similar M16 MGMC\n* Is a narrow vehicle, can squeeze into tight spots\n\n'''Cons:'''\n\n* Extremely low survivability: the truck provides absolutely no protection to the crew, even against light MG, nearby bombs, artillery strikes, let alone cannon shells\n* Open topped design makes it vulnerable to strafing planes, especially cannon-armed ones such as [[He 112 A-0]]\n* Guns cannot depress and aim towards the front as they are obstructed by the driving compartment. This can be lethal in a frontal encounter\n* Cannot hurt conventional armoured vehicles like M3 Stuart due to its low penetration\n* Awful mobility on muddy, snowy and desert areas, for example in White Fortress, [[Frozen Pass (Ground Forces)|Frozen Pass]] and [[Sinai]]\n* Long reload time of around 15 seconds makes it defenceless for a long time in an intense battle\n* Engine catches fire easily when hit\n* No weight to pull: Towing or pushing allies is nearly impossible unless it is a lighter vehicle\n* Only 1 spare crew member\n* Cannot turn on the spot, as it is fully wheeled\n* Entire crew is exposed; a plane ramming you can knock out the crew\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe GMC CCKW-353 was a 2 1/2 ton six-axle truck operated by the US and other Allied forces during WW2. It was the second most produced US truck, with only the MB Willy Jeep beating it in production numbers. The CCKW series as a whole had a wide array of variants and models produced, with over 520,000 units produced between 1940 and 1946. The Republic of China specifically would have the open cab CCKW-353 variant used in a wide variety of roles, from general transport, artillery towing, and fuel trucks, to mounting the M45 Quadmount in the rear bed as a SPAAG. The M45 Quadmount was a powered turret containing four 12.7 mm M2 Browning machine guns and was introduced in 1943. The M45 was most commonly found mounted on dedicated SPAAG platforms like the [[M16 MGMC|M16]] and M17 halftracks, or the M51 and M55 towed trailers. The M45 could be mounted anywhere including truck beds, trailers, and static positions. Both the CCKW and the M45's service in the Republic of China is undocumented, and it is likely that both were received during, or shortly after WW2. The CCKW-353 was at least seen mounting the M45 in its bed during the 1961 National Day parade. The CCKW was likely phased out by the M35 2 1/2 ton truck during the mid to late 1960's, while the M45 was phased out of service by the T-81 20 mm anti-aircraft gun in the 1980s. It is not known if the M45 or the T-81 has been mounted on the bed of the M35 2 1/2 ton truck in ROCA service.<ref>https://forum.warthunder.com/index.php?/topic/470621-gmc-cckw-353-2-12-ton-truck-with-m45-quadmount-republic-of-china/</ref>\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=cn_gmc_cckw_353_m45_quad Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n* [[M16 MGMC]]\n* [[CCKW 353 AA]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n=== References ===\n<references />\n\n{{TankManufacturer GM}}\n{{China anti-aircraft vehicles}}\n[[Category:Wheeled ground vehicles]]"}}