{"title":"Centurion Mk 3","pageid":1007,"wikitext":{"*":"{{About\n|about = British medium tank '''{{PAGENAME}}'''\n|usage = other versions\n|link = Centurion (Family)\n}}\n{{Specs-Card\n|code=uk_centurion_mk_3\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} British medium tank {{Battle-rating}}. It was released along with the entire British tree line in [[Update 1.55 \"Royal Armour\"]]. The Centurion boasts relatively strong sloped front armour, decent mobility, and a powerful [[Ordnance_QF_20-pounder_Mk.I_(84_mm)|20-pounder cannon]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n'''Armour type:'''\n\n* Rolled homogeneous armour (Hull, Turret roof)\n* Cast homogeneous armour (Turret)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 76.2 mm (58°) ''Front glacis'' <br> 76.2 mm (47-48°) ''Lower glacis'' || 50.8 (12°) + 6 mm || 38 mm (8-12°) || 29 mm <br> 8-14 mm ''Engine deck''\n|-\n| Turret || 152 mm (6-27°) ''Turret front'' <br> 152 mm ''Gun mantlet'' || 89 mm (5-12°) || 89 mm (1-18°) || 50.8 mm ''Border of turret'' <br /> 29 mm ''Center of turret''\n|-\n| Cupola || 152 mm || colspan=\"2\" style=\"text-align:center\" | 90 mm || 29 mm\n|-\n|}\n'''Notes:'''\n\n* Tracks and suspension wheels are both 20 mm thick.\n* The steel boxes around the turret and hull give a 4 mm additional protection, though this seems to be a negligible addition.\n* Spaced armour plates are placed on the side of the Centurion, giving an additional 6 mm of side armour.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp= 1007|rbMinHp= 575}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|20pdr OQF Mk.I (84 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[20pdr OQF Mk.I (84 mm)|84 mm 20pdr OQF Mk.I]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 65 || rowspan=\"2\" | -10°/+20° || rowspan=\"2\" | ±180° || rowspan=\"2\" | Two-plane || 19.04 || 26.35 || 32.00 || 35.39 || 37.65 || rowspan=\"2\" | 8.19 || rowspan=\"2\" | 7.25 || rowspan=\"2\" | 6.68 || rowspan=\"2\" | 6.30\n|-\n! ''Realistic''\n| 11.90 || 14.00 || 17.00 || 18.80 || 20.00\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| Shot Mk.1 || APCBC || 232 || 229 || 216 || 201 || 187 || 173\n|-\n| Shot Mk.3 || APDS || 285 || 283 || 262 || 239 || 218 || 198\n|-\n| Shell Mk.1 || HE || 15 || 15 || 15 || 15 || 15 || 15\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| Shot Mk.1 || APCBC || 1,000 || 9.1 || N/A || N/A || N/A || 48° || 63° || 71°\n|-\n| Shot Mk.3 || APDS || 1,400 || 3.2 || N/A || N/A || N/A || 75° || 78° || 80°\n|-\n| Shell Mk.1 || HE || 600 || 7.5 || 0 || 0.1 || 1,130 || 79° || 80° || 81°\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"7\" | Smoke shell characteristics\n|-\n! Ammunition\n! Velocity<br>(m/s)\n! Projectile<br>Mass (kg)\n! Screen radius<br>(m)\n! Screen deploy time<br>(s)\n! Screen hold time<br>(s)\n! Explosive Mass<br>(TNT equivalent) (g)\n|-\n| 20pdr Shell SS Mk.1 || 250 || 9.3 || 13 || 5 || 20 || 50\n|-\n|}\n\n==== [[Ammo racks]] ====\n<!-- '''Last updated: 2.7.0.68''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! 7th<br>rack empty\n! 8th<br>rack empty\n! 9th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''65''' || 63&nbsp;''(+2)'' || 61&nbsp;''(+4)'' || 53&nbsp;''(+12)'' || 45&nbsp;''(+20)'' || 37&nbsp;''(+28)'' || 29&nbsp;''(+36)'' || 9&nbsp;''(+56)'' || 5&nbsp;''(+60)'' || 1&nbsp;''(+64)''  || No\n|-\n|}\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n'''Notes''':\n\n* Shells are modeled individually and disappear after having been shot or loaded.\n* Racks 8 and 9 are first stage ammo racks. They total 8 shells and get filled first when loading up the tank.\n* These racks are also emptied early: the rack depletion order at full capacity is: 8 - 9 - 1 - 2 - etc. until 7.\n* If you pack 29&nbsp;''(+36)'' shells, it will keep most of the hull empty of ammo.\n* Simply not firing when the gun is loaded will move ammo from racks 1-7 into racks 9 then 8. Firing will interrupt the restocking of the ready racks.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|BESA (7.92 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[BESA (7.92 mm)|7.92 mm BESA]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 3,600 (225) || 600 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe Centurion Mk. 3 is an effective medium tank if played to its strengths. If one wants to keep it simple, just use the powerful gun to snipe from distance. More advanced tankers can utilize the not too impressive max speed (35 km/h / 22 mph) to move with this medium tank into the flanks of enemy tanks (close to the border of a map) and search for positions like hills and ridges where one can make use of the amazing -10° gun depression to hide the vulnerable lower plate of this tank. Once in such a position, one should use the binoculars to scout for enemies without exposing the turret. If an enemy tank is spotted that could be a potential threat (dangerous tank / faced towards you) pop out a little bit and start to take out the enemies gunner/cannon barrel/cannon breech to prevent him from returning fire. Now utilize the quick reload to take out one crew member after the other to finish your opponent. If an enemy is spotted who is exposing their side or even the rear while not aiming towards you, shoot the engine first to immobilize and possibly even ignite the enemy tank, preventing him to take cover. The next shots should again disable the gun of the enemy, now finish your prey by shooting all crew members or if you feel lucky shoot an ammo rack.\n\nThe best choice to pierce enemy tanks is obviously the Shot Mk.3 (APDS) although it does somewhat less damage after penetrating. The Shot Mk.1 (APCBC) works in most situations as well but lacks penetration compared to the Mk.3 APDS shot. The amazing penetration characteristics of this APDS shot enables this gun to pierce front plates of all Panther models (apart from the Panther II) to ranges up to 2,000 m. T-44s and Panther IIs front plates can be penetrated to ranges up to almost 1,000 m. Keep in mind though that the front plate of the T-44 is angled at 60°, so it bounces even this powerful APDS shot quite often. Even the front plate of the mighty Tiger II is not able to stop this APDS shot if not angled and the range is shorter than 100 m.\n\nIn a head to head situation with an enemy tank approaching try to angle the centurion not more than 5° degrees to either side since the side armour is quite weak (50.8 mm), try to hide your lower front plate which is a massive weak spot, while reloading turn the turret 10° to the right to maximize chances of bouncing shots (right side of the turret front has some extra armour) and keeping the gunner alive.\n\nWhen rounding a corner, it is best to only expose your frontal armour. Approach the corner at an angle to prevent your enemies from seeing your sides. When angled, the upper front plate will be able to resist or bounce most shells. This, in combination with your stabilizer, will allow you to get the drop on unsuspecting enemies in urban settings.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Powerful and high penetrating gun, stock round is adequate enough to deal with other vehicle it faces and APDS can punch through anything it will face.\n* Has a base reload time of 8.1 seconds, which can be lowered further into around 7.4 seconds (which is on average 2 seconds faster than its competitors).\n* Excellent gun angles\n* Strong gun mantlet.\n* Neutral steering, can turn on the spot without having to switch into gear 1.\n* Good manoeuvrability.\n* Good reverse speed.\n* Gun stabilizer.\n* Turret roof armour is resistant to aircraft guns.\n\n'''Cons:'''\n\n* Low top speed.\n* Ammo rack in the front, penetration through the lower glacis will likely ends up destroying or detonating the ammo rack.\n* Top armour covering the engine compartments is not improved from the [[Centurion Mk 1|Mk 1]], still 8 mm which can be penetrated by most aircraft guns.\n* Small internal compartment (only 4 crew members), easy to one shot.\n* APDS shot causes only punctual damage (aim carefully).\n* No explosive filler on any AP shells.\n* Weak side armour, do not angle the hull too much.\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n{{main|Centurion_Mk_1#History|l1=History of the Centurion Mk 1}}\n\n===Development===\nThe tank's concept was made in 1943 when the Directorate of Tank Design, under Sir Claude Gibb, was asked to produce a new heavy cruiser tank for the General Staff under the designation ''A41'', which was to become the standard of a British \"Universal Tank\" to replace the separated \"infantry\" and \"cruiser\" tanks currently used. As World War II progressed and the Germans unveiled their heavier tanks with an [[KwK 36 (88 mm)|88 mm cannon]] like the [[Tiger H1|Tiger]], War Office made a revision to their design requirements to counter this threat. The requirements now include an increased durability and reliability, with the ability to protect itself against the 88 mm gun and mines, an agility similar to the [[Comet I|Comet tank]] and with good reverse speed, all while staying under a 40 ton weight.\n\nResponding to these requirements, the department developed a larger hulls by adapting the suspension on the Comet, lengthening with another road wheel and spacing between the wheels. The standard Christie suspension used on the previous cruiser tanks was replaced by the Horstmann suspension, which uses coil springs on two-wheel bogies on each side and is proven to be easier to maintain than the Christie suspension. The hull used a welded and sloped armour with a cast turret mounting the famous [[Ordnance QF 17-pounder (76 mm)|17-pounder cannon]]. The speed of the tank would be established by using the Rolls Meteor engine previously used on the Comet and [[Cromwell V|Cromwell]]. Despite these changes, the department concluded that the weight restriction would not allow the tank design to withstand the 88 mm rounds. The weight restriction was done so the tank would be able to be carried around in the Mk.I and Mk.II transport trailers, which had a 40-ton load. This restriction was rescinded to allow more freedom in the tank design, which showed potential to War Ministry. The heavier tank designs developed had armour equivalent to the heaviest infantry tanks like the [[Churchill Mk VII|Churchill tank]], yet with superior cross-country mobility due to improved suspension and engines.\n\nThe tank was given the name '''Centurion''' and the first mock-ups of the design was made by AEC and was presented in May 1944. After that, 20 pilot models were ordered with a various armament combinations. Ten had a 17-pounder and a 20 mm Polsten gun (5 with a machine gun in turret rear, 5 with an escape door instead), five had a 17-pounder and a BESA machine gun and an escape door, five more with the 77 mm HV gun with a driver operated hull machine gun. The prototypes of the 40-ton design, the Mk.1, had a 76 mm armour on the front glacis, which was made very powerful with the heavy sloping design on the tank. Added with a 152 mm thick turret armour, the Centurion became a very protected tank design, yet it was also very agile, outperforming the Comet tank in tests. The next Centurion model, Mk.2, featured a much thicker 118 mm front glacis armour and a thicker side armour. Production began for the Centurion Mk.2 in November 1945 for 800 tanks from Leyland Motors, Royal Ordnance Factories, and Vickers. The Mk.2 was put into service in the 5th Royal Tank Regiment in December 1946.\n\nAfter the Centurion Mk.2 was put into service, Royal Ordnance developed the successor to the 17-pounder, the [[Ordnance QF 20-pounder Mk.I (84 mm)|84 mm 20-pounder]]. With this, the Centurion went through another upgrade to mount the 20-pounder. The 20 mm Polsten gun was removed and replaced by a BESA gun due to its questionable utility. The new upgrade, now the [[Centurion Mk 3]], also featured an automatic stabilization system that improved firing accuracy while on the move. The tank was first produced in 1948 and overtook the previous Mk.1 and Mk.2 in service. However, the 20-pounder also did not stay in service for long and were replaced by the more powerful [[L7A1 (105 mm)|105 mm L7 gun]] from Royal Ordnance Factories. All Centurions versions after Mark 5/2 used the L7 gun, including the [[Centurion Mk 10]], which also featured additional armour with the new gun.\n\n===Combat usage===\nThe Centurion first saw combat in the Korean war in 1950 in the British 8th King's Royal Irish Hussars. The Centurion Mk.3 issued to them had to be cared for in the winter conditions of Korea. Steps such as parking the tank on straw, starting the engine every half-hour, and keeping the gear engaged has to be done to keep the tank from becoming frozen in place. The Centurions made a great impact in the battlefield, covering the withdrawal of the 29th Brigade. In 1953, the Centurion saw part in the battle of the Hook in the 1st Royal Tank Regiment, repelling the swarming Chinese infantry. General John O'Daniel from the US 1st Corps praised the Centurion's mobility throughout the mountain terrains.\n\nAfter the Korean War, the Centurions saw service again during the Vietnam War in the Royal Australian Armoured Corps after complaints were made on the thin armour of their armoured vehicles. The Centurions landed on 28 February 1968. Headed by Colonel Donald Dunstan, he ordered the Centurions to reinforce firebases at Coral and Balmoral. The use of the Centurions by the 1st Australian Task Force helped them in the Battle of Coral-Balmoral that caused massive casualties in two infantry regiments among the enemy with no known tank losses. After the battle, more Centurions landed into Vietnam, with a total of 58 Centurions in the country at once in the span of three and a half years. In this time period, 42 suffered damages, two were written off, and two crewmen were killed in action.\n\nThe Centurions also made up the bulk of India's tank forces, to which they used against Pakistan in the conflicts that occur in 1965 and 1971. In the middle east, the Centurions were supplied to Israel and Jordan in the 1950s. At the time of the Six-Day war, Israel had 293 Centurion tanks and Jordan had 90 Centurions. Both countries used the Centurions against each other in the war. Sometime in early 1970s, the Centurions on both side were upgraded with the 105 mm L7 gun. Both Jordan and Israel used the Centurion again in the 1973 Yom Kippur War, where the Israel establish the Centurion's prowess in battle during the Battle of Golan Heights, where 100 or so Centurions are able to beat back 500 or more Syrian [[T-54 (1951)|T-55]] and T-62 tanks. While the Centurion still see use in Jordan today, the Centurions in Israel were retired in the 1990s, only staying as armour personnel carriers and armour recovery vehicles. In the middle east, the British used the Centurions again during the 1991 Gulf War against Iraq, though only as an AVRE in the 32 Armoured Engineer Regiment. Three were lost in training incidents with no deaths among the crew.\n\nSweden and South Africa also used the Centurions, buying them from Britain after World War II. The Centurions in South Africa were retained and upgraded due to their superiority over anything their neighbors had at the time, with a focus on the upgrade to the 105 mm gun and belly armour to protect itself against mines. Sweden bought the Centurions in an attempt to standardize their tank forces as it was the most cost-effective method, plus the Centurions have a huge upgrade potential to counter future threats. The British offered to sell the Centurion in late 1952, to which 80 were ordered by Sweden. The first deliveries were made in April 1953, followed by more orders and more deliveries until about 350 Centurion tanks ranging from Mk.3, Mk.5, and Mk.10 were in Sweden. The Swedish military used the Centurions until 1990s, modernizing the tanks with upgrades in equipment and internal mechanics. They replaced the Centurions with [[Leopard 2A4|Leopard 2s]].\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=uk_centurion_mk_3 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|bJULfPFytPE|'''{{PAGENAME}} - Hull Down Flanker''' - ''Napalmratte''|90Ym2RDKoJM|'''For Queen and Country - {{PAGENAME}}''' - ''Virus''|BETv276JmXE|'''{{PAGENAME}} Tank Review''' - ''NUSensei''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wikipedia:Centurion (tank)|[Wikipedia] Centurion]]\n* [https://tanks-encyclopedia.com/coldwar/UK/FV-4200_Centurion <nowiki>[Tanks Encyclopedia]</nowiki> FV4007 Centurion]\n\n{{TankManufacturer Department of Tank Design}}\n{{Britain medium tanks}}"}}