{"title":"Centauro I 105 R","pageid":4054,"wikitext":{"*":"{{About\n| about = Italian light tank '''{{PAGENAME}}'''\n| usage = other versions\n| link = Centauro (Family)\n}}\n{{Specs-Card\n|code=it_b1_centauro_romor\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Italian light tank {{Battle-rating}}. It was introduced in [[Update 1.85 \"Supersonic\"]].\n\nThe {{PAGENAME}} is a variant of the [[Centauro I 105]], but with the addition of ROMOR-A ERA present on the hull and turret. It is also known as the Centauro ROMOR.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\nThe Centauro I 105 R, like its B1 base variant, prioritizes speed and mobility at the expense of armour and protection. It tries to rectify the lack of armour through angling of armour plates and the ROMOR-A ERA. The hull is a high-hardness monocoque fashioned from rolled homogeneous armour of varying thicknesses depending of the plate. The turret is very much the same as the hull, with a low profile cupola for both the gunner and commander. Additionally, the turret has 15 mm of rolled homogeneous armour added to the top of the turret, increasing total thickness to roughly 30 mm of armour on the roof. The driver is separated from the engine via an 8 mm thick partition. This partition, if penetrated, will create extra internal shrapnel. The position of the radiator directly below the upper front plate adds extra protection as it has a chance of absorbing or bouncing kinetic penetrators.\n\nThe main feature which separates the ROMOR from the base B1 Centauro is obviously the addition of ROMOR-A ERA, which has increased protection again chemical weapons. The ERA is bolted to the turret cheeks/sides and the sides of the chassis. There are significantly more panels on the left side of the hull and right side of the turret. The ERA, which is a reactive element sandwiched between 2 metal plates, offers 30mm of protection against kinetic rounds and 300 mm against chemical rounds. Despite the armour and the addition of the ERA, the Centauro I 105 R can only effectively stop rounds up to a diameter of 14.5 mm. Most chemical rounds at the rank with a diameter greater than 100 mm will knock out the Centauro in one shot due to the [[Damage mechanics#Overpressure|overpressure damage]].\n\n'''Armour type:'''\n\n* Rolled Homogeneous Armor - Main\n* ROMOR-A - ERA\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 15 mm (80°) ''Upper Glacis'' <br> 35 mm (45°) ''Lower Glacis'' || 25 mm || 20 mm || 10 - 20 mm\n|-\n| Turret ||25 mm (19°) ''Turret front'' <br> 40 mm (6°-56°) ''Gun mantlet'' || 25 mm || 15+15 mm ''Left section'' <br> 15 mm ''Right section'' || 15 + 15 mm ''Front'' <br> 15 mm ''Rear''\n|-\n|}\n'''Notes:'''\n\n* The wheels and suspension bars are 10 mm thick.\n*The rear of the turret is covered with 5 mm of structural steel.\n* There are also interior 8 mm armour plates between the engine and the crew compartment.\n* The driver viewport is a weak spot as it is the only place where the inner armour does not overlap with the external armour. It is a small spot though.\n* ROMOR-A has protection against 30 mm of kinetic rounds and 300 mm against chemical rounds.\n* The ROMOR-A ERA does not cover the entire sides of the hull and turret, only significant portions:\n\n{| class=\"wikitable\"\n|-\n! Additional armour !! Front (Slope angle) !! Sides !! Rear\n|-\n| Hull || N/A || 10 mm + ROMOR-A ERA Rear ''Hull Sides'' || 20 mm ''Hull Rear''\n|-\n| Turret || 10 mm + ROMOR-A ERA ''Turret Cheeks'' || 10 mm + ROMOR-A ERA ''Turret Sides'' || 5 mm ''Turret Rear''\n|-\n|}\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=806|rbMinHp=460}}\n\nThe {{PAGENAME}} has an advanced powertrain and engine system. The vehicle is powered by an IVECO 8662 Turbocharged V6 aftercooled diesel engine mated to an automatic transmission with five forward gears and 2 reverse gears. In-game it provides 460 HP at 2400 RPM stock and 520 HP at 2400 RPM fully upgraded. The drivetrain is single differential twin shaft design in an H-style configuration. This system allows the Centauro I 105 R to reach a speed of up to 110 km/h on roads and solid surfaces. On more difficult terrain like snow, mud, and sand, the speed and acceleration of the Centauro are decreased drastically due to a loss of traction. Each wheel on the Centauro is independently suspended via hydro-pneumatic suspension which provides a smooth ride for the crew and allows the gun to maintain stability even at high speeds over rough terrain. All wheels are equipped with disc brakes which allow the Centauro to decrease speed quickly and get gun on target. While steering, the first, second and fourth wheel turn according to input. This allows for a tight turn radius of 9 m. These features give the Centauro the ability to move quickly and fire accurately on the move, often surprising unsuspecting enemies.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' The text within these arrows are not to be deleted -->\n{{main|OTO Melara 105/52 (105 mm)}}\n\nThe {{PAGENAME}} is equipped with the mean 105 mm OTO-Melara 105/52 with a two-plane stabiliser. The cannon is similar to other NATO-style 105 mm cannons like the L7A3 found on German vehicles and the American M68. A such, it fires standard NATO ammunition like M456 HEAT-FS. In comparison to the previous model of the Centauro, the {{PAGENAME}} fields APFSDS rounds, an all-new round for the AFV. While the HEAT-FS can penetrate most vehicles, the APFSDS rounds are a sure bet to destroy almost any tank. The kinetic rounds are basically guaranteed to penetrate or one-shot any tank that may be seen at 9.0. Depending on the round fired, the round has very little to no bullet drop. The gun is accurate and easy to aim. Though the cannon may be lacking slightly in depression, the effectiveness of the gun more than makes up for it.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[OTO Melara 105/52 (105 mm)|105 mm OTO Melara 105/52]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 40 || rowspan=\"2\" | -6°/+16° || rowspan=\"2\" | ±180° || rowspan=\"2\" | Two-plane || 21.7 || 30.0 || 36.5 || 40.3 || 42.9 || rowspan=\"2\" | 8.71 || rowspan=\"2\" | 7.70 || rowspan=\"2\" | 7.10 || rowspan=\"2\" | 6.70\n|-\n! ''Realistic''\n| 13.6 || 16.0 || 19.4 || 21.4 || 22.8\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| M456 || HEATFS || 400 || 400 || 400 || 400 || 400 || 400\n|-\n| M393A2 || HESH || 127 || 127 || 127 || 127 || 127 || 127\n|-\n| M735 || APFSDS || 353 || 350 || 342 || 333 || 322 || 312\n|-\n| DM33 || APFSDS || 408 || 405 || 398 || 389 || 379 || 370\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| M456 || HEATFS || 1,173 || 10.5 || 0.05 || 0.1 || 1,270 || 65° || 72° || 77°\n|-\n| M393A2 || HESH || 732 || 14.85 || 0.1 || 4 || 4,310 || 73° || 77° || 80°\n|-\n| M735 || APFSDS || 1,501 || 3.7 || N/A || N/A || N/A || 76° || 77° || 80°\n|-\n| DM33 || APFSDS || 1,455 || 3.79 || N/A || N/A || N/A || 78° || 80° || 81°\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"7\" | Smoke shell characteristics\n|-\n! Ammunition\n! Velocity<br>(m/s)\n! Projectile<br>Mass (kg)\n! Screen radius<br>(m)\n! Screen deploy time<br>(s)\n! Screen hold time<br>(s)\n! Explosive Mass<br>(TNT equivalent) (g)\n|-\n| M416 || 730 || 11.4 || 20 || 5 || 25 || 50\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_Centauro.jpg|right|thumb|x250px|[[Ammo racks]] of the [[Centauro I 105]] (identical).]]\n<!-- '''Last updated: 1.101.1.33''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''40''' || 29&nbsp;''(+11)'' || 17&nbsp;''(+23)'' || 12&nbsp;''(+28)'' || 1&nbsp;''(+39)''|| No\n|-\n|}\nNotes:\n\n* Shells are modeled individually and disappear after having been shot or loaded.\n* Racks 3 and 4 are first stage ammo racks. They totals 16 shells and get filled first when loading up the tank.\n* These racks are also emptied early: the rack depletion order at full capacity is: 4 - 3 - 1 - 2.\n* Simply not firing when the gun is loaded will move ammo from racks 1-2 into rack 4 then 3. Firing will interrupt the restocking of the ready racks.\n\nThe {{PAGENAME}} has four ammo racks. Two are located in the rear of the hull while one ready rack is in the rear of the turret and the other ready rack on the right side of the gunner. None of them is in wet storage or has blowout panels. If the ammo is hit by a penetrating shot, it has a high chance of exploding and killing all your turret crew.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n{{Specs-Tank-Weapon|3}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|Beretta MG42/59 (7.62 mm)}}\n\nThe Centauro I 105 R is equipped with two 7.62 mm Beretta MG42/59 machine guns with a high rate of fire. One machine gun is coaxial and operates on the same axes as the main cannon. The other machine gun is mounted to the left of the commander's cupola and moves independently from the rest of the turret. This gives it 360-degrees of rotation. These machine guns can sometimes be effective against helicopters and slow-moving planes, but a large number of bullets are required to take down these targets. Otherwise, the machine guns are ineffective against armoured targets such as enemy tanks and IFVs. They can be used to take down foliage and light obstructions in order to clean lines of travel or sight. If fired at an enemy turret it has the potential to obscure the gunner's view, making it harder for the enemy to shoot you. Otherwise, the machine guns are unremarkable.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[Beretta MG42/59 (7.62 mm)|7.62 mm Beretta MG42/59]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 4,500 (200) || 1,200 || N/A || N/A\n|-\n| Pintle || 2,000 (200) || 1,200 || -8°/+20° || ±120°\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe Centauro's wheeled configuration offers a highly mobile anti-tank gameplay. Though this movement flexibility comes with the loss of armour protection, hence the preferred gameplay tactics of the Centauro's commander should be based on speedy stealth flanking strikes or reconnaissance (scouting) with a sharp emphasis on sniping.\n\nThis focus on the sniper role is because the vehicle is fast. The ERA might protect against this, however, it is not completely reliable so avoiding a hit is the best opportunity. The mobility and the acceleration are also slightly limited with the addition of the ERA armour, making it harder to crest ridges and hills; make sure to achieve enough high-speed to escalate some obstacles, on maps like the rocky [[Emperors Garden Map|Japan]].\n\nThe large size and lack of neutral steering make it difficult to engage in close-quarters combat in urban scenarios. Hence those brawling situations should be avoided at all costs. Holding a corner is not regularly viable in this vehicle either, due to the turret being located in the rear and the large chassis hindering any shoot-and-scoot, unless in reverse.\n\nThe ROMOR's players could use the high-speed performance to get an early cap on some maps like [[Maginot Line (Ground Forces)|Maginot line]] or perhaps staying behind protection in a more compacted map doing support and scouting. If this does not sound like fun, a rushing early flanking manoeuvre will grant possibilities; on maps like the exceptionally flank-adequate [[Battle of Hurtgen Forest (Ground Forces)|Hürtgen Forest]].\n\n{{Notice|Don't overlook the advantageous roads available on most maps, they drastically increase the acceleration}}\n\n==== Sniping ====\nThe APFSDS rounds distinguish the tank destroying capabilities and allow to more easily penetrate highly armoured targets like Soviet heavy tanks as the mighty [[IS-7]], even at long range. The gunner thermals and laser rangefinder further concede the Centauro I 105 R one plentiful sniper capacity; entire sectors of the map can be guarded while being a sniper.\n\nThis role can be put into effect on the largest maps because they possess enough land for manoeuvres. Although the ideal environment will also spare some visual covers like forests, rocks or houses - This visual protection is also crucial against enemy helicopters and aircraft. The availability of an LWS gives the ROMOR an anticipated chance to hide or fight back any threat when being a sniper.\n\n==== Flanker ====\nIn most maps, frontal engagements should be avoided, as the tank configuration together with insufficient gun depression will not be satisfactory. This side-approach often rewards with several unsuspecting enemies, and with a second chance if any tank hits the ROMOR from the side, as the elongated and spacious hull might require finishing APFSDS shots.\n\nThe early module research could be improved by flanking, as this takes the Centauro away from the focus of the battle; particularly if the players struggle with the HEAT shell. Once a sabot shell has been researched, sniping can be executed more effectively.\n\n==== Support/Scouting ====\nOn speed-inhibiting maps like [[Berlin (Ground Forces)|Berlin]], a supporting or scouting role is highly beneficial for the ROMOR. The availability of smoke charges, thermal imaging, artillery and scouting ability is crucial in these narrow confrontations; and this Centauro is pretty well equipped for it. Even the HESH rounds and their low velocity might result handy when attacking over slopes or obstacles.\n\nThis usage on battle is different from a possible brawling playstyle as the idea is to transmit the enemy armour location to allied MBTs like the [[Leopard 1A5 (Italy)|Leopards]] and the [[Ariete (Family)|Ariete]] not to fight those targets directly, due to the awkward mobility and reduced targeting of the Centauro in close quarters.\n\nWith the smoke shells, any smart player can hold enemy advances or hinder enemy positions while defending a zone or street, allowing brawling tanks to advance.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Added ERA improves protection against HESH and chemical-based munitions\n* APFSDS offers improved penetration in comparison to APDS ammunition\n* Extremely mobile\n* Night vision devices and generation 1 gunner thermals\n\n'''Cons:'''\n\n* ERA increases the weight of the vehicle, slightly decreasing mobility\n* Little to no protection against most projectiles\n* Prone to overpressure damage from large-calibre chemical shells\n* Large size\n* Easily destroyed by planes and helicopters\n* No smoke grenades\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nDevelopment of the B1 Centauro began during the 1980s after the Italian Army issued a set of requirements for a new vehicle that would have equivalent firepower to the Leopard 1 MBT in Italian service at the time, but with greater combat mobility and the ability to reach greater points of strategic control.\n\nIn response to this, the Italian companies Fiat, Iveco and Oto Melara joined forces in a consortium to begin developing the vehicle requested by the Italian Army. In this joint venture, Fiat and Iveco were developing the vehicle's hull and power supply, whilst Oto Melara took care of the vehicle's turret and weapon systems.\n\nIn 1986, the final prototype of the B1 Centauro project was unveiled on Sardinia. The presented vehicle was an eight-wheeled lightly armoured tank destroyer, equipped with a derived modification of the L7 105 mm cannon, capable of reaching a very high top speed and covering large distances under its own power.\n\nImpressed by the B1 Centauro, the Italian Military placed orders for a number of vehicles, going in production in 1991 with the first ones entering service as early as 1992. In 1993 following a competition between firms to develop an ERA package for Centauros based in Somalia, British Royal Ordnance designed the ROMOR-A ERA armour set. 10 sets of the ERA armour were sent directly to Somalia to equip the Centauro's stationed there and 10 sets to Italy for further testing. The ROMOR-A ERA has the unique advantage of being easy to attach in the field, having no risk of exploding when handled, and only being triggered by large projectiles. These factors gave the Italian army significant flexibility in the application of the ERA.\n\nB1 Centauros took part in most major conflicts that defined the '90s and early 2000s, most notably in former Yugoslavia, Somalia, Iraq, Afghanistan and others. Apart from the Italian Army, other noteworthy operators of the Centauro include Spain, which produced licensed copies, Jordan and Oman.\n\nAround 400 B1 Centauros were built until 2006, including some other derived modifications of the vehicle filling other roles. The B1 Centauro still serves with the Italian as well as other armed forces to this day.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=it_b1_centauro_romor Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|07oqg8OOJ2M|'''Type 16 vs Centauro ROMOR''' - ''War Thunder Official Channel''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Other vehicles of similar configuration and role\n* [[Radkampfwagen 90]]\n* [[Rooikat 105]]\n* [[Type 16]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/5922-development-b1-centauro-the-wheeled-cheetah-en|[Devblog] B1 Centauro: The Wheeled Cheetah]]\n* [[Wikipedia:B1_Centauro|[Wikipedia] B1 Centauro]]\n* [https://tanks-encyclopedia.com/modern/Italy/B1-Centauro.php <nowiki>[Tanks Encyclopedia]</nowiki> B1 Centauro IFV (1986)]\n* [https://www.armyrecognition.com/italian_army_italy_wheeled_and_armoured_vehicle_uk/centauro_b1_105mm_wheeled_anti-tank_armoured_vehicle_technical_data_sheet_specifications_pictures.html <nowiki>[Army Recognition]</nowiki> Centauro 105mm Anti-tank armoured vehicle]\n\n{{TankManufacturer OTO Melara}}\n{{Italy light tanks}}\n[[Category:Wheeled ground vehicles]]"}}