{"title":"Centurion Mk 10","pageid":1006,"wikitext":{"*":"{{About\n|about = medium tank '''{{PAGENAME}}'''\n|usage = similar vehicles\n|link = Centurion (Family)\n}}\n{{Specs-Card\n|code=uk_centurion_mk_10\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} British medium tank {{Battle-rating}}. It was released along with the entire British tree line in [[Update 1.55 \"Royal Armour\"]]. An upgrade over the previous [[Centurion Mk 3]], the Mk 10 boasts slightly better frontal armour and a more powerful [[L7A1 (105 mm)|105 mm L7A1 gun]], but remains a vulnerable target in the Rank V battles.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n[[File:Centurion 10 Screenshot 3.jpg|thumb|Centurion Mk 10 driving on Sweden]]\n\n'''Armour type:'''\n\n* Rolled homogeneous armour\n* Cast homogeneous armour (turret)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 76.2 + 44 mm (57°) ''Front glacis'' <br> 76.2 mm (45°)|| 50.8 (12°) + 6 mm || 32 mm (7°) ''Top'' <br> 19 mm (62°) ''Bottom'' || 29 mm\n|-\n| Turret ||152 mm (3-48°) ''Turret front''<br>152 mm ''Gun mantlet''\n| 89 mm (5-12°) || 89 mm (1-18°) || 50.8 mm ''Front of turret'' <br /> 29 mm ''Center of turret''\n|-\n| Cupola || 152 mm || colspan=\"2\" style=\"text-align:center\" | 90 mm || 29 mm\n|-\n|}\n\n'''Notes:'''\n\n* Tracks and suspension wheels are both 20 mm thick.\n* The steel boxes around the turret give 4 mm while hull steel boxes give 6 mm of additional protection, though these seem to be a negligible addition.\n* Spaced armour plates are placed on the side of the Centurion, giving an additional 6 mm of side armour.\n\nThe {{PAGENAME}} has an additional upper front glacis plate compared to the preceding Mk 3. This reliably protects the glacis from penetration by commonly encountered full-bore AP rounds such as those fired by the [[KwK 43 (88 mm)|8.8 cm KwK 43 L/71]] or the [[D-10T (100 mm)|100 mm D-10]]. However, it will not protect against most APDS or HEAT rounds that may be encountered in up-tiers. The Mk 10's turret is identical to that on the Mk 3 except for the thicker gun mantlet; the mantlet can protect against carelessly aimed shots, but the flat turret face is vulnerable.\n\nThere are many rounds of ammunition scattered throughout the Centurion's hull, and a large ammo rack is also situated next to the driver, on the left side of the tank. This means that any round that successfully penetrates the Centurion's hull will likely cause an ammunition explosion. On the other hand, there is no ammunition stored above the turret ring; turret penetrations are unlikely to cause an ammunition explosion unless the shells have explosive fillers.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=1,007|rbMinHp=575}}\n\nThe {{PAGENAME}} has decent cross country mobility, but suffers from a low top speed thanks to its underpowered engine, especially compared to other medium tanks. It is capable of neutral steering, and is fairly manoeuvrable.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n[[File:Centurion 10 Screenshot 1.jpg|thumb|A Centurion Mk 10 fires its main gun]]\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|Royal Ordnance L7A1 (105 mm)}}\n\nThe Centurion Mk 10 is the first British tank to be equipped with the ubiquitous 105 mm L7 rifled gun. However, unlike other countries, the L7 was not issued with HEAT-FS ammunition in British service, and thus the only rounds available are APDS and HESH. Both are generally less reliably lethal than HEAT-FS, and require good knowledge of opposing tanks' weak spots and critical modules for best effect, making them harder to use.\n\nOn the plus side, the gun is fully stabilised and the Centurion Mk 10 can reliably hit targets while moving. The gun also reloads quite fast, allowing the Centurion to reload before common opponents like the T-54 medium tanks.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[Royal Ordnance L7A1 (105 mm)|105 mm Royal Ordnance L7A1]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 70 || rowspan=\"2\" | -10°/+20° || rowspan=\"2\" | ±180° || rowspan=\"2\" | Two-plane || 19.04 || 26.35 || 32.00 || 35.39 || 37.65 || rowspan=\"2\" | 8.71 || rowspan=\"2\" | 7.70 || rowspan=\"2\" | 7.10 || rowspan=\"2\" | 6.70\n|-\n! ''Realistic''\n| 11.90 || 14.00 || 17.00 || 18.80 || 20.00\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| Shot L28A1 || APDS || 303 || 302 || 296 || 277 || 257 || 252\n|-\n| Shell L35 || HESH || 127 || 127 || 127 || 127 || 127 || 127\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| Shot L28A1 || APDS || 1,478 || 4 || N/A || N/A || N/A || 75° || 78° || 80°\n|-\n| Shell L35 || HESH || 720 || 11.4 || 0.1 || 4 || 3,150 || 73° || 77° || 80°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x400px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 2.11.0.71''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''70''' || 65&nbsp;''(+5)'' || 59&nbsp;''(+11)'' || 53&nbsp;''(+17)'' || 43&nbsp;''(+27)'' || 15&nbsp;''(+55)'' || 1&nbsp;''(+69)'' || No\n|-\n|}\n'''Notes''':\n\n* Shells are modelled individually and disappear after having been shot or loaded.\n* Rack 6 is a first stage ammo rack. It totals 14 shells and gets filled first when loading up the tank.\n* This rack is also emptied early: the rack depletion order at full capacity is: 6 - 1 - 2 - etc. until 5.\n* Full reload speed will be realized as long as shells are available in the ready rack 6. If the ready rack is empty, a penalty to reload speed will occur.\n* Simply not firing when the gun is loaded will move ammo from racks 1-5 into rack 6. Firing will interrupt the restocking of the ready rack.\n* If you pack 15&nbsp;''(+55)'' shells, it will keep most of the hull empty of ammo.\n\n==== [[Optics]] ====\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"3\" | {{PAGENAME}} Optics\n|-\n!\n! Default magnification\n! Maximum magnification\n|-\n! Main Gun optics\n| X4.9 || X6.0\n|-\n! Comparable optics\n| colspan=\"2\" | [[M50]]\n|-\n|}\nNote: The optics are mounted on top of the tank instead of coaxially.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|L3A1 (7.62 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[L3A1 (7.62 mm)|7.62 mm L3A1]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 3,000 (250) || 500 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n[[File:Centurion 10 Screenshot 2.jpg|thumb|Centurion Mk 10 drives into battle]]\nThe Centurion Mk 10 should feel familiar to players coming from the Centurion Mk 3. The 105 mm L7A1 features high penetration and precision at long range, especially with the high-velocity APDS ammunition, capable of penetrating the upper glacis of a Tiger II. The increased hull armour and thicker gun mantlet make it more resilient against poorly aimed shots, while the tank also retains its great mobility, though it still suffers from having a low top speed.\n\nThese traits make the Centurion Mk 10 an excellent sniper and fire support vehicle, able to hold back and pick off enemy vehicles at range. Playing the Centurion too aggressively may result in being quickly outmanoeuvred early game, particularly by high-rank armoured cars such as the [[AUBL/74]] and highly mobile German tanks like the [[Leopard I]] and [[Ru 251]]. The Centurion rewards a player who has patience and a good awareness of their surroundings.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* High-penetrating gun with immediate access to APDS and HESH shots as the default rounds\n* Good gun depression and elevation angles\n* Upper glacis is rather strong against solid shot and APHE\n* Good mobility options with neutral steering and reverse speed\n* Reasonably fast reload speed\n* Comfortable transition from the Centurion Mk 3\n\n'''Cons:'''\n\n* Lower glacis is still a prominent weak spot\n* Turret armour is flat in somee places and struggles to stop even Soviet APHE shells\n* Mediocre top speed and acceleration\n* No access to HEAT-FS, unlike other nations' L7 guns\n* Engine armour is weak from the top, can be damaged aircraft guns\n* Small internal compartment (only 4 crew members) with ammunition scattered all over\n* Very slow vertical targeting speed\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n===Development===\nThe tank's concept was made in 1943 when the Directorate of Tank Design, under Sir Claude Gibb, was asked to produce a new heavy cruiser tank for the General Staff under the designation ''A41'', which was to become the standard of a British \"Universal Tank\" to replace the separated \"infantry\" and \"cruiser\" tanks currently used. As World War II progressed and the Germans unveiled their heavier tanks with an 88 mm cannon like the [[Tiger H1|Tiger]], War Office made a revision to their design requirements to counter this threat. The requirements now include increased durability and reliability, with the ability to protect itself against the 88 mm gun and mines, agility similar to the [[Comet I|Comet tank]], and good reverse speed, all while staying under a 40-ton weight.\n\nResponding to these requirements, the department developed larger hulls by adapting the suspension on the Comet, lengthening with another road wheel and spacing between the wheels. The standard Christie suspension used on the previous cruiser tanks was replaced by the Horstmann suspension, which uses coil springs on two-wheel bogies on each side and is easier to maintain than the Christie suspension. The hull used a welded, sloped armour with a cast turret mounting the famous 17-pounder cannon. The speed of the tank would be established by using the Rolls Meteor engine previously used on the Comet and [[Cromwell V|Cromwell]]. Despite these changes, the department concluded that the weight restriction would not allow the tank design to withstand the 88 mm rounds. The weight restriction was done so the tank would be able to be carried around in the Mk.I and Mk.II transport trailers, which had a 40-ton load. This restriction was rescinded to allow more freedom in the tank design, which showed potential to the War Ministry. The heavier tank designs developed had armour equivalent to the heaviest infantry tanks like the [[Churchill Mk VII|Churchill tank]], yet with superior cross-country mobility due to improved suspension and engines.\n\nThe tank was given the name '''Centurion''' and the first mock-ups of the design was made by AEC and was presented in May 1944. After that, 20 pilot models were ordered with various armament combinations. Ten had a 17-pounder and a 20 mm Polsten gun (5 with a machine gun in turret rear, 5 with an escape door instead), five had a 17-pounder and a BESA machine gun and an escape door, five more with the 77 mm HV gun with a driver operated a hull machine gun. The prototypes of the 40-ton design, the [[Centurion Mk 1]], had a 76 mm armour on the front glacis, which was made very powerful with the heavy sloping design on the tank. Added with a 152 mm thick turret armour, the Centurion became a very protected tank design, yet it was also very agile, outperforming the Comet tank in tests. The next Centurion model, Mk.2, featured a much thicker 118 mm front glacis armour and thicker side armour. Production began for the Centurion Mk.2 in November 1945 for 800 tanks from Leyland Motors, Royal Ordnance Factories, and Vickers. The Mk.2 was put into service in the 5th Royal Tank Regiment in December 1946.\n\nAfter the Centurion Mk.2 was put into service, Royal Ordnance developed the successor to the 17-pounder, the 84 mm 20-pounder. With this, the Centurion went through another upgrade to mount the 20-pounder. The 20 mm Polsten gun was removed and replaced by a BESA gun due to its questionable utility. The new upgrade, now the [[Centurion Mk 3]], also featured an automatic stabilization system that improved firing accuracy while on the move. The tank was first produced in 1948 and overtook the previous Mk.1 and Mk.2 in service. However, the 20-pounder also did not stay in service for long and were replaced by the more powerful 105 mm L7 gun from Royal Ordnance Factories. All Centurions versions after Mark 5/2 used the L7 gun, including the [[Centurion Mk 10]], which also featured additional armour with the new gun.\n\n===Combat usage===\nThe Centurion first saw combat in the Korean war in 1950 in the British 8th King's Royal Irish Hussars. The Centurion Mk.3 issued to them had to be cared for in the winter conditions of Korea. Steps such as parking the tank on straw, starting the engine every half-hour, and keeping the gear engaged have to be done to keep the tank from becoming frozen in place. The Centurions made a great impact on the battlefield, covering the withdrawal of the 29th Brigade. In 1953, the Centurion saw the part in the battle of the Hook in the 1st Royal Tank Regiment, repelling the swarming Chinese infantry. General John O'Daniel from the US 1st Corps praised the Centurion's mobility throughout the mountain terrains.\n\nAfter the Korean War, the Centurions saw service again during the Vietnam War in the Royal Australian Armoured Corps after complaints were made on the thin armour of their armoured vehicles. The Centurions landed on 28 February 1968. Headed by Colonel Donald Dunstan, he ordered the Centurions to reinforce firebases at Coral and Balmoral. The use of the Centurions by the 1st Australian Task Force helped them in the Battle of Coral-Balmoral that caused massive casualties in two infantry regiments among the enemy with no known tank losses. After the battle, more Centurions landed into Vietnam, with a total of 58 Centurions in the country at once in the span of three and a half years. In this time period, 42 suffered damages, two were written off, and two crewmen were killed in action.\n\nThe Centurions also made up the bulk of India's tank forces, to which they used against Pakistan in the conflicts that occur in 1965 and 1971. In the middle east, the Centurions were supplied to Israel and Jordan in the 1950s. At the time of the Six-Day War, Israel had 293 Centurion tanks and Jordan had 90 Centurions. Both countries used the Centurions against each other in the war. Sometime in the early 1970s, the Centurions on both side were upgraded with the 105 mm L7 gun. Both Jordan and Israel used the Centurion again in the 1973 Yom Kippur War, where Israel establish the Centurion's prowess in battle during the Battle of Golan Heights, where 100 or so Centurions are able to beat back 500 or more Syrian [[T-54 (1951)|T-55]] and T-62 tanks. While the Centurion still sees use in Jordan today, the Centurions in Israel were retired in the 1990s, only staying as armour personnel carriers and armour recovery vehicles. In the middle east, the British used the Centurions again during the 1991 Gulf War against Iraq, though only as an AVRE in the 32 Armoured Engineer Regiment. Three were lost in training incidents with no deaths among the crew.\n\nSweden and South Africa also used the Centurions, buying them from Britain after World War II. The Centurions in South Africa were retained and upgraded due to their superiority over anything their neighbours had at the time, with a focus on the upgrade to the 105 mm gun and belly armour to protect itself against mines. Sweden bought the Centurions in an attempt to standardize their tank forces as it was the most cost-effective method, plus the Centurions have a huge upgrade potential to counter future threats. The British offered to sell the Centurion in late 1952, to which 80 were ordered by Sweden. The first deliveries were made in April 1953, followed by more orders and more deliveries until about 350 Centurion tanks ranging from Mk.3, Mk.5, and Mk.10 were in Sweden. The Swedish military used the Centurions until 1990s, modernizing the tanks with upgrades in equipment and internal mechanics. They replaced the Centurions with Leopard 2s.\n\n====Nuclear test====\nThe Centurion was also well known for being used in a nuclear test in 1953. A [[Centurion Mk 3]] built by Royal Ordnance Factory as number 39/190 is supplied to Australia in 1952 and kept under army registration number 169041. Placed less than 500 yards from a 9.1kt nuclear explosion, it withstood the explosive force of the explosion. The engine was still functional and the ammunition were intact. The only effect the explosion did onto the tank was moved it back five feet, removing all antennas, sandblasting vision slots, incinerating the cloth mantlet cover, and blow off the armour side skirts. The tank was simply driven off-site after the test, but it is believed that if a crew was in the tank at the time of the explosion, they would've been killed. The tank, nicknamed the ''Atomic Tank'' was then used in the Vietnam War after being restored for action. The Centurion was hit by an RPG round in May 1969 that injured the entire turret crew. While one crew member had to evacuate from his battle wounds, the rest stayed in the still battle-worthy tank. Today, the tank resides at the Robertson Barracks in Palmerston, Northern Territory. Centurion 169041 is distinguished from other nuclear-tested tanks by having a 23-year service after the nuclear test, with 15 months in a hostile environment.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=uk_centurion_mk_10 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|zsD66EJsyU8|'''{{PAGENAME}} Tank Review''' - ''NUSensei''|lbZxQtGb2Dc|'''{{PAGENAME}} - Tank Review - Between Overpowered And Frustrating''' - ''Napalmratte''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Vehicles equipped with the same chassis\n* [[Centurion (Family)]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wikipedia:Centurion (tank)|[Wikipedia] Centurion]]\n* [https://tanks-encyclopedia.com/coldwar/UK/FV-4200_Centurion <nowiki>[Tanks Encyclopedia]</nowiki> FV4007 Centurion]\n\n{{TankManufacturer Department of Tank Design}}\n{{Britain medium tanks}}"}}