{"title":"CM25","pageid":11714,"wikitext":{"*":"{{About\n| about = Chinese tank destroyer '''{{PAGENAME}}'''\n| usage = other versions\n| link = M113 (Family)\n}}\n{{Specs-Card\n|code=cn_cm_25\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese tank destroyer {{Battle-rating}}. It was introduced in [[Update \"Raining Fire\"]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n\nThe vehicle profile is a basic rectangle with a slightly sloped front which increases protection from machine gun fire. The front has a hatch, which works as a HESH screen. The main areas of the vehicle to target when attacking is the missile launcher and machine gun to disable its attack capability, or the main vehicle shot to disable it completely.\n\nThe CM25 is meant to be a stand-off vehicle due to its role on the battlefield and is not built to be on the front line. Even with the add-on armour, compared to the previous [[M113A1 (TOW) (China)|M113A1]], the aluminium alloy armour will not stand up to much and will barely stop 12.7 mm machine gun fire when angled or far away. Anything of higher calibre is almost guaranteed to penetrate.\n\nTry to hide as best as you can, or not only the gunner will suffer consequences, but the entirety of the crew as well.\n\nThe gunner is exposed outside of the vehicle when directing the launcher and can be hit. Be aware, as the launcher's base, and sometimes even the rangefinder located next to the launcher, can trigger APHE fuse and cause it to explode in front of the gunner's face, the shrapnel then flying back and shredding the virtually nonexistent roof armour, taking out everyone in the middle of the vehicle. Also, since the gunner stands within the opened roof hatch, if a chemical warhead hits the rangefinder, then the payload can enter the vehicle through it and take out the loader as well.\n\nSince the vehicle's armour is very thin, it sometimes does not detonate shells so armour-piercing shells cause less than fatal damage. However, only '''very''' high calibre shells with fuses of about 20-22 mm won't detonate, which are very rare at the battle rating, as most shells use 15 mm fuses at this point. The main key here is to avoid being hit at all as if your tank is angled during an attack, the fuses would detonate anyway. The aforementioned shield on the front can stop HESH from doing any damage at all, but it's not very reliable.\n\nAll in all, it's best to just get out of the way of other tanks and sneak around; this is a vehicle of strategy, not brute force.\n\n'''Armour type:''' <!-- The types of armour present on the vehicle and their general locations -->\n<!-- Example: * Rolled homogeneous armour (Front, Side, Rear, Hull roof)\n* Cast homogeneous armour (Turret, Transmission area) -->\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || ___ mm || ___ mm ''Top'' <br> ___ mm ''Bottom'' || ___ mm || ___ - ___ mm\n|-\n| Turret || ___ - ___ mm ''Turret front'' <br> ___ mm ''Gun mantlet'' || ___ - ___ mm || ___ - ___ mm || ___ - ___ mm\n|-\n| Cupola || ___ mm || ___ mm || ___ mm || ___ mm\n|-\n|}\n\n'''Notes:''' <!-- Any additional notes which the user needs to be aware of -->\n<!-- Example: * Suspension wheels are 20 mm thick, tracks are 30 mm thick, and torsion bars are 60 mm thick. -->\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=305|rbMinHp=190}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|BGM-71 TOW}}\n\nThe placement of the weapon is high enough to fire over cover, however, advantages also at times spawn disadvantages and in this case, with the vehicle gunner standing tall outside of the vehicle, he has no protection and can easily be hit, despite the rest of vehicle being concealed.\n\nThe launcher has a rather limited arc of fire - 45 degrees in either direction, which isn't compensated by missile's characteristics like in the case of [[Swingfire]] or armour like in the case of [[IT-1]]. If you want to fire over cover, the best bet is to stay far away from the enemy and cover, or right in front of the cover, however, this still probably won't protect the gunner. The gun depression, at 20 degrees, excels almost every other tank and allows the player to use many surprising positions to attack. Note that the depression is far less when the launch tube is positioned above the machine gun.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[BGM-71 TOW]] ATGM || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 10 || rowspan=\"2\" | -20°/+25° || rowspan=\"2\" | ±45° || rowspan=\"2\" | N/A || 26.4 || 36.6 || 44.3 || 49.0 || 52.1 || rowspan=\"2\" | 13.00 || rowspan=\"2\" | 11.50 || rowspan=\"2\" | 10.60 || rowspan=\"2\" | 10.00\n|-\n! ''Realistic''\n| 17.9 || 21.0 || 25.5 || 28.2 || 30.0\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| I-TOW || ATGM || 630 || 630 || 630 || 630 || 630 || 630\n|-\n| TOW-2B || ATGM || 100 || 100 || 100 || 100 || 100 || 100\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"11\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Range<br>(m)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| I-TOW || ATGM || 296 || 3,750 || 19.05 || 0.05 || 0.1 || 2,720 || 80° || 82° || 90°\n|-\n| TOW-2B || ATGM || 309 || 3,750 || 22.59 || 0.05 || 0.1 || 3,140 || 80° || 82° || 90°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 2.3.0.101''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n|-\n| '''10''' || 9&nbsp;''(+1)'' || 8&nbsp;''(+2)'' || 7&nbsp;''(+3)'' || 6&nbsp;''(+4)'' || 5&nbsp;''(+5)''\n|-\n! 6th<br>rack empty\n! 7th<br>rack empty\n! 8th<br>rack empty\n! 9th<br>rack empty\n! 10th<br>rack empty\n! Visual<br>discrepancy\n|-\n| 4&nbsp;''(+6)'' || 3&nbsp;''(+7)'' || 2&nbsp;''(+8)'' || 1&nbsp;''(+9)'' || 0&nbsp;''(+10)'' || No\n|-\n|}\n\nNotes:\n\n* The CM25 is only required to have at least 2 missiles to go into battle, unlike the standard 4 ammunition for other vehicles.\n* The vehicle has no ready rack.\n* It is advised to bring full ammo due to how little ammo the CM25 can carry.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|M2HB (12.7 mm)}}\n\nThe single 12.7 mm machine gun can be effective when fighting against open-topped or lightly armoured vehicles (eg [[AUBL/74]], [[Gepard]]) or to cause some confusion/distraction to the enemy vehicles as the CM25 reloads.\n\nAt this battle rating, this vehicle is limited to keeping helicopters from getting too comfy, since they too have thin to no armour, other aircraft should be left to the designated anti-air vehicles. As a last resort, the ATGM can be used.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[M2HB (12.7 mm)|12.7 mm M2HB]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Pintle || 1,000 (200) || 577 || -10°/+50° || ±120°\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe best way one should use this vehicle would be to stay away from the active combat areas, hide, and use the exposed gunner and TOW launcher to your advantage. The exposed launcher allows the vehicle to hide behind solid cover while still being able to fire from over it, giving the enemy a much harder time in spotting and shooting you. Staying away from the combat zones maximises your survivability, in addition to taking advantage of the TOW missiles' extremely long-range, allowing you to pick off targets from beyond the range of conventional rounds.\n\nIt is also worth noting the -20 degrees launcher depression as, even though it may not be as impressive as the -30 degrees launcher depression of the [[M901]], it is still very capable of adapting to uneven terrain and firing from behind hills. However, note that the depression angles are severely limited when the launcher is facing the pintle-mounted machine gun, to roughly only -3 degrees. Therefore, you should try to always have the front of the hull facing the direction of the battlefield, to avoid the launcher suddenly jerking up when the machine gun gets into the way, which will also guide the missile upwards (if launched), and therefore miss the target. Horizontal guidance is also limited, and the launcher will stop rotating at ±45 degrees. The best way to counter this drawback will be to play it like other turret-less tank destroyers, like the [[ISU-122 (China)|ISU-122]] and the [[ISU-152 (China)|ISU-152]], which must rotate the hull to assist with aiming at extreme angles.\n\nEven though the CM25 is mounted with a heavy machine gun, attempting to combat helicopters and planes is not recommended unless the situation is desperate, as doing so will only grab unwanted attention from both the air and ground. Aircraft at this rank are often equipped with HE rockets, only one of which is necessary to destroy your vehicle thanks to the hull-break mechanic, and if not, the vast majority of aircraft-mounted guns will be able to penetrate from any angle.\n\nIf you find yourself in a close-quarters situation, the best method of survival will be to use the machine gun to cause some levels of distraction, while attempting to retreat to the nearest cover. Do note that your machine gun does have a relatively impressive penetration of 31 mm at close range, which can allow you to take out lightly armoured targets like the [[M3 Bradley]] (in the turret with some luck), [[AUBL/74]], [[Falcon]] etc., yet should still be avoided if possible due to these vehicles possessing much better close-quarters capabilities and will have no problem in shredding the CM25.\n\n'''Enemies worth noting:'''\n\n* [[Helicopters]] eg. AH-1, UH-1, etc: helicopters are always a great threat to you. Although at the start of the match they cannot equip ATGMs, they are still able to carry lots of deadly rockets, posing a great threat to the CM25's weak hull. When an enemy helicopter is roaming nearby and showering the ground with rockets, the safest option is to stay in cover or be stationary, to make it harder for the helicopter to see you. Your only effective defensive weapon against them is the 12.7 mm MG (unless you are very skilled and can manually guide the ATGM to hit them). Only open fire when the helicopter is extremely near, for example within 400 m. Your MG can only damage light helicopters like the UH-1 but not armoured ones. Continuously spray bullets at it until it starts to turn towards you, and quickly retreat back into cover as any helicopter can easily destroy you with a few rockets.\n* [[M60A1 RISE (P)]], [[M60A3 TTS]]: these tanks are covered with ERA which is designed to counter chemical warheads like your TOW missiles. When the CM25's TOW missile hits them, their ERA always detonates, leaving the tanks themselves unharmed, so it is not recommended to shoot them when their ERA is still present. If they are quite far away, you can choose to break their gun barrels or tracks to make them defenceless or immobile. If they are close enough, you can use your 12.7 mm MG to destroy their ERA first. Do not spray, fire in quick bursts and focus on a few blocks of ERA, as the bullets seem to spread out a lot in a continuous fire which will decrease the damage to the ERA you want to destroy. The MG is rather effective at destroying these modules. Once the ERA is gone, use the TOW to hit the uncovered areas. The most straightforward method is to just fire a missile at them, destroying a bunch of ERA and fire another one at the uncovered area. However, this method will give them more than 10 seconds of reaction time so make sure that you are well concealed and will not get spotted before the next missile is loaded.\n* [[M901]]: this is a similar vehicle based on the M113 hull, with an interesting and unique TOW launcher. The launcher has 360 degrees horizontal rotation and 30 degrees gun depression meaning it adapts to terrains better than the CM25. Furthermore, its gunner is not exposed which increases its fighting capacity, so you must deal with the M901 carefully. In a battle, your CM25 and the M901 might be at similar spots which are kind of a sniper vs sniper scenario. Do not get hit by it, as your gunner/launcher will detonate its missile and the shrapnel will splash down, knocking out all the crew or causing a hull break. Try to fire first or hide until his attention shifts.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Can research TOW-2B a whole BR earlier than other ATGM tanks. The missile grants the tank a top-attack ability, which is an incredible advantage when hunting opponents behind obstacles or counter-sniping\n* Stock I-TOW missile has decent penetration\n* Amazing 20 degrees depression allows easy adaption to rough terrain\n* Decent mobility (64 km/h top speed) allows it to get to positions in time, not much slower than common MBTs like the [[T-55A]] and [[M48A1]]\n* Heavy machine gun can take out lightly armoured vehicles and low-flying planes/helicopters\n* A extended gunner and launcher allows the vehicle to fire with its whole hull in cover\n\n'''Cons:'''\n\n* Fully exposed gunner is very vulnerable to everything\n* Thin armour makes it especially vulnerable to autocannons that can shred through the crew and ammo\n* While not slow, it can still easily be outrun by fast tanks like the [[Leopard I]] and [[Centauro]]\n* Is a big and soft target for aircraft, even those only armed with MGs\n* Cannot fire ATGM on the move, which can be fatal in a close quarter sudden encounter\n* Turns rather slowly\n* Area of the MG blocks gun depression\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nDuring the heat of the Vietnam War, Taiwan was one of the major bases for US operations against the North Vietnamese forces; while the M113 APC was an iconic vehicle in the war, it also suffered from heavy losses to the Viet Cong. As such, the US signed an agreement with the Taiwanese government in 1967 to refurbish and repair M113s that were recovered by US forces under the \"Third-Nation Overhaul Program\" (第三國翻修計劃).\n\nAt the time, the Nationalist forces had never built any form of armoured vehicles from scratch, only a few vehicles that were rebuilt from existing parts of US aid vehicles, so the overhaul program was a good chance for the Nationalist forces to learn the flow of APC manufacture and methods to repair M113s. In 1975, after the war was ended with the victory of the Northern forces, the Combined Service Forces (聯合勤務總司令部 or 聯勤 for short) started \"Project Wancheng\" (萬乘計劃, 萬乘 lit. 10 thousand vehicles) for domestic versions of M113, coded Wancheng 1 to 3; from mortar vehicles to MLRS and even projected to install spare [[M24 (China)|M24 Chaffee]] turrets onto the chassis of M113. These vehicles, built and assembled by Taiwan Aluminum Corporation (台鋁公司, now China Steel Aluminum Corporation 中鋼鋁業), became the basis of what would be CM21 APC for the Republic of China Army.\n\nThe major difference of the later versions CM21 APC to the original M113A1 is additional armour plates on around the hull, which are filled with polyurethane chemicals to absorb bullet up to 5.56 mm NATO rounds; while it might be a little more protected than M113A1, this also cost some of its mobility due to the weight added from such armour plates.\n\nCM25 is one of the five major variants of the CM21 APC, armed with US-made [[BGM-71 TOW]] missiles, the polyurethane forms were also replaced by polystyrene for the amphibious needs of the ROCMC; these around 30 vehicles became heavy weaponry exclusively for the Marine Corps anti-tank companies, serving as their mobile AT platform along with its American cousin [[M113A1 (TOW) (China)|M113A1 (TOW)]] in view of possible Mainland China landing operations.\n\n=== [[wt:en/news/6843-development-cm25-armor-reaper-en|Devblog]] ===\nSince the 1960's, the armed forces in Taiwan have operated with a large fleet of American-made M113 APCs spanning several variants. Thoroughly pleased with the vehicle's performance and reliability, Taiwan decided to develop its own APC, inspired by the proven M113's design.\n\nIn 1979, the first prototype of what would become the CM21 series of APCs was built and subsequently underwent testing. Once some improvements were made, the CM21 series went into mass production and officially entered service in 1982. By the time the production ceased in 1999, some 1,200 units of the CM21 series of APCs were built.\n\nIn 1987, the basic CM21 design was modified to allow the vehicle to conduct anti-tank duties, similar to the M113A1 TOW already in service at the time. In a similar manner as the M113, the vehicle was fitted with a single TOW launcher and received the new designation CM25.\n\nBy 2019, all M113A1 APCs among the ranks of the Taiwanese armed forces were replaced by newer vehicles. However, the CM21 series of APCs, including the CM25, continue serving in the present.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicleCountry=china&vehicleType=tank&vehicleClass=tank_destroyer&vehicle=cn_cm_25 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed\" caption=\"CM25 Devblog Images\" heights=\"150\">\nFile:CM25 WTWallpaper 001.jpg|\nFile:CM25 WTWallpaper 002.jpg|\nFile:CM25 WTWallpaper 003.jpg|\nFile:CM25 WTWallpaper 004.jpg|\n</gallery>\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/6843-development-cm25-armor-reaper-en|[Devblog] CM25: Armor Reaper]]\n\n{{TankManufacturer Ordnance Research Development Center}}\n{{China tank destroyers}}"}}