{"title":"Comet I","pageid":1001,"wikitext":{"*":"{{About\n| about = British medium tank '''{{PAGENAME}}'''\n| usage = the other version\n| link = Comet I \"Iron Duke IV\"\n}}\n{{Specs-Card\n|code=uk_a_34_comet\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} British medium tank {{Battle-rating}}. It was introduced in [[Update 1.55 \"Royal Armour\"]] along with the initial British ground tree. Armed with a [[OQF Mk.II (77 mm)|77 mm HV gun]], essentially a 17-pounder with a lower muzzle velocity, it has one of the more powerful guns available for a medium tank at the rating.\n\nThe Comet is an excellent medium tank. It has great mobility and acceleration, able to reach 38 km/h very quickly and stay there in full throttle, but its reverse speed is pitiful like the [[Cromwell (Family)|Cromwell]]. Firepower is also a benefit of the vehicle, especially after the unlocking of the APDS shot, giving it the penetration needed to deal with any threat you might encounter. The drawback of the design is the sub-par armour that can be pretty easily penetrated at BR 5.3. One should take advantage of the Comet's low profile and mobility to hide and manoeuvre from the enemy to catch them at an advantageous angle. The Comet also has a benefit the previous tanks in its branch, the [[Sherman Firefly]], didn't have in the great gun depression. This allows the Comet to more easily fire over hills in an hull-down position to destroy the enemy with a terrain benefit for protection.\n\nThe Comet has an olive drab colour like all other British tanks. It is also quite low in stature. The Comet has a unique turret design and has a nice long barrel. The barrel has a muzzle brake at the end of it. The machine gun beside the driver doesn't work.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n'''Armour type:'''\n\n* Rolled homogeneous armour\n* Cast homogeneous armour (Turret front, Gun mantlet)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front !! Sides !! Rear !! Roof\n|-\n| Hull || 76.2 mm (1°) ''Front plate'' <br> 32 mm (72°) ''Front glacis'' <br> 63.5 mm (19°) ''Joint plate'' <br> 25.4 mm (69°) ''Lower glacis'' || 32 mm ''Top front half'' <br> 25 mm ''Top back half''<br> 29 + 14 mm ''Bottom'' || 32 + 25.4 mm (1°) ''Top half'' <br> 32 mm (32°) ''Lower half'' || 14 mm\n|-\n| Turret || 102 mm (3-57°) ''Turret front'' <br> 102 mm (1-34°) ''Gun mantlet'' || 63.5 mm || 57.1 + 5 mm (1°) || 25.4 mm ''Front half'' <br> 20 mm ''Rear half''\n|-\n| Cupola || 44 mm || 44 mm || 44 mm || 25.4 mm\n|-\n|}\n'''Notes:'''\n\n*Suspension wheels and the tracks are 20 mm thick.\n*There are tracks attached on the turret that provide an extra 20 mm armour where they are attached.\n*Steel boxes on the left and right side of the hull by the turret gives 4 mm extra armour at their location.\n*The bustle rack on the back of the turret gives an armour rating of 5 mm\n\nAim for the hull. You will almost certainly destroy the tank when a Comet player is reversing and panicking at the same time.\n\nThe turret is an unreliable area to target. Its armour is thicker and bouncy. A good Comet player will be in a hull down position, but you can easily take it out if you aim for the cupola or if your gun can take it, the turret cheeks.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=930|rbMinHp=531}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|OQF Mk.II (77 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[OQF Mk.II (77 mm)|77 mm OQF Mk.II]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 61 || rowspan=\"2\" | -12°/+20° || rowspan=\"2\" | ±180° || rowspan=\"2\" | N/A || 14.3 || 19.8 || 24.0 || 26.5 || 28.2 || rowspan=\"2\" | 9.62 || rowspan=\"2\" | 8.51 || rowspan=\"2\" | 7.84 || rowspan=\"2\" | 7.40\n|-\n! ''Realistic''\n| 8.9 || 10.5 || 12.8 || 14.1 || 15.0\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| Shot Mk.6 || AP || 137 || 134 || 123 || 111 || 100 || 91\n|-\n| Shell Mk.1 || HE || 9 || 9 || 9 || 9 || 9 || 9\n|-\n| Shot Mk.4 || APC || 137 || 134 || 123 || 111 || 100 || 91\n|-\n| Shot Mk.8 || APCBC || 152 || 149 || 137 || 124 || 112 || 101\n|-\n| Shot SV Mk.1 || APDS || 220 || 216 || 199 || 179 || 159 || 139\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| Shot Mk.6 || AP || 754 || 7.71 || N/A || N/A || N/A || 47° || 60° || 65°\n|-\n| Shell Mk.1 || HE || 754 || 6.98 || 0 || 0.1 || 580 || 79° || 80° || 81°\n|-\n| Shot Mk.4 || APC || 754 || 7.71 || N/A || N/A || N/A || 48° || 63° || 71°\n|-\n| Shot Mk.8 || APCBC || 754 || 7.71 || N/A || N/A || N/A || 48° || 63° || 71°\n|-\n| Shot SV Mk.1 || APDS || 1,120 || 1.73 || N/A || N/A || N/A || 75° || 78° || 80°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 2.3.0.85''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n|-\n| '''61''' || 56&nbsp;''(+5)'' || 50&nbsp;''(+11)'' || 43&nbsp;''(+18)''  || 38&nbsp;''(+23)'' || 30&nbsp;''(+31)''\n|-\n! 6th<br>rack empty\n! 7th<br>rack empty\n! 8th<br>rack empty\n! 9th<br>rack empty\n! 10th<br>rack empty\n! Visual<br>discrepancy\n|-\n| 25&nbsp;''(+36)'' || 20&nbsp;''(+41)'' || 12&nbsp;''(+49)'' || 7&nbsp;''(+54)''|| 1&nbsp;''(+60)''|| No\n|-\n|}\n'''Notes''':\n\n* As they are modeled by sets of 2, shells disappear from the rack only after you fire both shells in the set.\n* Right side empty: 25&nbsp;''(+36)'' shells.\n\n==== [[Optics]] ====\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"3\" | {{PAGENAME}} Optics\n|-\n!\n! Default magnification\n! Maximum magnification\n|-\n! Main Gun optics\n| X3.0 || X6.0\n|-\n! Comparable optics\n| colspan=\"2\" | [[VFW]]\n|-\n|}\n\nSecond tank in Medium tank British tech line to have X6 scope. It will not get any better than this until rank VI, so get used to it - it will be the same across entire tech tree for a while with SPAA being the only exception.\n\nAt rank III, this scope is slightly or moderately superior to most medium and heavy tanks, but do not expect to outrange German SPGs as they have similar or better optics.\n\nWith newfound APDS ammunition, you might want to take tank on a test drive to get used to APDS ballistic markings. As usually, each mark represents 200 m, but they skip over the 8 number on the scope, leaving inexperienced user guessing where is the 800 m mark. It is the second big line on your scope - try to remember it well.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|BESA (7.92 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[BESA (7.92 mm)|7.92 mm BESA]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 5,175 (225) || 600 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nFighting a tank of the same weight classification is relatively easy, but difficult against the more armoured [[Panther A]] and [[T-34-85|T-34]] tanks. Until the APDS shot can be unlocked, more decisive shots will have to be made to take care of these tanks, the Mk.6 and Mk.8 shot are the preferred ammunition to use. The Panthers should be targeted on the gun mantlet in the front and should be aimed at the gunner to immobilize their firepower and cause crew damage. The T-34-85 is a bit of a hit-or-miss due to the more heavy sloping nature of the armour and the turret. Penetrating through the front hull armour when it is facing directly at you is the best course of action against the T-34-85. Heavy tanks get even more tricky, but easier once the APDS round is unlocked for use. A [[Tiger H1|Tiger I]] is admittedly an easy tank to deal with due to the vertical slope of the armour. Problems arise with the [[IS-2]] tank that may show up, due to their heavy armour and their tendency to absolutely wreck vehicles with their 122 mm gun. Distance is not your friend against this tank, the closer the better for your gun to penetrate the weak spots on its frontal armour. A tough situation, but a survivable one.\n\nFor every Comet player that does not have the APDS shells, do not engage in long distance gun fights. You are almost certainly going to lose. So use it first as its intention is, a cruiser tank. Cap point and retreat. If you find yourself in a sticky situation, get as close to the enemy as possible and fire at its side. Conduct the battle in this manner until the APDS is unlocked\n\nThe best tactic is flanking and \"shoot and scoot\". Your armour won't stand against T-34s and Tigers you'll meet so don't pick a snipe position and keep firing - sooner or later you will be pinned down. You need to locate a good spot for attack, fire a few shots (Comet has a great fire rate: use it) and relocate. Don't mind the damage you made: keep moving!\n\nAlso, another \"never\" to do with this tank, never go in reverse. You are almost certainly going to get yourself destroyed in the process as you have an awful reverse speed. If you want to reverse, turn the whole tank around instead using neutral steer or just charge at the enemy, circle him or her once and disappear the other way. You must do this as quickly as you appeared. You can use smoke grenades, but still, don't reverse, charge at the enemy. To not to get in the situation in the first place, choose where you are going to go carefully. You must study the situation quickly and cautiously to not to get yourself blown up in the process. The key is to run, run and run.\n\nOverall, you must dedicate quite a bit of time to master the tank in all. Even when you have the APDS shells.\n\n===Game mode specifics===\n====Arcade battles====\nIn arcade domination mode where the cap points are arranged perpendicular to the cap points (ex. Poland, Ash River, Berlin, Korea, Karelia, Kuban, etc.), go for the flanks (A or C). If the cap points are diagonal (ex. Stalingrad), go for the closest cap point. And if the cap points are parallel to cap points (ex. Ardennes, Eastern Europe, etc.) go for the middle point as fast as you can. If you feel that you cant make it, help cap the point closest to spawn. You can also decide if you want to defend the point after capturing it. It is suggested to defend the cap point that has a lot of cover and an easy escape if overwhelmed (Suggested points to defend: A or C in Poland, C in Stalingrad, C in Ardennes).\n\n====Realistic/Simulator battles====\nIn realistic and simulator, the Comet can become sluggish and isn't as fast as in arcade. A suggestion would be to capture the closest cap point, cap it, and then go into hiding. When you go into hiding, take every well placed shot you can and immediately run away from an encounter. You will mainly be facing Tiger IIs, Tiger Is, and Panthers, T-34-85s, rarely Chi-Tos and Chi-Ris. If you encounter them on a one v. one, always be on the move. Move around the other tank and try to hit it from the side (Panthers, Tiger Is, Chi-Tos, and Chi-Ris). If you encounter a Tiger II, slap it across the cheek with a APDS shell and take shoot it through the side. T-34-85 would be easier. You can easily penetrate the frontal armour of the T-34-85. It is just a matter of reaction time.\n\n===Specific enemies worth noting===\n<!--Some concerning vehicles to worry about if playing this tank and how to fight them in an encounter. (i.e. Tiger II - shoot the turret cheeks)-->\nAll tanks when you do not have APDS shells yet. If you do, it a lot easier. As it has been mention before, when engaging a Tiger II, slap an APDS shell on the right turret cheek to knock out the gunner and finish it off from the side. The hardest tanks to counter are the following:\n\n* [[Tiger I (Family)|Tiger I]]\n* [[Panzer V Panther (Family)|Panther]]\n* [[Tiger II (Family)|Tiger II]]\n* [[T-34-85]]\n* [[IS-1]]/[[IS-2]]\n\nAlthough your gun can counter anything within the Comets BR range, you should constantly be aware that one hit from pretty much any gun to the front of the hull will knock out the Comet. In particular, the Soviet 85 mm and German 75 and 88 mm guns should be taken very seriously. They have plenty of explosive filler. The turret on the Comet has the chance to bounce even the mighty 88 mm gun found on the Tiger I, but only a chance. Your hull won't even protect you from the majority of rank 2 guns, so rank 3 and 4 guns will slice through the Comets armour like butter. Because of this, almost any enemy is dangerous. Even SPAA can be a frontal threat to you. In particular, the [[Wirbelwind]] or the [[Ostwind]] can cause serious damage at close to medium range. Be particularly cautious late in a match when SPAA are more common.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent manoeuvrability and speed\n* Good gun, precise and with good penetration values (vertical armour)\n* Great turret armour\n* Access to APDS shot\n* Low profile\n* Great gun depression\n* 5 crew members, for a better crew survivability\n* Good climbing ability, can get to sniping positions that other tanks cannot\n* When fully upgraded, the Comet I is fast and manoeuvrable\n* Has access to neutral steering which allows quick repositioning of the tank\n* APDS is great at taking out Panthers and Tigers at long range. One shot KOs are common if you know where the ammo racks are\n* APDS makes the tank very easy to use in RB and SB. The round drops very little over distance and retains a lot of penetration\n\n'''Cons:'''\n\n* Bad penetration values against sloped armour without APDS\n* Mediocre gun damage due to lack of explosive fillers, aim at the enemy gunner to increase your fighting chance\n* The 77 mm HV does not have as much penetration as the true 17-pounder and other Rank III guns\n* Overall bad armour for its rank, only the turret front has some good chance to bounce some hits\n* Awful reverse speed\n* APDS causes less post-penetration damage than the other AP rounds\n* Painful to use when stock due to disappointing performance in terms of acceleration and frustratingly bouncy stock rounds\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n===Development===\nThe British experience against the Germans during World War II showed that there were severe deficiencies with their cruiser tanks. The main cruiser tank in the British inventory was the [[Crusader Mk II|Crusader]] tank but it suffered from a gradually inefficient armament and thin armour. A request was submitted in 1941 to the Nuffield Organization and Leyland Motors Ltd for a heavier cruiser tank that could take on the gradually stronger German tanks, the design was also to use components from the Crusader tanks for economic reasons. This became the A24 Cruiser Tank Mk VII Cavalier tank and the A27L Cruiser tank Mk VII Centaur tank, which are both superseded by the [[Cromwell V|A27M Cruiser Tank Mk VII Cromwell tank]]. The Cromwell ended up as a decent cruiser tank for the British Army, giving great mobility, reliability, and a decent OQF 75 mm gun (or a 6-pounder gun). However, it still had problems, such as being under-gunned against the more armoured German tanks and suspension problems.\n\nIt was determined that the British Army needed a tank that mounted the large 17-pounder gun, which would allow the tank to stand its ground against the German panzers. The first attempt was an upgraded Cromwell in the form of the [[Challenger|A30 Challenger]], but development and production were slow and the first mass-produced tank with the 17-pounder was the modified [[Sherman Firefly|Sherman Firefly]]. While the Firefly was adequate, it was a logistical burden when the Firefly is attached to Cromwell troops, which would require the troop to have maintenance requirements for a Cromwell and a Sherman tank. A more standard tank is needed to fix this, and development started on this with the General Staff specification '''A34'''.\n\nThe developing tank now called the '''A34 Comet I''', was meant to fix the issues from the Cromwell such as the suspension and the track shedding, plus also increase the firepower and speed. The gun mounted on the tank was the \"77 mm HV\", a specifically built gun for the Comet I. Though using the same projectiles as the 17-pounder, the 77 mm HV gun uses cartridges with different casings thus the rounds between the two guns are different and the 77 mm HV produces a lower muzzle velocity for the round, but this allowed for easier stowage in the gun due to the more compact size. The Comet I also had greater armour protection, a welded armour construction, cast gun mantlet, stronger suspension, a return roller established in the suspension, an electrically traversed turret, and ammo stowage inside armoured bins. The Comet I, though having the power to go faster than the Cromwell, is restricted with an engine governor to preserve the suspension, engine, and tracks. The Comet I entered the prototype stage in February 1944, but delays caused production to start only in September 1944 and were put into service in Europe in December 1944. By the end of the war, about 1,186 Comet I tanks were made for the British Army.\n\n===Combat usage===\nThe first unit to receive the Comet I tank was the British 11th Armoured Division, which was delivered in December 1944, and was the only division to be refitted with Comets by the end of the war. The Comet did not perform significantly on the battlefield due to its late arrival, but it was involved in the crossing of the Rhine and the Berlin Victory parade in July 1945. In Europe, the maximum speed of 51 km/h allowed the Comet I to exploit the German highways to travel throughout the entire countryside.\n\nThe Comet I saw service after World War II during the Korean War when it started, serving alongside its to-be successor [[Centurion Mk 3|Centurion tank]]. Though the Centurion was adopted in 1949, the Comet I continued to see service in the British Army until 1958, when it was then decommissioned and sold to foreign countries, which included South Africa, Finland, Ireland, Cuba, and Myanmar. Notable records with the Comet I sales were 41 tanks to Finland, which used them until 1970 and kept them in storage for much longer. In 1959, 4 were sent to Ireland and another 4 the following year, the Irish kept them until 1973 before being withdrawn.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=uk_a_34_comet Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|aXLxiqyUgnM|'''{{PAGENAME}} Tank Review''' - ''NUSensei''|oc_Z6gHeFCA|'''Comet A34 British Cruiser Tank''' - ''MilitArmy''|xhJr7xcFfsY|'''Tank Chats #115''' - ''Tank Museum''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/devblog/current/852|[Devblog] A34 Comet I and A30 Challenger]]\n* [[wikipedia:Comet_(tank)|[Wikipedia] Comet (tank)]]\n* [https://tanks-encyclopedia.com/ww2/gb/a34-cruiser-tank-comet-mark-i <nowiki>[Tanks Encyclopedia]</nowiki> Comet, Cruiser Tank, A34]\n\n{{TankManufacturer Leyland}}\n{{Britain medium tanks}}"}}