{"title":"IS-1","pageid":921,"wikitext":{"*":"{{Specs-Card\n|code=ussr_is_1\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Soviet heavy tank {{Battle-rating}}. It was introduced during the closed beta testing for Ground Forces before Update 1.41. It is the first unlockable IS series heavy tank.\n\nOperational and visual characteristics of the IS-1 retain the visual and operational similarities to the previous KV line of heavy tanks of which it is descended from. Players experienced in operating previous models of the KV series of tanks should have little to no difficulty in adjusting to this vehicle. Unlike its predecessor, the IS series of tanks are designed with a priority of engaging enemy armoured vehicles in mind and as such, come with increased yet more sloped armour than its KV predecessors whilst sporting a slightly longer chassis, more powerful 85 mm D-5T gun and a larger, rounded turret.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n'''Armour type:'''\n\n* Cast homogeneous armour (Front hull, Turret)\n* Rolled homogeneous armour (Rear hull, Gun mantlet)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front !! Sides !! Rear !! Roof\n|-\n| Hull || 120 mm (35°) ''Front plate'' <br> 60 mm (75°) ''Front glacis'' <br> 100 mm (28-36°) ''Lower glais'' || 100 mm (11-27°)''Top front'' <br> 90 mm (11°) ''Top rear'' <br> 90 mm ''Bottom'' || 60 mm (48°) ''Top'' <br> 60 mm (35°) ''Lower'' || 30 mm\n|-\n| Turret || 100 mm (0-89°) ''Turret front'' <br> 100 mm (4-59°) ''Gun mantlet'' || 100 mm (19-21°) || 100 mm (2-36°) || 30 mm <br> 35 mm ''Turret hatches''\n|-\n| Cupola || 90 mm || 90 mm || 90 mm || 35 mm\n|-\n|}\n'''Notes:'''\n\n* Suspension wheels are 20 mm thick and tracks are 30 mm thick.\n* Though the front plate is 120 mm thick, it is not very sloped in comparison to the front glacis. Despite front glacis, 60 mm thickness, slope effect up to ~130 mm and ricochet chances improve protection.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=671|rbMinHp=460}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|D-5T (85 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[D-5T (85 mm)|85 mm D-5T]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 59 || rowspan=\"2\" | -5°/+25° || rowspan=\"2\" | ±180° || rowspan=\"2\" | N/A || 11.33 || 15.68 || 19.04 || 21.06 || 22.40 || rowspan=\"2\" | 9.62 || rowspan=\"2\" | 8.51 || rowspan=\"2\" | 7.84 || rowspan=\"2\" | 7.40\n|-\n! ''Realistic''\n| 8.33 || 9.80 || 11.90 || 13.16 || 14.00\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | '''Penetration @ 0° Angle of Attack (mm)'''\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| BR-365K || APHE || 148 || 143 || 126 || 106 || 90 || 77\n|-\n| BR-365A || APHEBC || 135 || 133 || 125 || 115 || 106 || 97\n|-\n| BR-365P || APCR || 195 || 187 || 154 || 120 || 94 || 74\n|-\n| O-365K || HE || 10 || 10 || 10 || 10 || 10 || 10\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| BR-365K || APHE || 792 || 9.2 || 1.2 || 14 || 73.92 || 47° || 60° || 65°\n|-\n| BR-365A || APHEBC || 792 || 9.2 || 1.2 || 14 || 164 || 48° || 63° || 71°\n|-\n| BR-365P || APCR || 1,050 || 4.99 || N/A || N/A || N/A || 66° || 70° || 72°\n|-\n| O-365K || HE || 793 || 9.54 || 0.1 || 0.3 || 660 || 79° || 80° || 81°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 2.13.0.53''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''59''' || 55&nbsp;''(+4)'' || 37&nbsp;''(+22)'' || 27&nbsp;''(+32)'' || 21&nbsp;''(+38)'' || 11&nbsp;''(+48)'' || 1&nbsp;''(+58)'' || No\n|-\n|}\n'''Notes''':\n\n* As they are modeled by sets of 2, shells disappear from the rack only after you've fired both shells in the set.\n* Turret empty: 37&nbsp;''(+22)'' shells.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|DT (7.62 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[DT (7.62 mm)|7.62 mm DT]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 1,890 (63) || 600 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nAs the tank's design purpose suggests, the IS-1 is a heavy tank built with an emphasis on engaging hostile armoured vehicles as well as a breakthrough tank. The tanks heavy armour has similar properties of its previous KV-1 line, but the introduction of sloped armour on the front plate and turret mantlet can allow operators to withstand a significant amount of damage at most ranges, especially when armour is angled. The fast reloads speed of the 85mm gun (on par with its T-34 and KV-85 mounted sisters) also allows it to be an effective brawler in close quarters combat against multiple targets. When encountering better-protected targets, the IS tank (although equipped with the same type of cannon) has access to APCR rounds to better deal with heavier opponents, something the KV and T-34 models lack.\n\nAlthough classified as a heavy tank and an upgraded improved design over the KV predecessor, the tank is not invulnerable. The vehicle's armour thickness is quite effective in its class.  Unlike its Tiger rivals and KV predecessors, the IS-1 has better or equal thickness armour on almost all sides except the rear hull and is sloped increasing the chance of ricochet and damage reduction when struck. Of note is the large turret and exposed turret mount which is commonly targeted at engaging hostile vehicles from the front. Armaments and ammunition options aside, the IS tank can perform similarly if not better at engaging targets than the common T-34, albeit with more satisfactory armour protection, able to allow users to lead a charge from the front with relative confidence or provide fire support from the sides or rear. This tank is quite sufficient in holding its own on the battlefield in many situations where a lighter vehicle cannot.\n\nAnother significant note of this vehicle is its considerably fast reverse rate, the highest of its Rank and Battle-Rating for the nation's faction, topping at 17 km/h. During situations where close-quarters engagement is expected, an unorthodox strategy can be utilized when the operator of the IS tank re-positions the vehicle 90 degrees and drive in reverse towards the enemy. By driving in reverse with the rear-facing the opposition, the engine blocks make a crude yet somewhat effective shield and protecting the more delicate crew. As the fuel tanks are mostly stored at the front on the left and right side of the driver's station, the risk of fire and fuel-tank explosion is reduced significantly (but not completely eliminated) and thus, the tank is able to resist even the most powerful of shots. Be aware that more experienced players may attempt to instead fire at the more exposed turret of the IS tank and instantly knocking out the crew with a common APHE penetrating the shell.\n\nWhen engaging the common Tiger tank and Panzer IV models, each of these vehicles retains the design flaw of 90 degree flat armour plates on the front and sides of each respective vehicle. The IS-1's 85 mm cannon should have little no difficulty in penetrating this and destroying the opposition's vehicle in a single shot if this weakness is exploited. The Panther and occasional Tiger II models are more considerably dangerous and difficult to dispatch when encountering them head-on due to the thicker and sloped armour of which the 85 mm cannon of the IS-1 cannot penetrate. In head-on engagements, operators of this vehicle should note to precisely target the right and left side turret mantlet of each respective vehicles instead. Time expended in attempting to find a penetration confirmation indication on the cross-hair when inspecting the sloped front plate is time wasted and instead, should be diverted on precise targeting of the mantlet.  Other more common tanks such as opposition USSR KV, IS and T-34 models are usually less of a concern than the common Panther tank, as most of these respective tanks also inherit the weakness of somewhat slopped frontal chassis and turret armour which can be easily penetrated even from significant distances with a precise aim.\n\nIf you are to apply bushes onto the IS-1, consider putting most of them on upper frontal hull and the curved sides next to it. This is because that quite some opponents will automatically target the curved armour, knowing that area is a common weak spot when the IS is angling. By covering up the hull front and the curves, the IS's frontal hull will now look flatter, somewhat resembling the hull of an IS-2 1944. This will cause some confusion and delay the enemy's reaction & aiming time, as they now cannot directly see where your curved armour is, gifting you a precious few seconds before they open fire. For any leftover bushes, the turret front and the lower front plate are also good spots to put them on.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Good armour\n* Extremely durable against in down-tiered battles (when encountering lower rank M4 Shermans, Valentines, Pz.IV etc.)\n* Re-positioning of fuel tanks reducing chances of fires.\n* Good mobility with a fast reverse speed\n* Sufficient firepower\n** High rate of fire\n** Ability to fire APCR\n* Player skill compatibility between older and newer KV and IS models\n\n'''Cons:'''\n\n* Large tank (slightly longer than the KV-1)\n* Difficult to angle armour due to weaker hull cheeks\n* Turret cheeks are easy to penetrate even at long distance\n* Commander cupola is a big weak spot\n* Poor gun depression (a common trait in all Soviet tanks)\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n===Development===\nThe start of the development for a new heavy tank in the Red Army came from the many criticisms of their current heavy tank, the [[KV-1 (ZiS-5)|KV-1]]. The KV-1 had poor mobility and a lack of firepower and armour advantage over the standard [[T-34 (1942)|T-34]], plus the KV-1 was more expensive to produce for no real advantage. Attempts to remedy this problem produced the ''KV-1S'' and the ''[[KV-85]]'', which tried to make the KV-1 more mobile, more ergonomic, and have better firepower. Though they were improvements over the original KV-1 design, it was already determined that the KV-1 designs are to be replaced by a new heavy tank design and the newer KV-1 developments were to be interim designs until the heavy tank development is complete.\n\nThe heavy tank project, code-named ''Object 237'', had its basis from the cancelled KV-13 program and was restarted from the discovery of the [[Tiger H1|Tiger I]] after one was captured in Leningrad, thus it began in January 1943. However, despite the ensuing development, the intense tank fighting in 1943 in Kursk and ensuing operations forced the Object 237 to see action early, with its turret used on the KV-85, which itself was built atop the KV-1S hull. The turret mounted the new 85 mm D-5T gun and would be a great firepower advantage enjoyed by the Soviet tank forces as it gave them a heavy tank with comparable firepower to the Tiger I's 88 mm cannon. At the end of 1943, the Object 237 project was finished and was accepted into service as the '''IS-85''', or the '''IS-1''', named after Iosef (Joseph) Stalin, the current leader of the Soviet Union during World War II, putting an end to the Voroshilov (KV) line of tanks. The IS-1 began to be delivered in October 1943 and went into service in the same month. The IS-1 stayed in service until January 1944, when its production also ended with about 200 units produced.\n\n===Combat usage===\nThe IS-1, like the KV-85 before it, was a great assist to the Soviet tank forces, giving them a heavily armoured tank with a great 85 mm gun that could defeat most of the German tanks in service except their heaviest ones such as the [[Tiger E|Tiger I]] and the [[Panther D|Panther]] tanks. The IS-1 was issued to Guards Heavy Tank Regiments for service, most notably the 1st, 8th, and 13th Guards Heavy Tank Regiments which saw service in Ukraine and Slovakia.  Within a standard IS-1 issue tank, there were often 59 85 mm rounds and 2,500 rounds for the three DT machine guns, which allowed it to have both superior armaments and capacity compared to the standard [[Tiger E|Tiger I]].\n\nThe IS-1 had a short-lived production due to advances in Soviet tank technology. Their standard [[T-34 (1942)|T-34]] medium tanks were upgraded with the same 85 mm gun on the IS-1 into the [[T-34-85]]. The lack of firepower advantage the IS-1 now presented due to this upgrade prompted an up-gunning of the IS tank with a much bigger gun. After further development in late 1943, the IS-1 evolved into the [[IS-2]], which has the larger and much more powerful 122 mm A-19 gun.\n\n=== In-game description ===\nThe IS-1 was developed in the spring and summer of 1943 by factory No. 100's design bureau led by Z.Y. Kotin. The tank's hull design and overall layout were taken from the previously developed experimental KV-13 tank. The main priority was creating reliable protection against the German 88 mm Flak 18 artillery cannon and making considerable mobility improvements by reducing the tank's mass and introducing a new epicyclic gearbox. The results of battles in 1943 revealed the need for a new heavy assault tank to replace the outdated mass-produced KV tanks. The prototype, designated IS, was built, tested and put into service in the Red Army in July-September 1943. Thanks to its new gearbox and the more streamlined placement of its strengthened armour, the new tank possessed superior mobility.\n\nThe IS's tight layout in its habitable section meant that a fifth crew member - the gunner/radio officer - would not fit inside. His duties were distributed between the commander and the driver.\n\nThree crew were housed in the turret: the tank commander and the driver worked to the left of the gun, and the loader to the right. A command cupola with 82 mm thick vertical armour was installed in the tank's turret, and its hull had a hatch leading to the underside of the tank to allow the crew to evacuate in an emergency.\n\nThe IS-1 was armed with an 85 mm D-5T Mod. 1943 tank cannon and three machine guns.\n\nIt entered mass production in October 1943 at the ChKZ factory. In total, 130 of them were built.\n\nThe IS-1 was deployed in battles from February 1944 up to and including the winter of 1945. The results of these battles led to the conclusion that the armament and armour of the new tank were not equal to those of German heavy tanks. At that time, it was recommended that the shape and armour of the frontal hull be changed and the tank's armament upgraded immediately.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [http://live.warthunder.com/feed/camouflages/?q=%23is1 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com]\n\n;Videos\n{{Youtube-gallery|EyD1M_Mi-dw|'''The Shooting Range #61''' - ''Pages of History'' section at 09:02 discusses the IS-1.|msh0K_NbTN0|'''The IS Family'''  - ''War Thunder Official Channel''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n=== References ===\n<references />\n\n{{TankManufacturer ChTZ}}\n{{USSR heavy tanks}}"}}