{"title":"IS-2 (1944)","pageid":923,"wikitext":{"*":"{{About\n| about = Soviet heavy tank '''{{PAGENAME}}'''\n| usage = other versions\n| link = IS-2 (Family)\n}}\n{{Specs-Card\n|code=ussr_is_2_1944\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Soviet heavy tank {{Battle-rating}}. It was introduced during the Closed Beta Test for Ground Forces before [[Update 1.41]].\n\nThe IS-2 mod. 1944 was created after the initial disadvantages of the previous [[IS-2]] model (IS-2 mod. 1943), being vulnerable against the 75 mm guns of the German StuGs and Panzer IVs due to the nearly flat frontal armour. The Soviet high command then decided to produce another version of the IS-2 with a heavily sloped armour plate, generally known as the IS-2 mod. 1944. It was used successfully on the Eastern front until the end of the war and is remembered as one of the mightiest tanks of World War 2.\n\nIn the game, the IS-2 (1944) sits at a BR which is higher than the first [[IS-2]]. It now features a mighty frontal plate, sloped at 61° backwards and also a 12.7 mm DShK machine gun on top for AA-defense. It has the same gun as its predecessor, but even at a higher BR, it is one of the most destructive guns in the game, with high penetration and devastating post-penetration damage. \n\nAnother unique aspect of the IS-2 (1944) is that it is the only of the two non-premium WW2 vehicles in the Soviet Tree with an researchable add-on armour package, which can be also found on the gifted [[T-34-85E]], made out of iron beds, which stop occasional HEAT shell.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n[[File:IS-2 1944 Screenshot 1.jpg|thumb|IS-2 (1944) on [[Finland]].]]\nThe armour, while having a nigh-impenetrable front plate and a decent turret, has many weak spots.\n\nFirst, there is the right part of the turret because while on the left side the gun mantlet is connected to the turret armour, there is no mantlet on the right-hand side, so it has just half the thickness of the left side.\n\nNext, we have the lower glacis, which is a very prominent target, with very little armour for its BR (~130 mm effective thickness). Shots of a German 88 mm or an American 90 mm will wreak your IS-2 (1944).\n\nLast but not least, we have the driver's hatch. While not as prominent as the first two mentioned, many experienced players will go for a shot right here, when you are hull-down. With around 120 mm effective thickness, it is really easy to penetrate even with small guns such as the American 76 mm and has a devastating effect on your tank.\n\n'''Armour type:''' <!-- The types of armour present on the vehicle and their general locations -->\n<!-- Example: * Rolled homogeneous armour (Front, Side, Rear, Hull roof)\n* Cast homogeneous armour (Turret, Transmission area) -->\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || ___ mm || ___ mm ''Top'' <br> ___ mm ''Bottom'' || ___ mm || ___ - ___ mm\n|-\n| Turret || ___ - ___ mm ''Turret front'' <br> ___ mm ''Gun mantlet'' || ___ - ___ mm || ___ - ___ mm || ___ - ___ mm\n|-\n| Cupola || ___ mm || ___ mm || ___ mm || ___ mm\n|-\n|}\n\n'''Notes:''' <!-- Any additional notes which the user needs to be aware of -->\n<!-- Example: * Suspension wheels are 20 mm thick, tracks are 30 mm thick, and torsion bars are 60 mm thick. -->\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp= 671|rbMinHp= 460|AoAweight= 0.15}}\n\nThe forward and reverse acceleration on the {{PAGENAME}} is quite superb even when stock. However, the {{PAGENAME}} suffers especially when attempting to turn. Speed will bleed out very quickly when turning, this can lead to difficulty when attempting to turn at low speed and so will require the tank to move forwards until it reaches a good speed to turn adequately to respond to any targets not at the direct hull front.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nWhen researching the first modifications, it's a priority to research Parts and FPE (you may want to activate several universal back-ups to be able to respawn twice in one match if you really wish to upgrade this vehicle quickly).\n\nGeneral stock advice:\n* Don't show your rear to any enemies, because a single fire will be your death.\n* Your gun is still very effective, so don't be afraid to attack enemies frontally, just make sure to aim for weak spots if possible.\n** Shooting at planes in Arcade with your machine gun (or main gun) and scoring some hits can often award you a kill if the plane crashes, which grants points.\n* Play as a support tank - push with your team and let them take fire, then poke out and take your shots, then retreat back into cover.\n* Try to push into objectives with your team to gain those points as well.\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n[[File:IS-2 1944 Screenshot 2.jpg|thumb|IS-2 (1944) on [[Finland]].]]\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|D-25T (122 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[D-25T (122 mm)|122 mm D-25T]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 28 || rowspan=\"2\" | -3°/+20° || rowspan=\"2\" | ±180° || rowspan=\"2\" | N/A || 11.33 || 15.68 || 19.04 || 21.06 || 22.4 || rowspan=\"2\" | 27.1 || rowspan=\"2\" | 23.92 || rowspan=\"2\" | 22.05 || rowspan=\"2\" | 20.8\n|-\n! ''Realistic''\n| 8.33 || 9.8 || 11.9 || 13.16 || 14.0\n|-\n|}\n\n===== Ammunition =====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | '''Penetration @ 0° Angle of Attack (mm)'''\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| BR-471 || APHE || 205 || 201 || 183 || 162 || 144 || 128\n|-\n| BR-471B || APHEBC || 205 || 203 || 191 || 178 || 166 || 155\n|-\n| OF-471 || HE || 37 || 37 || 37 || 37 || 37 || 37\n|-\n|}\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| BR-471 || APHE || 795 || 25 || 1.2 || 19 || 246.4 || 47° || 60° || 65°\n|-\n| BR-471B || APHEBC || 795 || 25 || 1.2 || 19 || 246.4 || 48° || 63° || 71°\n|-\n| OF-471 || HE || 800 || 25 || 0.1 || 0.1 || 3,600 || 79° || 80° || 81°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_IS-2.png|right|thumb|x250px|[[Ammo racks]] of the IS-2]]\n<!-- '''Last updated: 2.5.1.85''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! Ammo<br>part\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''28''' || ''Projectiles'' <br> ''Propellants'' || 13&nbsp;''(+15)'' <br> 27&nbsp;''(+1)'' || 1&nbsp;''(+27)'' <br> 24&nbsp;''(+4)'' || N/A <br> 21&nbsp;''(+7)'' || N/A <br> 11&nbsp;''(+17)'' || N/A <br> 6&nbsp;''(+22)'' || N/A <br> 1&nbsp;''(+27)'' || No\n|-\n|}\n'''Notes:'''\n\n* The {{PAGENAME}} uses two-piece ammunition, composed of projectiles (yellow) and propellant bags (orange). Both have separate racks.\n* Shells are modeled individually and disappear after having been shot or loaded.\n* Centre floor rack emptied: 11&nbsp;''(+17)'' shells.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n{{Specs-Tank-Weapon|3}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|DShK (12.7 mm)|DT (7.62 mm)}}\n\nThe machine gun armament of the {{PAGENAME}} is vastly improved from the [[IS-2|previous iteration]] due to the presence of a 12.7 mm DShK machine gun on a pintle-mount. This allows not only a better ability to defend against aircraft, but as an alternative offensive capability to the slow-firing 122 mm gun. Penetrating more than 20 mm of armour from at maximum 500 m, the DShK is great to attack lightly armoured vehicles. The coaxial gun in this case has little use aside from an harassing tool against an armoured enemy or foliage clearing device against fences that may be in the way. Still, these two machine guns should not be neglected from the arsenal of the {{PAGENAME}}.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[DT (7.62 mm)|7.62 mm DT]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 1,890 (63) || 600 || N/A || N/A\n|-\n|}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[DShK (12.7 mm)|12.7 mm DShK]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Pintle || 250 (50) || 600 || -10°/+60°|| ±180°\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).''  -->\nThe IS-2 (1944) is a definite improvement on its predecessor, the [[IS-2]]. Most notably the frontal armour now features a slope, which can bounce or outright block some rounds, although the 0.6 Battle Rating increase seems slightly too much. This iteration of the IS-2 also features a roof-mounted machine gun that can be used to attack aircraft without moving your turret (by using weapon selection keys set in the controls). Otherwise, the IS-2 (1944) is identical to the IS-2.\n\nIf you are to apply bushes onto the IS-2 (1944), consider putting most of them on the curved sides next to the upper glacis. You can even leave the upper glacis exposed, as it is very tough. This is because that quite some opponents will automatically target the curved armour, knowing that area is a common weak spot when the IS is angling. By covering up these curves, it will cause some confusion and delay the enemy's reaction & aiming time, as they now cannot directly see where your curved armour is, gifting you a few precious seconds before they open fire. For any leftover bushes, the turret front and the lower front plate are also good spots to put them on.\n\n[[File:IS-2 1944 Screenshot 3.jpg|thumb|IS-2 (1944) on [[Finland]].]]\n\n=== General Gameplay ===\nAt its BR, you will face the Tiger II (H) a lot, as well as much more heavily armoured vehicles such as the Jagdtiger, the Ferdinand, the T32 and the T95 (in an uptier). These tanks are near-impossible to penetrate frontally, so you will have to try to flank them. Otherwise, the gameplay remains the same as with the previous IS-2.\n\nOverall, you shouldn't over-extend into enemy territory because your reload is still slow; you should play off of your teammates and use your great reverse speed to get out of line of sight as soon as you shot, or have been shot; you should have fun with the 122 mm gun that blows roofs off of most enemies you penetrate. Flanking is best done in Arcade, while in Realistic you're better of setting up ambushes at a medium distance away from main pathways.\n\n==== Arcade Battles ====\nIn Arcade, the IS-2 (1944) proves to be quite mobile when fully upgraded. This can be used effectively to get into superior positions to engage enemies early in the match when they haven't yet set-up camp in well-covered positions and/or presented their strongest armour. Thus, it's easy to gain a kill at the start of the match, if you are comfortable with the 122 mm gun.\n\nClose quarters combat proves even more deadly in Arcade Battles because all opposing vehicles will be able to easily overrun a single IS-2 (1944), especially after it has shot and is now waiting through it long reloads (20 seconds). Hence why it's advised to use your improved reverse speed to quickly disengage after shooting and retreating towards your teammates, who will likely be able to return fire. If the map forces you to fight in close quarters, attempt to get into a position where your teammates can cover your sides, while you can face forwards and clear the road. If the map allows, you can try taking 5 rounds of ammunition and camp at a capture point (usually one that's given to your team) to snipe all enemies that enter your line of sight while reducing your chances of blowing up at the first incoming shot.\n\nIn rare cases, it's possible to rush with the IS-2 (1944) and surprise lighter vehicles at a contested capture point in the early stages of a game. This strategy relies on the capture point being unpopular and being lucky to face only one enemy vehicle at a time. Some light tanks are unable to penetrate the IS-2 (1944) frontally, especially if they are from a much lower rank (e.g. [[BT-7]], the [[Sd.Kfz.234/2|Puma]] or the [[R3 T20 FA-HS|R3]]), so that's an added benefit of being a decently mobile heavy tank. If successful, the IS-2 (1944) can then flank to other objectives or advance to the enemy spawn to destroy another enemy or two. You shouldn't expect a lot of easy targets with this strategy, because it exposes your tank to potentially a lot of enemy fire.\n\n==== Realistic Battles ====\nIn Realistic, the IS-2 begins to feel like a heavy tank. Its mobility is heavily reduced and its speed is outmatched by practically everything, mostly due to poor acceleration off-roads. However, this should be used as an advantage to gauge where the enemies are set-up, by looking where your teammates are killed from. You can then decide to return fire, although sometimes opponents don't show themselves until later in the match, in which case you should stay passive and try to remain behind your team's front lines.\n\nDue to generally increased map size in Realistic, you will have to get comfortable with the bullet drop. There is an added benefit to that because the following [[IS-3]] and [[IS-4M]] mount the same gun (as does [[T-44-122]] and [[KV-122]], if you have them), and [[T-10M]] has similar bullet drop. Now, the IS-2 performs decently well at longer ranges, but it will cost you a lot if you miss or don't penetrate, because the reload is so long. Often, you will need to rely on the rangefinder, the teammates or map knowledge to gauge how high you need to shoot, so it might be a great idea to take out another vehicle first (such as the [[T-44]] or [[T-34-85]]) remember the distance and then take the IS-2 out. However, on larger maps, it is generally a better idea to take out other vehicles.\n\nA more reliable strategy for the IS-2 is to camp nearby an objective and pick off any enemies who pose a threat. Just make sure to find a flat spot with cover, because your poor gun depression and long reload will be your death in hilly or open areas. It's also a good idea to target heavy enemies, because they are easier to hit, and also will likely pose a larger threat to your general team (e.g the [[Ferdinand]], the [[Ho-Ri Production|Ho-Ri]] or the [[Tiger II (H)]]).\n\n====General Tactics====\n<!--Specific methods of play in different situations, label the methods with pros and cons (if possible) based on vehicle's performances (i.e. Using the M22 Locust and getting close to the target so gun depression cannot reach it.)-->\nAlthough classified as a heavy tank and an upgraded improved design over the KV predecessor, the IS-2's armour will no longer hold up to its more common and heavier opponents at its BR. Compared with other vehicles such as the new German Tiger II, American heavy T-series tanks; most of which can easily deflect even the most powerful shots of the IS-2 unless targeted specifically and known weak spots. Because of this, it is recommended to always travel and fight in groups of two or more vehicles. The slow and difficult in the manoeuvring of the vehicle (especially in confined spaces) will more than once place the IS-2 in significant danger. It is recommended to field the IS-2 into a fire-support role, peeking over the shoulder of friendly, more heavier vehicles and firing a shot against the opposition in tandem.\n\nAnother significant note of this vehicle is the IS-2's considerably fast reverse speed, inherited from its IS-1 predecessor, topping at 17 km/h. During situations where engagement is expected, an unorthodox strategy can be utilized where the operator of the IS-2 tank re-positions the vehicle 90 degrees and drive in reverse with the rear-facing towards the enemy. By driving in reverse this way, the engine blocks make a crude yet somewhat effective shield to protect the more delicate crew members. As the fuel tanks are mostly stored at the front on the left and right side of the driver's station, the risk of fire and fuel-tank explosion is reduced significantly (but not completely eliminated) and thus, the tank is able to resist even the most powerful of shots. Be aware that more experienced players may attempt to instead fire at the more exposed turret of the IS tank and instantly knocking out the crew with a common APHE penetrating shell in this way.\n\nIn regards to shells, the D-25T cannon is also equipped with powerful High Explosive (HE) Shells which should not go ignored. Firing a HE shell with precise aim directly underneath the chassis of enemy vehicles were the armour, like on the top of the vehicle if thinnest, can cripple or instantly destroy said enemy vehicles. In rare instances, the HE shell of the D-25T is so powerful to the point two or more medium or heavy tanks close to each other can be destroyed with a single exploding HE Shell. Alternatively, the powerful armour-piercing capability of the D-25T cannon's APHE rounds has also been documented to pierce two or three light-armoured targets without exploding.\n[[File:Wsp volumetric shell diagram.png|thumb|Differences between non-volumetric shells and volumetric shells hitting a Tiger I]]\nAn important note when engaging tanks, especially Tiger I's, is that, with the implementation of volumetric shells, you can no longer expect your shells to pierce through small openings or right past an obstacle. The large 122 mm calibre of your shells will result in it catching on an armour plate's edge very often, losing all of its penetration. For example, a Tiger I has some edges that can absorb your shell unexpectedly, despite having flat armour. Thus you must always make sure that where you are aiming at is absolutely free of obstruction, or it may result in a non-penetration or a ricochet. This can be seen in the diagram to the right.\n\n=== Moving from IS-2 to IS-2 (1944) ===\nThis section will go into more detail about the differences between fighting with this machine, the challenge is that some of the enemies which can be faced are simply impenetrable frontally. You will have to either have to run or outflank them! However, it is critically important to watch your flanks, due to the other enemies which will also be facing, trying to outflank you and hit you in your sides!\nbecause of the saturation of good and highly mobile vehicles that other nations have at this Battle Rating such as: [[Ru 251]], [[Panther (Disambiguation)|Panther tanks]], [[Tiger II (H)]], [[Caernarvon]], [[T34]], [[AMX M4]] and many more.\n\n==== Specific Enemies Worth Noting ====\nThese are new (or common) vehicles you will see in this tank. Read the specific enemies section in the IS-2 article to get a full run-down.\n\n* ☠ T32 - You have to go for the MG port in the lower left of the UFP, otherwise you can only penetrate the side armour or the rear.\n* ☠ T28 - You can only penetrate the cupolas on top of the tank. If they're hidden or you are unsure about the shot, you can try hitting the cannon barrel and running away.\n* ☠ Ferdinand - Go for the angled armour at the sides of the lower front plate (below the casemate, but above the lowest plates), this will disable Ferdinand's engine and/or driver, so you can flank and finish it off.\n* ☠ Jagdtiger - You cannot reliably penetrate or damage this tank frontally. You can try disabling the cannon barrel, and then flanking is your best option (or running away).\n* ☠ Conqueror - Shoot the hull, don't shoot the turret.\n* ☠ Ho-Ri Production - You cannot reliably penetrate or damage this tank frontally. You can try disabling the cannon barrel and then flanking is your best option (or running).\n* ☠ AMX-50 Foch - You cannot reliably penetrate or damage this tank frontally. You can try disabling the cannon barrel and then flanking is your best option (or running).\n* T34 / T29 - Turret cheeks can work, although it's best to go for the LFP because the ammo storage is very low in the tank. If you don't see the LFP, try going just below the turret ring, where the driver sits.\n* Tiger II (H) / Panther II - You can easily penetrate the turret cheeks with BR-471B.\n* Panther D, A, G, F - You can penetrate the UFP <!-- It's right, but only if the panther isn't angled -->\n* Tortoise - Shoot to the right of the gun of the Tortoise, when you see it head-on if shoot on the left plate there is a chance to knock it out with a single shot.\n* AMX-50 Surbaissé - Go for the LFP.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Extremely powerful 122 mm gun. Can easily knock out any tank with a single shot\n* The top 122 mm APHE shell has good overmatching mechanics. Can go through the upper plate of the Panther at 500+ m fairly easily\n* The gunner has a decent set of optics with 4x magnification\n* Upper plate is as tough as the Tiger II's upper plate. Basically immune to anything that isn't HEAT or APDS\n* Has good mobility and a high top speed for a heavy tank\n* Has a roof mounted 12.7 mm machine gun. So dealing with lightly armoured vehicles and defending its self from planes is possible\n* Is a good flanker and ambushing tank thanks to its good top speed, armour, and massive gun\n* Add on spaced armour to protect the turret\n\n'''Cons:'''\n\n* Terrible reload speed. Getting into brawls with contemporary heavies like the Tiger II is ill-advised\n* Despite the good overall armour, has some serious weak spots on the turret\n* Horrible gun depression. Hill fighting is nearly impossible without exposing the entire tank\n* Has a massive, flat, and weakly armoured lower plate. All 6.0 and up tanks can slice right through\n* Very small crew compartment. Any APHE shell that pens it will likely kill everyone in the tank\n* Can't effectively side scrape due to its hull cheeks\n* The 12.7 mm machine gun isn't as potent as American .50 cal MGs due to the low mag size and low total carried ammo\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n{{main|IS-2#History|l1=History of the IS-2}}\n\n=== In-game description ===\nIn 1944, the IS-2 was modernised. The new model had a flattened sloping frontal hull, and a slot covered with a glass brick was installed to replace the driver's observation hatch. This increased the front hull projection's defences. A high-calibre 12.7 mm anti-aircraft DShK machine gun was attached on a trunnion fixed to the command cupola's traverse circle.\nThe turret could be rotated mechanically and electrically. With electric drive activated, its maximum speed reached 2.4 revs/min.\n\nThe IS-2 was advantageous for its economy and relatively low material requirements in general. With a mass of 46 t, the Soviet tank was far better protected than the German Panther. It also surpassed the 55 tonne Tiger I in this regard and was only somewhat inferior to the 68 tonne Tiger II. Its design had some serious flaws. Its tight layout meant that some of the fuel tanks had to be placed in the fighting compartment and there was no space for a driver's hatch, which often led to an injured tanker being unable to quickly leave a burning tank.\nOn the whole, the new tank met the leadership's expectations in full as a means of strengthening units and divisions intended to break through the enemy's preemptively well reinforced defensive lines and storm cities.\n\nIS-2 tanks were put into service in separate tank regiments which received the \"guards\" designation during their formation.\nManufacturing continued until 1946, and around 3,300 were made.\nAfter the war, the IS-2 was modernised and served in the Soviet and Russian armies until 1995.\nA small number of tanks of this model were given to China in the 50s. Later, some of these tanks were deployed in Vietnam.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=ussr_is_2_1944 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|0tRz1s5AL2M|'''IS-2: When 85 mm is not enough''' - ''Military History Visualized''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/2824--en|[Vehicle Profile] IS-2 Mod. 1944]]\n\n==References==\n<references />\n\n{{TankManufacturer ChTZ}}\n{{USSR heavy tanks}}"}}