{"title":"ISU-122 (China)","pageid":7404,"wikitext":{"*":"{{About\n| about = tank destroyer '''{{PAGENAME}}'''\n| usage = the other version\n| link = ISU-122\n}}\n{{Specs-Card\n|code=cn_isu_122\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese tank destroyer {{Battle-rating}}. It was introduced in [[Update 1.91 \"Night Vision\"]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n\nThe ISU-122 is inadequately protected against most enemy tanks. The vehicle is armoured mainly with 90 mm of rolled homogeneous armour (RHA), covering the sides, back and front glacis. The only thicker armour section (100 mm) covers the curved gun mantlet. Against tank guns, this level of protection is inadequate as the ISU-122's armour plates are all poorly angled and not of an enough thickness. The main frontal weakspot of the ISU-122 is the large piece of 90 mm superstructure armour plate and the lower front plate. These plates occupy most of the frontal silhouette, and a penetration through there is very fatal. Other areas are harder to penetrate: the huge spherical gun mantlet might bounce/absorb some shells sometimes (still, never rely on that), and the outmost side armour of the superstructure form a very steep angle, bouncing most projectiles. Against most SPAA the ISU has very reliable armour, as most SPAAs' penetration are lower than 60 mm. The top of the vehicle is armoured with 30 mm of RHA, meaning that common aircraft armaments (e.g. [[M2 Browning (12.7 mm)|12.7 mm M2]], [[MG 151 (20 mm)|20 mm MG 151]], [[Ho-5 (20 mm)|Ho-5]]) will not penetrate it with ease.\n\nIn terms of survivability, the ISU-122's five crew members are somewhat spread out, meaning that with a frontal penetration by an explosive-filled shell, the chances of an instant crew-knock are smaller. The large gun breech can also block some shrapnel for the crew on one side. But with a side shot through the superstructure, or if a large-calibre shell penetrates, the crew are very likely to get knocked out instantly.\n\n'''Armour type:'''\n\n* Rolled homogeneous armour\n* Cast homogeneous armour (Gun mantlet)\n\n{| class=\"wikitable\"\n!Armour\n!Front\n!Sides\n!Rear\n!Roof\n|-\n|Hull\n|60 mm (75°) ''Front glacis''\n90 mm (31°) ''Lower glacis''\n|90 mm\n|60 mm (50°) ''Top''\n60 mm (39°) ''Bottom''\n|30 mm\n|-\n|Superstructure\n|90 mm (30°) ''Front glacis''\n65 mm (7-69°) ''Gun mantlet case''\n100 mm ''Gun mantlet'' (0-45°)\n|75 mm (14-15°)\n|60 mm\n|30 mm\n|}\n'''Notes:'''\n\n* Suspension wheels are 20 mm thick while tracks are 30 mm thick.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp= 739|rbMinHp= 460}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|A-19 (122 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[A-19 (122 mm)|122 mm A-19]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 30 || rowspan=\"2\" | -3°/+22° || rowspan=\"2\" | -3°/+7° || rowspan=\"2\" | N/A || 6.16 || 8.53 ||10.40||11.50|| 12.19 || rowspan=\"2\" | 26.00 || rowspan=\"2\" |23.00|| rowspan=\"2\" |21.20|| rowspan=\"2\" | 20.00\n|-\n! ''Realistic''\n| 4.17 || 4.90 ||6.00||6.60|| 7.00\n|-\n|}\nThe ISU-122, like the ISU-152, is a vehicle created by adapting an artillery field gun design on an armoured vehicle. The A-19 gun has the same good ballistic characteristics  as the 122 mm on the IS-2 (flat trajectory, high muzzle velocity, accuracy at long range) and the same available ammunition choice.\n\nThe gun stays reliably accurate until 1,300 m distance. Beyond 1,000 m your optics will limit your accuracy as your magnification is poor (unless you fire at huge targets like Ferdinand, Jagdtiger, Tiger II, etc.). The high muzzle velocity of your shells grants you pretty flat firing trajectories and thus helps fire at moving targets from a distance. In that regard, using the \"sight distance control\" feature can increase your chances of successfully hitting enemy tanks.\n\nThe gun has a limited traverse on the horizontal axis. That displacement is asymmetrical due to the commander's position limiting rotation towards the left side. This can make the tracking of a target difficult as the gun quickly reaches a stop. You should take that constraint into account when positioning your hull at a firing spot.\n\nAdditionally, the rotation speed is very slow compared to other tanks at the same rank or battle rating who can aim their gun in average 2 to 3 times faster than you do. Which means your targeting process will be longer than for other tanks if you aim to be accurate. Any enemy appearing outside of the area your gun covers will require hull movement and will make you restart your targeting process from 0.\n\nBeing originally an artillery field gun, the gun uses two-piece ammunition with projectiles and propellant bags. The breech mechanism was not designed to be operated by a limited crew inside a casemate, which explains the very long reload time (between 19 and 26 seconds, which is on average 3 times longer than other vehicles' at the same BR).\n\nYour recoil is important but not powerful enough to throw your gun off target after firing: the damping cylinders on the gun are too weak to absorb most of the recoil power and the suspension will absorb much of it. Your reload time being very long, the recoil is not as much of a handicap as it could be.\n\n==== Ammunition ====\nThe available choice of ammunition focuses on heavily armoured targets:\n\n* '''BR-471''': APHE; an armour-piercing shell with high explosive mass and high muzzle velocity that will knock out any tank it penetrates with a single shot.\n* '''BR-471B''': APHEBC; the same as the BR-471 but with increased penetration thanks to the ballistic cap. This shell can reliably penetrate the frontal glacis of a Panther from over 700 m.\n* '''OF-471''': HE; for destroying open and lightly armoured vehicles. While it is a standard shell for a Soviet vehicle, prioritize using your heavy machine gun to deal with lightly armoured targets because of the long reload time of the {{PAGENAME}}.\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| BR-471 || APHE || 205 || 201 || 183 || 162 || 144 || 128\n|-\n| BR-471B || APHEBC || 205 || 203 || 191 || 178 || 166 || 155\n|-\n| OF-471 || HE || 37 || 37 || 37 || 37 || 37 || 37\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| BR-471 || APHE || 795 || 25 || 1.2 || 19 || 246.4 || 47° || 60° || 65°\n|-\n| BR-471B || APHEBC || 795 || 25 || 1.2 || 19 || 246.4 || 48° || 63° || 71°\n|-\n| OF-471 || HE || 800 || 25 || 0 || 0.1 || 3,600 || 79° || 80° || 81°\n|-\n|}\n\n==== [[Ammo racks]] ====\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! Ammo<br>type\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''30''' || ''Projectiles''<br>''Propellants'' || 25&nbsp;''(+5)''<br>25&nbsp;''(+5)'' || 19&nbsp;''(+11)'' <br>19&nbsp;''(+11)'' || 13&nbsp;''(+17)''<br>17&nbsp;''(+13)'' || 7&nbsp;''(+23)''<br>9&nbsp;''(+21)'' || 1&nbsp;''(+29)''<br>1&nbsp;''(+29)'' || No\n|-\n|}\n[[File:Ammoracks_ISU-122.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n'''Notes''':\n\n* The {{PAGENAME}} uses two-piece ammunition, composed of propellant bags (orange) and projectiles (yellow). Both have separate racks.\n* To go into battle with the right flank depleted of propellant bags (racks 1 to 3), pack 17&nbsp;''(+13)'' shells.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|DShK (12.7 mm)}}\n\nThe 12.7 mm DShK heavy machine gun is located on a pintle mount and can act as both an offensive and anti-aircraft machine gun on the {{PAGENAME}}, giving it protection against aircraft and lightly armoured vehicles. Best use is within 500 m against lightly armoured vehicles. The 360° movement allows you to point quickly your MG in any given direction. However, the position of the MG high on the casemate and the poor depression angle make it difficult to shoot a low-profile tank when it is close.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[DShK (12.7 mm)|12.7 mm DShK]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Pintle || 250 (50) || 600 || -5°/+85° || ±180°\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\n; Offensive role\n\nThe ISU-122 should be played as a long range sniper, taking advantage of the APHEBC shell's high penetration values, high gun accuracy and good reverse speed. Find a shooting spot and engage targets from at least 1,000 m away to prevent enemy progress towards the objectives. You will also suppress enemy fire to prevent your team from being pinned down by enemy snipers attempting the same in return. Because of your high profile (casemate) and weak frontal armour, always stay away from the frontline to avoid being flanked or swarmed. While your gun is very powerful, your in-game performance will highly be dependent on the map you're playing. Open maps like Fire Arc, Kursk or Maginot Line will allow to play at the full extent or your capability whereas urban environments like Advance to the Rhine will be detrimental to your playstyle. In case you are playing a mixed map, privilege open spaces.\n\n; Defensive role\n\nIn case of an enemy breakthrough, your role is to contain the enemy advance by pinning them down. The enemy will be moving the front line, so engagements will take place at a closer range than you're comfortable with. You should identify and target in priority choke points, narrow passages and corridors of the map that the enemy will be forced to take. Your limited gun traverse only allows you to monitor an area spanning 175 m at 1,000 m distance without having to reposition your hull. Position the left side of your casemate behind an obstacle to let only your gun exposed.\n\n; Other roles\n\nIf you try to use the ISU-122 in a different role on the battlefield, you will be confronted with the following:\n\n* If you try to play as a front-line tank, you will be quickly disabled by any type of fire coming from enemy tanks. Your frontal armour is pretty thin for a tank at close range and a successful penetrating shot from the front will greatly handicap your crew sitting in line. Your gun traverse is very limited and your turning speed is also too poor to manoeuvre quickly enough in close combat.\n\n* If you attempt to play support tank, your high profile will make it difficult to stay hidden behind obstacles without taking fire. Your good reverse speed can be an advantage but the enemy will flush you out with artillery strike (which can be accurate enough from middle ranges to disable you). Even with an escape route planned and cover to hide behind, your chances of survival are meagre. You will also be at risk of being flanked by light tanks or armoured cars, especially if they swarm you. Anyone who manages to get behind you has a very high chance to destroy you. In that role, an undetected flanking enemy, artillery strikes or CAS will be great threats to the ISU-122.\n\n; Notable enemies\n\n* Any tank will disable you with little effort in a close range encounter because of your weak and vertical casemate armour.\n* For long range engagements, the cannons able to penetrate an ISU-122 from 1,000 m are:\n** USA: M4 tanks equipped with a long 76 mm gun, M36 GMC\n** Germany: any vehicle equipped with a 75, 88 or 128 mm gun like Panthers. Tigers I, Sturer Emil, etc.\n** USSR: any vehicle equipped with a 85, 122 or 152 mm gun like the IS-2, T-34-85, ISU-152, etc.\n** Great Britain: any vehicle equipped with APDS like the Comet, Challenger, Centurion & Charioteer\n** Japan: Chi-Ri II & US tank imports\n** China: vehicles similar to US and USSR ones\n** France: ARL-44\n** Sweden: Ikv 103 & Strv 74\n\n[[File:Wsp volumetric shell diagram.png|thumb|Differences between non-volumetric shells and volumetric shells hitting a Tiger I]]\nAn important note when engaging tanks, especially Tiger Is, is that, with the implementation of volumetric shells, you can no longer expect your shells to pierce through small openings or right past an obstacle. The large 122 mm calibre of your shells will result in it catching on an armour plate's edge very often, losing all of its penetration. For example, a Tiger I has some edges that can absorb your shell unexpectedly, despite having flat armour. Thus you must always make sure that where you are aiming at is absolutely free of obstruction, or it may result in a non-penetration or a ricochet. This can be seen in the diagram to the right.\n\n; Defeating an ISU-122\n\n* Wait for ISU-122 to shoot before engaging it: its long reloading time is a big weakness as it is defenseless for at least 15 seconds like an IS-2. It can however retreat quickly thanks to its good reverse speed. Be careful not to get baited into open field trying to follow your prey.\n* The ISU-122 has a rather thin armour when compared to tanks at the same BR: iIf you have a very high penetrating power, aim for the casemate.\n* In a frontal encounter, the right side of the frontal armour plate is the biggest weak spot. A successful penetration will most likely knock out 3 out of 4 crew members because they sit in line along that axis.\n* In a flanking manoeuvre, the center of the casemate is the place to shoot to knock most crew members out.\n* From behind, the left side of the casemate is the best spot to disable the ISU-122.\n* If you are alone, flanking a ISU-122 undetected remains your best chance to destroy it. But it is difficult because the ISU-122 ideally positions itself very far from the frontline.\n* Force it out of position with indirect fire (artillery strikes) if you're at relative close range.\n* In case of a frontal attack (choke point/corridor), try blinding the ISU-122 with smoke and then swarm it with several tanks to saturate its defensive capacities.\n* Engage the ISU-122 while it is moving: it takes a long time to brake, turn, bring the gun to a stable position and target precisely. With a reload time over 15 seconds, no player will take a shot that has little chance to hit.\n* Do not take pot shots or shoot on the move, aim precisely at the weak spots (casemate walls). Your chance of ricochet is increased at long range as your penetration power decreases and the ISU-122 can angle its hull in a defensive manoeuvre.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Deadly cannon provides superior destruction capacity of any target upon penetration\n* Powerful stock AP penetrates up to 205 mm which is very effective in a full up-tier; weak spots of the early Centurions, Ferdinand, Tiger II H can all get penetrated with ease\n* The huge gun mantlet and its complex armour layout is capable of deflecting quite some shells sometimes\n* 30 mm roof armour resists popular aircraft weapons well, like the 12.7 mm M2 with ground target belt and the MG 151\n* All-round protection provides good resistance against flanking SPAAs; the M19 / M42 are very common flankers\n* 14 km/h reverse speed allows it to retreat from danger quickly\n\n'''Cons:'''\n\n* Long reload of more than 20 seconds and the curved trajectory demands very precise aiming and can be a challenge to use for first-time users\n* Front armour is only 60-100 mm and is not well-angled; easily penetrated by common guns at the battle rating, like the 76 mm M1, 17 pdr, 75 mm and 88 mm\n* Closely packed crew all easily knocked out when an explosive shell penetrates\n* Very inadequate gun depression of -3° combined with the sluggish mobility makes it only capable of fighting in urban (flat) areas, but never the hills\n* Turretless layout and the sluggish mobility makes it very vulnerable to surprise flankers, for example, the infamous M18, T20, T25 and Puma\n* Gun breech often gets damaged while under enemy fire\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n'''Development'''\n\nWhen the [[ISU-152]] began production in 1943 with the large 152 mm ML-20S gun, production of the chassis and hull soon exceeded the supply of the ML-20S gun, which caused a decrease in the production of self-propelled guns for the Soviet military. It was determined to speed up self-propelled gun production, the ISU chassis were to be mounted with the 122 mm A-19S gun. Work on this mounting already began before the supply issue in December 1943 at the Chelyabinsk Kirov Plant (ChKZ), which had a design team simply take the ISU-152 chassis and hull and only changing out the armament with the 122 mm gun, but this prototype - ''Object 242'' - was not immediately put into production despite successful testings. When the supply issue arose, the prototype was then adopted by the Soviet Defense Committee for increased production and also that the 122 mm gun had better accuracy against tanks than the 152 mm gun. The ISU armed with the 122 mm gun, designated the '''ISU-122''', began production in April 1944.\n\n=== People's Liberation Army (PLA) service ===\n40 ISU-122 self-propelled guns were delivered to the People's Republic of China (PRC) in 1950, forming a total of ten regiments along with a multitude of other Soviet armour. Each regiment had a total of four ISU-122s in it. At least 6 ISU-122 vehicles took part in a military parade in Beijing in 1954.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=cn_isu_122 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|3nhMiYrqdu0|'''ISU-122 Tank Review''' - ''NUSensei''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Vehicles equipped with the same chassis\n* [[ISU-122]]\n* [[ISU-122S]]\n\n;Other vehicles of similar configuration and role\n* [[ISU-152]]{{-}}[[ISU-152 (China)]]\n* [[SU-122P]]\n\n== External links ==\n''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''\n\n{{China tank destroyers}}"}}