{"title":"Jagdpanther","pageid":864,"wikitext":{"*":"{{About\n| about = tank destroyer '''{{PAGENAME}}'''\n| usage = the premium version\n| link = Bfw. Jagdpanther\n}}\n{{Specs-Card\n|code=germ_panzerjager_panther\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} German tank destroyer {{Battle-rating}}. It was introduced during the Closed Beta Test for Ground Forces before [[Update 1.41]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\nThe armour of the Jagdpanther in itself is average but can be utilized to become extremely effective due to ricochet mechanics.\n\nLighter shells (i.e. 76 mm M1 from the Sherman, 88 mm L/56 from the Tiger I, 90 mm M3 from the Jackson/Pershing) will have issues with shells ricocheting off the front plate due to the angle of the tank's upper frontal plate. However, heavier and/or higher velocity shells (SU-152, IS-2, T29/T34 are examples of tanks that will not experience this problem very much) will not have this issue due to the weight or velocity compensating for the increased slope and penetrating anyway (that is not to say that these types of shells cannot bounce, it is just much rarer due to their weight and high velocities.)\n\nThe best way to use the Jagdpanther's armour is to find a small hill where you can angle the front of your tank upwards to where your gun can still fire back at incoming enemies, but also have your frontal armour maximized (due to the fact that your frontal armour will be at a higher angle for incoming shells, which will dramatically increase the odds of a shell ricocheting. ) Just be sure not to allow your bottom plate to be shown, as it is a potential weak point of the tank.\n\nThe side and rear armour of the Jagdpanther is extremely thin (AA guns often can penetrate) and should be protected at all costs (as your ammunition is also stored in the sides.)\n\n'''Armour type:'''\n\n* Rolled homogeneous armour\n* Cast homogeneous armour (Gun mantlet)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides (Slope angle) !! Rear (slope angle) !! Roof (Slope angle)\n|-\n| Hull || 80 mm (55°) ''Front glacis'' <br /> 60 mm (54°) ''Bottom glacis''|| 40 + 5 mm || 40 mm (24-26°) || 25 mm\n|-\n| Superstructure || Same as Hull || 50 mm (26-29°)|| 40 mm (36°) || 25 mm (85°)\n|-\n|}\n'''Notes:'''\n\n*Suspension wheels and tracks are 20 mm thick, though the interleaved pattern of the wheels provides cumulative 20 mm protection.\n*Tracks and lower side of the hull are covered by 5 mm thick armour plate, protecting them from HEAT and HE shells.\n*Rear parts of the upper side hull armour have tracks attached to it, adding additional 20 mm of armour.\n*Belly armour is 20 mm thick.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=994|rbMinHp=619}}\n\nThe {{PAGENAME}} has decent mobility overall, however, there is one major downfall to this vehicle: its extremely slow reverse speed. For this reason, the {{PAGENAME}} cannot relocate quickly so it is best to position your vehicle in a spot where repositioning won't be necessary.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|PaK43 (88 mm)}}\n\nThe main armament of the Jagdpanther is the 88 mm PaK43 gun, which is one of the best all-around tank weapons at its BR. With an 11-second reload stock, it is accurate as well as causing large amounts of damage during a penetrating hit, as it also contains explosive filler that detonates once inside the hull of the target.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[PaK43 (88 mm)|88 mm PaK43]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 60 || rowspan=\"2\" | -8°/+14° || rowspan=\"2\" | ±11° || rowspan=\"2\" | N/A || 7.04 || 9.75 || 11.84 || 13.09 || 13.93 || rowspan=\"2\" | 11.05 || rowspan=\"2\" | 9.78 || rowspan=\"2\" | 9.01 || rowspan=\"2\" | 8.5\n|-\n! ''Realistic''\n| 4.76 || 5.60 || 6.80 || 7.52 || 8.00\n|-\n|}\n\n==== Ammunition ====\n\n* '''PzGr 39/43''', APCBC: stock ammunition, is by far the most useful ammunition for this tank and should be the primary type you carry through your battles.\n* '''PzGr 40/43''', APCR: although on paper it appears to be a significant improvement in penetration capabilities, in reality it is often ineffective for two reasons:\n** The amount of damage the shell creates within the hull of tank upon penetration is very little, with little to no shrapnel being created by a penetration. This makes a direct hit onto a critical module (such as a gunner or an ammunition rack) a necessity for this projectile, which can be sometimes difficult depending on the enemy you are facing.\n** Although the stat card shows that the penetration does increase, due to the overall weight of the shell decreasing, sloped armour is much more difficult to penetrate (which at this battle rating is very common.) This makes this shell somewhat useless as a result, with the standard ammunition (PzGr 39/43) being far more effective against slopped armour.\n* '''Hl.Gr 39''', HEAT: it serves very little purpose, as it lacks enough penetration to penetrate tanks from the front (or even side at the battle rating of this tank).\n* '''Sprgr.43''', HE: it is ineffective against armoured targets, and should only either be carried for open-topped vehicles (SPAA/TD).\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| PzGr 39/43 || APCBC || 237 || 234 || 222 || 207 || 194 || 181\n|-\n| PzGr 40/43 || APCR || 279 || 273 || 252 || 227 || 205 || 185\n|-\n| Hl.Gr 39 || HEAT || 110 || 110 || 110 || 110 || 110 || 110\n|-\n| Sprgr.43 || HE || 14 || 14 || 14 || 14 || 14 || 14\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| PzGr 39/43 || APCBC || 1,000 || 10.16 || 1.2 || 14 || 108.8 || 48° || 63° || 71°\n|-\n| PzGr 40/43 || APCR || 1,130 || 7.3 || N/A || N/A || N/A || 66° || 70° || 72°\n|-\n| Hl.Gr 39 || HEAT || 600 || 7.64 || 0 || 0.3 || 1,100 || 62° || 69° || 73°\n|-\n| Sprgr.43 || HE || 820 || 9.4 || 0 || 0.1 || 1,000 || 79° || 80° || 81°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''60''' || 43&nbsp;''(+17)'' || 25&nbsp;''(+35)'' || 19&nbsp;''(+41)'' || 1&nbsp;''(+59)'' || No\n|-\n|}\n'''Note''':\n\n* Right side empty: 19&nbsp;''(+41)'' shells.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|MG34 (7.92 mm)}}\n\nThe machine gun on this tank is functional but is not powerful enough to cause any damage even to lightly armoured targets (such as AA vehicles). \n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[MG34 (7.92 mm)|7.92 mm MG34]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Hull || 3,000 (150) || 900 || -5°/+10° || -10°/+5°\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe Jagdpanther is best used defensively, to cover capture points and prevent their capture, and cover friendly tank advances. It's highly recommended to hide the lower frontal plate in this tank, as it has a frontal mounted transmission which will set the tank on fire if shot, as well as destroying the transmission. It's also strongly advised to use this tank at long range, and change position often.\n\nIt is important to keep in mind that the Jagdpanther's armour is sloped. Using it on the side of a hill facing the enemy is extremely dangerous since this would decrease the angle at which the frontal armour and sloped and thus negate a large part of its survival capabilities. By hiding behind buildings, trees and bushes, or on top of a hill, you optimise it's fighting capabilities. A well-positioned Jagdpanther is very hard to destroy. In addition, using the Jagdpanther in a diamond position (with your right side facing the enemy) will mean that your most important crew members are better protected (driver, gunner, commander) since they are on the other side.\n\n'''Enemies worth noting:'''\n\n* [[IS-2]], [[ISU-122]], [[SU-152|SU]]/[[ISU-152]]: The Jagdpanther relies on its frontal armour a lot to survive, so the biggest threats are generally the vehicles with high penetration. These machines with high calibre guns pose the biggest threat, as their APHEBC shells will slice through the Jagdpanther's frontal armour like butter, and their damage is more than enough to kill all the crew inside. Try and finish them off first before they see you. If they do, quickly go to a nearby cover and either call for help, or wait until they fire or get distracted.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Armed with the long 88 mm KwK43 gun. One of the best pound-for-pound guns in the game thanks to the great accuracy, penetration, damage potential, and rate of fire\n* The default APCBC shell has great accuracy, penetration, and damage potential at all ranges\n* Really good top speed and manoeuvrability. Makes getting into a strong early game position a breeze\n* The tank is based on the Panther chassis, meaning the frontal armour is really strong against guns packing less than 200 mm of penetration\n* Carries a large amount of smoke grenades\n* 5x Sight provides sufficient zoom for most engagements\n* Despite not having a turret, the tank still has good gun depression\n\n'''Cons:'''\n\n* Terrible reverse speed. Shoot and scoot tactics are nearly impossible to pull off\n* The hull armour is tough, but common enemy tanks like the [[Centurion Mk 3]] and [[IS-2]] laugh at the Jagdpanther's frontal armour\n* Terrible side armour. Angling is ill-advised\n* Like most tank destroyers it lacks a turret. Coupled with the terrible reverse speed, getting flanked is almost always a death sentence\n* Despite the 5 men crew, the crew compartment is small. Any APHE shell that penetrates the armour will likely knock out all the crew in one shot\n* Despite not having a turret, it's still a big tank. Finding proper concealment can be a challenge\n* Roof armour is weak. Attackers and even some fighters machine guns can be lethal\n* The HEAT and HE rounds are completely useless while the APCR has mediocre penetration and damage potential. Don't bother taking anything but the default APCBC round into battle\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n===Development===\nNazi Germany created the formidable 8.8 cm Pak43 anti-tank gun, a longer version of the 8.8 cm KwK36. 2 attempts were made to fit this gun onto a self-propelled configuration, the first was [[Ferdinand|Panzerjäger Tiger (P) Ferdinand]] (later Elefant) and the second was the [[Nashorn]]. However, the Ferdinand was too heavy and unreliable while the Nashorn was too small and underpowered to propel such a gun. The Jagdpanther was proposed in late 1942, as a tank destroyer from the [[Panther D|Panther]] chassis that could mount the formidable 8.8 cm Pak43 with good armour and speed. The tank destroyer was created and designated Sd.Kfz. 173 and was demonstrated to Hitler on October 1943. Production then started in January 1944 under the simpler name Jagdpanther by Hitler rather than using the longer 8.8 cm Pak43/3 auf Panzerjäger Panther.\n\nThroughout its production life of January 1944 to 1945, 415 total of these vehicles were made. MIAG produced 270 from January 1944 to the end of the war, MNH produced 112 from November 1944, and MBA produced 37 from December 1944. The supposed goal was 150 Jagdpanther produced a month, but Germany's deteriorating situation made this impossible. The Jagdpanthers were made in two variants, G1 and G2. The G1 had a small internally bolted main gun and modified Panther Ausf. An engine deck while the G2 had a larger simplified, outer bolted mantlet with a modified Panther Ausf. G engine deck. A proposal to mount the 12.8 cm Pak80 was mentioned but never came around to production.\n\nThe Jagdpanther was a rather good design as a tank destroyer, it had a good power-to-weight ratio and had a gun that could destroy any Allied tank in service in the war. It did not suffer as much reliability problems due to being based on the later model [[Panther G|Panther Ausf. G]], which had most of the initial problems fixed. It also used an improved transmission and final drive (the two sources of most Panther issues) that was planned for the Panther II.\n\n===Combat Usage===\nJagdpanthers were assigned to heavy tank destroyer battalions in the Western Front and Eastern Front, though most of the Jagdpanthers were sent to deal with the Soviet onslaught, where it first saw combat action. In Normandy, few of these vehicles were encountered by the Western Allies, though 12 were deployed in one occasion by the 654 schwere Panzerjäger-Abteilung against British units. One instance in July 30, 1944 saw three Jagdpanthers engage and destroy 10-11 Churchill tanks in about two minutes, though two of them were abandoned by the crew due to damage. The 654th was the only battalion to have a full complement of Jagdtigers of about 42 Jagdpanthers at the Western Front, the 559th battalion only had 10 to 14 of these vehicles. The largest concentration of the Jagdpanther on the west was during the Ardennes Offensive of about 20 vehicles combat-ready.\n\nAfter the end of World War II with Nazi Germany's fall, the Jagdpanther and its original Panther configuration saw service with France. The Jagdpanthers served France from 1945 to the 1960s.\n\n=== In-game description ===\nOne of the most powerful and most successful German tank destroyers of World War II. This tank destroyer was designed by the company MIAG and was based on the Pz.Kpfw. V Panther tank. From October 1943 to April 1945, the MIAG, MNH, and MBA factories produced a total of 413 Jagdpanthers.\n\nThe Jagdpanther was mass-produced in three variants which differed in the following ways.\n\nThe first variant was the early version of the G1 self-propelled gun, produced from January to September 1944. These vehicles had an 88 mm 8,8 cm Pak43/2 gun with a one-piece barrel. The gun was fixed to the front armour with bolts inside the vehicle. Anti-magnetic Zimmerit paste was applied to the vehicle's vertical surface in its characteristic squares. Also, this variant lacked a snorkel. The plate covering the engine either completely lacked an opening or had an opening which was plugged closed.\n\nThe second variant was the standard G1, which had an 88 mm 8,8 cm Pak43/3 gun with a composite barrel. This tank destroyer also received a new gun mantlet. Zimmerit was not applied. Heat shields were installed around the exhaust pipe, and the guide wheels had a larger diameter.\n\nThe third variant was the G2, which was equipped with a new gun mantlet reinforced with bolts. An armoured plate taken from the Pz.Kpfw. V Ausf. G Panther tank was installed over the engine. The trenching tool and cleaning rod tube was moved to the rear.\n\nThis tank destroyer was a very effective weapon against all types of Soviet and Allied tanks. It was used on the Western and Eastern fronts until the end of the war.\n\nFor a heavy vehicle, the Jagdpanther had good speed and manoeuvrability. On the other hand, this self-propelled vehicle inherited a number of disadvantages from the tank it was based on, primarily low mechanical reliability and relatively thin side armour.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=germ_panzerjager_panther Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n\n{{Youtube-gallery|uCO0chq-xcw|'''The Shooting Range #186''' - ''Metal Beasts'' section at 00:37 discusses the {{PAGENAME}}.|lpBqzSQyuv0|'''Tank Chats #153 - Jagdpanther - The Tank Museum''' - ''The Tank Museum''|bpMgT_WH36g|'''Jagdpanther: King Tiger's Gun & Panther's Chassis''' - ''Military History Visualized''|4bj1Tm7YNrs|'''Jagdpanther Tactics''' - ''Military History Visualized''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n* [[Panzer V Panther (Family)]]\n\n;Other vehicles of similar configuration and role\n* [[SU-100]]\n* [[CA Lorraine]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[Wikipedia:Jagdpanther|[Wikipedia] Jagdpanther]]\n* [http://storage.net-fs.com/hosting/3912593/3/index.htm 3D Experience - Jagdpanther interior]\n\n{{Germany tank destroyers}}"}}