{"title":"Khrizantema-S","pageid":10591,"wikitext":{"*":"{{Specs-Card\n|code=ussr_9p157\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Soviet tank destroyer {{Battle-rating}}. It was introduced in [[Update \"Starfighters\"]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n\nThe Khrizantema-S is very lightly armoured and only has 2 crew members, so it will barely survive any attack stronger than 7.62 mm MG to the hull. It, however, has some RHA plates on front, which are also angled closer towards 80°, making it capable of deflecting heavy machine gun fire and, at times, 20 mm autocannon fire. They will not protect from APDS or APFSDS belts of light tanks.\n\nUnlike the [[Shturm-S]], which has a virtual plate of 5 mm RHA covering the launcher hole at all the times, the Khrizantema-S has a huge gaping hole in the middle of the roof with no protection at all, which makes the tank count as open-topped. Due to this and overall bad armour thickness, any HE shell will knock out the vehicle even with an indirect hit. This means that AP-I or even HE-I anti-air belts on planes, light tanks and SPAA are not a joke, but a legitimate lethal threat. Hellfire missiles or rocket salvos will also disintegrate the carrier.\n\nDue to this, the Khrizantema-S requires hulldown positions or hills just to be able to fight, and should avoid direct fights and artillery fire at all costs. It is optimal to have 3 firing positions which are at least 60 m apart to rotate through if the Khrizantema-S is within artillery request range, allowing it to dodge artillery fire for as long as possible, but survival is not guaranteed regardless, as sometimes the initial correction shots are lucky enough to land straight on the roof and destroy the carrier.\n\nTo retreat from battle or to exploit its weapon system offensively, the Khrizantema-S can also use ESS together with thermal scope, creating a smoke wall behind and around itself. Unfortunately, it will not protect from tanks which also have thermal scope unlocked, which are the majority at the BR.\n\nThe weakness of armour is exacerbated by the fact that, even in hulldown, its launcher and radar are still exposed and can be hit with HE, HESH, or HEAT projectiles. This means that HE shells can be landed on top of it in such a way that it will destroy the Khrizantema-S via overpressure, allowing other ATGM and even SAM tanks to defeat it, if their reaction time and aim are better.\n\nThere is no way to force the carrier to put the launcher down and close the hatch, so the tank is virtually exposed at all the times unlike with the Shturm-S. This is very unfortunate, as the hull is actually very short and could be hidden in the same manner as the predecessor otherwise.\n\nThe \"Dozer Blade\" upgrade allows the Khrizantema-S to create firing positions for itself anywhere, or to make attacking into its cover incredibly annoying and difficult, but its general weaknesses will remain the same.\n\n'''Armour type:'''\n\n* Alloy ABT-102 (hull)\n* High hardness rolled armour (appliqué armour)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 18 + 10 (81°) ''Upper glacis'' <br> 10 + 12 mm ''Upper plate'' <br> 60 + 10 mm (53°) ''Lower glacis'' || 60 ''Top front'' <br> 43 mm ''Top rear'' <br> 45 mm ''Bottom'' <br> 13 mm ''Engine vent'' || 43 mm ''Upper plate'' <br> 43 mm (22°) ''Lower glacis'' <br> 13 mm (22°) ''Exhaust'' || 18 + 10 (9°) ''Front glacis'' <br> 15 mm ''Fighting compartment'' <br> 18 mm ''Launcher hatch''\n|-\n|}\n\n'''Notes:'''\n\n* Suspension wheels and torsion bars are 15 mm thick while tracks are 20 mm thick.\n* Mudguards are 4 mm thick.\n* There are additional but sporadic 10 mm thick appliqué armour plates on the sides of the hull.\n* Belly armour is 10 mm thick.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n{{tankMobility|abMinHp=710|rbMinHp=442}}\n\nThe Khrizantema-S's acceleration and mobility is somewhat closer to tracked light tanks due to its low weight, but it has rather limited maximum speed, when compared to top rank VI or VII vehicles.\n\nIn RB, its offroad forward speed is generally around 45 km/h. Its reverse speed is also limited, but will allow it to back out of a fight with about 15 km/h on demand. In AB, the acceleration is higher, so it is not impossible to reach 70 km/h with upgrades, but it will not outpace most medium tanks of the other nations at the rank.\n\nThe Khrizantema-S's climbing ability is mediocre, but it should be able to climb any hills when spaded. Overall, it's similar to the Shturm-S in that regard. The Khrizantema-S can swim with greatly reduced movement speed.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|9M123}}\n\nThe Khrizantema-S has an ATGM handle similarly to the [[Shturm-S]]. It reloads two of the missile launchers at once, and only reloads them after both were used. Since it's completely automated, it will always take 15 seconds to reload.\n\nSniper optics and laser pointer are located on the very front-right of the hull, separately from the launchers. The optics must be able to point towards the target for semi-automatic (mouse) aim to work.\n\nSince the launcher is very fragile, it is important to avoid being hit until \"Parts\" are researched, as if the handle or the launcher are critically hit, the field repair will fail to completely fix them and the Khrizantema-S will become useless until it finds a light tank, squadmate, or friendly capture point. This can be debilitating to a point it's easier to just bail out of the carrier rather than to try to repair.\n\nThe handle can aim in about a 160 degree sector in front of the tank, but has problems with pointing down and too far up, which makes sniper aim more useful in open, flat terrain, where the tank can fire at targets directly. If it must be used in cluttered streets, it's best to approach targets carefully while being mindful of the fact that the launcher is located behind the sniper scope and not just above it, to avoid misfiring and hitting the tank's own cover.\n\nSimilar issues follow radar aim as well, due to radar's limited vertical traverse, but it can guide missiles at angles far beyond capability of the laser designator.\n\nMuch like with the Shturm-S, it is possible to swap main weapon to the launcher itself and back to the scope by swapping between \"primary weapon\" and \"machine gun\". Unlike with the Shturm-S, it is possible to guide the first missile with the launcher in RB, which can be a very crude but effective move. This trick also allows the tank to survive in AB, as using the radar in AB aggressively is way too dangerous, therefore using the launcher as a makeshift turret is the only viable, albeit weird, choice.\n\nBoth missiles can be controlled at the same time, either both by laser, or the first by radar and then the second by laser.\n\n{{Notice|Missiles can be slaved to radar, therefore the first missile launched while radar is locked on will fly straight for it and ignore user's input. It will do so even if the Khrizantema-S's hull is furiously shaking while swimming and manual shot seems impossible to make. If you let the first missile reach its target before firing again, the next missile will also be guided by a radar.}}\n\nMissiles themselves have high levels of horizontal mobility, but significantly lower vertical mobility - they can take sharp turns to the sides, but they will refuse to drop down at the last moment, so it is better to keep them level with the intended target, unless they are guided by radar, in which case you have no control over them and they generally go for the turret neck or the centre of the target. Radar has far better control over how missiles move, but it is still ill-advised to launch them at too high an angle, as they will just slam into the ground. They, however, will likely catch any slow flying helicopter, that does not immediately perform a drop straight down to the ground (which is very bad for RB helicopters and may result in unintended crash by itself).\n\nSince the missiles are too bad at vertical manoeuvres, it's near impossible to use them for trick shots and for the same pseudo-hulldown tactics generally employed by the Shturm-S. Even in AB, in the sniper seat it is only possible to pull them below the sniper crosshair by about 7-12 additional degrees, even in third person view missiles fired into the sky are not guaranteed to come back down and it is difficult to force them to drop into enemy cover.\n\nMissiles can fly up to 6 km before running out of fuel. It makes them useful against both ground and air, but it may fail to reach overly cautious rank VII helicopters, due to them being able to fire from 8 km away. They are not very good at catching planes which are evading direct shots, especially when guided by the radar, as it often leads them in a less than optimal way.\n\n9M123 is an extremely powerful tandem missile, which can potentially penetrate any NERA currently in the game on direct hit and will definitely penetrate any ERA due to its power alone and tandem technology used to specifically breach ERA. Unlike the missiles of the [[Shturm-S]], it is extremely unlikely that the target will survive, unless it was a glancing hit.\n\n9M123F is the same carrier missile, but it is loaded with HE instead. In terms of penetration, they are equal to the strongest HE shells in the game. These are generally used to harass other light vehicles, which sometimes cannot be simply destroyed with HEAT payload, but, due to their high raw power, they sometimes can be launched at a main battle tank to destroy them if their turret is too thick even for the incredibly powerful default missile or their commanders are being way too paranoid to hit directly with HEAT. Due to the extreme explosive mass, these missiles can actually cause dents in the ground which are not only visible by the eye, but slowly wear down enemy cover over time (though it will still take a very long time to do and is not very viable outside of AB).\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[9M123]] missile || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity (Belt) !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 16 (2) || rowspan=\"2\" | -5°/+15° || rowspan=\"2\" | ±85° || rowspan=\"2\" | N/A || 35.2 || 48.8 || 59.2 || 65.5 || 69.7 || rowspan=\"2\" | 15.00 || rowspan=\"2\" | 15.00 || rowspan=\"2\" | 15.00 || rowspan=\"2\" | 15.00\n|-\n! ''Realistic''\n| 23.8 || 28.0 || 34.0 || 37.6 || 40.0\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| 9M123 || ATGM (tandem) || 1,200 || 1,200 || 1,200 || 1,200 || 1,200 || 1,200\n|-\n| 9M123F || ATGM-HE || 61 || 61 || 61 || 61 || 61 || 61\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"11\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Range<br>(m)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| 9M123 || ATGM (tandem) || 550 || 6,000 || 46 || 0.4 || 0.01 || 6,160 || 80° || 82° || 90°\n|-\n| 9M123F || ATGM-HE || 550 || 6,000 || 46 || 0.2 || 0.01 || 9,240 || 79° || 80° || 81°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 2.15.1.99''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''8''' || 1&nbsp;''(+7)'' || No\n|-\n|}\n\n=== Radars ===\n\n{{Notice|The Khrizantema-S's radar can not only lock onto aerial targets but also search for and lock onto ground targets, and it can also lock onto targets behind smoke and trees, and in the dark, even if the user cannot see them. Keep both of these facts in mind when using it.}}\n\nThe Khrizantema-S is equipped with a single search and tracking radar, mounted to the left of missile launchers. The radar system is incapable of scanning while tracking, and can only lock on targets within a 20° arc in direction the aiming device is pointed at. This means, that if the operator switches \"primary weapon\" towards the launcher itself, the radar will continue scanning in the same direction, while the gunner aims elsewhere, which could be used defensively in some niche scenarios.\n\nThe radar dish follows the targeting device and only scans in chosen direction. However, once locked, it can turn up to 85° degrees in either direction in front of the tank, continuing to track its target as long as the user doesn't turn the laser designator further than 15° away.\n\nVertically, the radar also has rather limited angles at which it can lock and track. It also seems to rely more on hull position rather than aiming device when aiming at the sky. For that reason, it is better not to rely on search mode whatsoever and try to lock onto targets manually (by pressing the lock-on button in sniper mode while aiming at the target) to see if the tank needs to be moved, or it's just the radar being picky and the carrier needs to be angled upwards.\n\nThe radar will generally refuse to lock if the target is behind a tree or something solid, which means you will not waste a shot by just relying on it. However, it will often fail to lock on to a turret of a tank (which could be hit resulting in target destruction), so radar suggestions are not absolute and manual aim is not to be discarded.\n\nSometimes, the radar can lock on and track hostile tanks at very long ranges, while aiming at them almost through the ground, allowing missiles to be launched over hills with minimal tank exposure and giving the Khrizantema-S an unexpected advantage, particularly noticeable at longer ranges of over 1.8 km.\n\nRadar is hidden within vehicle whenever it is powered down or seriously damaged. Since radar is a valid target for explosives, sometimes it is worth turning it off on purpose in RB. Sometimes, it is possible to damage the radar even if it's hidden for some reason.\n\nIt is definitely necessary to turn it off in AB, as it is easy to lock onto \"selected\" tank from sniper scope within radar scan radius even if it's offline, and the radar will only pop out for a fraction of a second if the lock was unsuccessful, instead of being a liability. The good time to turn it back on is when there are non-ESS smoke screens popped all around, so it is necessary to continuously scan the smoke in order to stay safe and fight.\n\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"5\" | 1L32-1 - Target Detection Radar\n|-\n! {{Annotation|Maximum<br/>Detection<br/>Range|The maximum possible range at which a target can be detected}}\n! {{Annotation|Minimum<br/>Detection<br/>Range|The range, below which, a target cannot be detected}}\n! {{Annotation|Max Azimuth<br/>Scan Angle|How far to each side the radar can scan (widest search mode)}}\n! {{Annotation|Max Elevation<br/>Scan Angle|How far up and down the radar can scan (widest search mode)}}\n! {{Annotation|Minimum<br/>relative speed|The minimum speed a target must be moving, relative to the radar, in order to be detectable by the radar}}\n|-\n| 8,000 m || N/A || ±7° || ±4.5° || N/A\n|-\n! colspan=\"5\" | 1L32-1 - Target Tracking Radar\n|-\n! {{Annotation|Maximum<br/>Tracking<br/>Range|The maximum range at which a target can be tracked}}\n! {{Annotation|Minimum<br/>Tracking<br/>Range|The range below which targets cannot be tracked by the radar}}\n! {{Annotation|Azimuth Tracking<br/>Angle|How far to each side the radar can track a target}}\n! {{Annotation|Elevation Tracking<br/>Angle|How far up and down the radar can track a target}}\n! {{Annotation|Minimum<br/>target speed|The minimum speed a target must be moving, relative to the radar, in order to be tracked by the radar}}\n|-\n| 8,000 m || N/A || ±15° || -10°/+20° || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\n; Arcade mode\n\nLike the Shturm-S, the Khrizantema-S is an extremely flawed tank and is already outclassed by almost everything at its own BR, most noticeably when fighting proximity missile carriers. It also lost its anti-air ability, relying on the sheer speed of the missiles and, sometimes, its radar to hit aircraft. The radar is also more of a liability in AB than of help due to it being a target for explosives in a mode where all cannon-mounted tanks have aim prediction and assistance, and, unlike with the Shturm-S, this carrier will explode if hit by a chemical shell anywhere.\n\nHowever, the Khrizantema-S still has ATGMs with the highest raw damage in the game, which means that almost any tank hit directly will vaporize immediately. Unfortunately, the missiles also have poor vertical manoeuvrability, so it's impossible to imitate vertical ATGM and hulldown like with the Shturm-S and a different strategy is required.\n\nTo decide whether to spawn this ATGM carrier or not, a few questions should be answered first:\n\n* Does the enemy team have an excessive amount of [[Dardo]] or [[M3A3 Bradley]]?\n* Are there good horizontal hulldown spots on this map that you can use?\n* Can you be easily hit to the hull in that hulldown spot (whether by ATGM or aim assisted HE/HESH/HEAT)?\n* Can you make it to the hulldown spot before you get sniped?\n* Is your team being steamrolled so hard that an enemy team can afford an endless air support?\n* Is it necessary to rush something down to win, at least right now? If so, is enemy position vulnerable to the attacks of Khrizantema-S and are you comfortable enough with the weapon controls to do it?\n* Are there close air support planes in this round? If so, are you good with hitting them without any help?\n\nIf any of these questions are a concern to you, it is probably better to spawn a different tank. Against proximity missiles, some medium tanks with ERA on the turret might be better. In some general combat situations, even the Shturm-S might be better due to its anti-air capability and lesser vulnerability to HEAT, but it has to use HE to fight NERA tanks and has to reload more often.\n[[File:Khrizantema-S urban hulldown AB.jpg|thumb|right|Much like M901, AB Khrizantema should use hulldown to defend a position. Unlike the M901, the Khrizantema is not limited to stand-off sniping.]]\nIt is possible, that the second question puzzled you, as there are almost no sniping spots in this game, which could be normally used by the Khrizantema-S in AB without an immediate threat of being hit by a HEAT projectile (leading to an instant explosion due to a hole in the roof). Do not worry, as by using the launcher aiming trick, it is possible to imitate the [[M901]], which can be effective.\n\nAt the very start of the match, turn your radar off and switch to the launcher by pressing \"select primary weapon\". After this, drive straight towards your guarding post. You want to hold the line until the very last missile with minimal movement. The line might be a building block (which you will destroy to create cover and allow for direct shots), the line might be the front, which you can observe from behind an unusually big rock or a short flat hill, it could even be a plateau, as it might even allow you to use the radar. If you have the Dozer Blade modification, you can try to build or reinforce a firing position in some unusual spot. But, whatever you choose, the launcher must be able to aim straight at the enemy tank, so you are limited to only flat ground. Ideally, you want to be standing right next to your cover, as otherwise enemy might hit the hull by flinging shells, ATGM or even SAM over terrain.\n\nAfter taking the position and cleaning it up for direct missile launching, wait for the enemies to appear. It won't take long, since many players around rank VII have fast tanks. After seeing one, enter sniper scope, hold aim assist button, adjust aim, then fire. If the tank in question is some sort of ATGM light tank or SPAA, immediately double tap them from the third person view, even if you are generally sure of your aim, as to avoid being shot back into the launcher (which can be fatal if they use default belts or ATGM). Both missiles can be guided at the same time, so the second shot is not entirely wasted and can be redirected into the next tank.\n[[File:Khrizantema-S desert hulldown AB.jpg|thumb|right|Zone other ATGM carriers and sniper tanks out, punish any assault onto a capture point, use the radar to finish off tanks behind smoke screens, as they can't see you anyway.]]\nHolding aim assist after aiming in sniper seat is necessary to prevent the missile going after the sniper scope into your tank after aiming at the enemy tank. Even though the launcher is going to turn away, the missiles still follow your aiming reticule. Because of this, if your right mouse button is not very steady and tends to lose the lock-on grip, bind an additional keyboard key, for it is necessary.\n\nIf possible, plan a retreat route for yourself, as it is often impossible to stop rank VII tankers from advancing. Many of them either have enough speed and game knowledge to understand that they have to annihilate you and will go full throttle towards you while you reload, or will go full throttle towards you simply because they can. However, if you have a plan B and can retreat behind the next cover, you can avoid being destroyed during the reload and deny enemy access to the area for far longer.\n\nIf you won a battle for the capture point of your choice and nobody seems to be interested in attacking it anymore for more than two minutes, you can transition towards different sniping spot to try and blindside enemies somewhere else. It is, however, very likely that there still is at least one more enemy hiding somewhere nearby, so only move out when there are friendly aircraft in the air, to ensure that at least your immediate surroundings are safe, or that you at least know where the enemy tanks are (via radio communication skill). If you'll meet enemy tanks while out of cover and won't manage to fire before they react, you are going to be destroyed instantly.\n\nUnlike with the Shturm-S, there are no anti-air missile on the Khrizantema, and it is even more vulnerable to air raids, so fighting back will be difficult.\n\nIf there are helicopters: swap weapon control back towards the guiding device, use a hill, which allows the radar to lock on to one of them, and launch first missile via radar, while you guide the second missile into another one. Remember, radar lock will break if you turn the guiding device too far away from the first target, so if they spawned in a very spread-out formation you can just fire both missiles and guide them yourself immediately. If you see any helicopter ATGMs, use ESS and continue guiding the missiles via thermal scope towards the ATGM helicopter.\n\nIf there are planes: Forget about the radar and fire immediately. If you see a bomber spawning, immediately attack it, as they fly slower than the missiles and can't turn too much, so they are a relatively easy target. If you were able to shoot it down before they reached 1.8 km distance towards you, you are probably safe, but you can additionally move to a different cover if you saw any bombs flying off them. If there is a strike aircraft coming, you are pretty much dead, as they can easily dodge missiles and can keep throwing the plane up and down while firing off rockets, which the 9M123 will not be able to keep up with no matter what. Enemy fighters almost always come down to fire at the Khrizantema-S after fighting each other, but they are often spooked when you launch an ATGM straight at them, so when they reach 1 km distance or start directly diving onto you, fire an ATGM back at them and hope it hits or scares them away. Do not just forget about them after they passed you, as they definitely will circle around and try to hit you again.\n\nIf the enemy is using smoke grenades, pull the radar out and scan the screen, then lock onto them and fire one missile at the locked target. Scanning and locking on can also be done manually from the sniper seat without activating the radar, but you will have to be more precise about it, and you cant let yourself to be distracted by anything else.\n\nIf you use ESS screen to fight and do not want to rely on the radar and want to use thermal scope instead, do not forget to first swap weapon controls back towards the guidance device by resetting weapon control or by choosing the \"machine gun\" as a primary weapon, as otherwise it will be difficult to aim the second shot.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Destructive ATGM with an astounding 1,200 mm penetration, can penetrate most NERA screens and will obliterate most tanks on direct hit\n* Radar can also lock onto tanks, through smokes, bushes, etc.\n* Can fire and guide both missiles at once. It's also possible to attack two different targets at once, one via radar, one via laser\n* Can swim and accurately snipe in water, rare for amphibious tanks\n* Radar guided missiles can shut down any slow helicopter on their own if operator can keep the lock\n* Has thermal optics for gunner\n* Great mobility and acceleration\n* Heavily sloped frontal armour with additional plating can sustain machine guns or bad 20 mm ammunition\n* The only ATGM tank to actually benefit from AB mechanics more than it loses\n\n'''Cons:'''\n\n* Armour is easily penetrated by any big gun and frontal penetration is almost always fatal due to fuel explosion\n* Launcher and radar are easy to hit when hull down, allowing hostile tanks to explode the hull anyway, as it counts as open-topped\n* Very vulnerable to assaults by strike aircraft and have no efficient way of fighting them\n* 9M123 ATGMs have inferior speed when compared to the missiles of [[ADATS]] and SAMs, making them inferior in missile duels\n* Launcher can be hard to aim manually\n* Missiles have poor vertical manoeuvrability\n* Has to follow a specific set of rules to be useful in AB, so it cannot be used on certain maps efficiently in that mode, unless it has unlocked the dozer blade\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n=== [[wt:en/news/6718-development-9p157-2-khrizantema-why-not-both-en|Devblog]] ===\nIn the eighties, the KB Mashinostroyeniya in Kolomna began work on an all-weather anti-tank missile system capable of efficiently detecting and destroying ground armoured vehicles, helicopters and other units at any time of day and any visibility level.\n\nThe system was chosen to be mounted on the BMP-3 chassis – a highly mobile, all-terrain platform that could even navigate water. That is how the 9P157-2 Khrizantema came to be – it became a unique unit capable of simultaneously following targets on two separate channels – on its radar system and through visual contact.\n\nMoreover, the abovementioned radar can detect and take aim at targets at any time of day and visibility level (be it night, smoke or sandstorm).\n\nThe system's missiles are capable of penetrating tank ERA along with over another 1,000 mm of armour beneath it. The Khrizantema was put into service by the Russian army in 2004 and has since undergone modernisation several times. The missile system has also been exported abroad and deployed by other countries.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=ussr_9p157 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed\" heights=\"150\">\nFile:Khrizantema WTWallpaper 01.jpg|\nFile:Khrizantema WTWallpaper 02.jpg|\nFile:Khrizantema WTWallpaper 03.jpg|\nFile:Khrizantema WTWallpaper 04.jpg|\nFile:Khrizantema WTWallpaper 05.jpg|\nFile:Khrizantema WTWallpaper 06.jpg|\nFile:Khrizantema WTWallpaper 07.jpg|\nFile:Khrizantema WTWallpaper 08.jpg|\n</gallery>\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/6718-development-9p157-2-khrizantema-why-not-both-en|[Devblog] Khrizantema-S: why not both?]]\n\n{{USSR tank destroyers}}"}}