{"title":"KPz-70","pageid":827,"wikitext":{"*":"{{Specs-Card\n|code=germ_kpz_70\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|KPz-70 WebsiteImage 1.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} German medium tank {{Battle-rating}}. It was introduced in [[Update 1.71 \"New E.R.A.\"]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\nUnlike the Soviet T-64A (its main rival), the KPz-70 does not utilize composite armour, but an air gap that forces munitions penetrating the initial layers to lose their mass by fragmenting apart before moving to the next layer of armour. This general design concept has been in use as far back as WW2 and is even used to this day on modern fighting vehicles.\n\nSpaced armour works wonderfully well against shaped charge munitions or any other munition with explosive filler provided it is of a stronger protection rating. Proceeding weapons and munitions development has seen this benefit decreased with either more powerful or tandem charge warheads and can be seen in-game against weapons that proceeded different designs of spaced armour. As such, the KPz-70 will find weapons that were designed to defeat spaced armour such as the HOT-K3S ATGM and BAE Swingfire system that will penetrate it. However, the spaced armour in the KPz-70 works exactly as it was designed to do against older anti-tank missiles, HEAT, HE, and HESH munitions.\n\nThe tank mounts no external spaced armour. The armour on the side and rear of the tank is not worth mentioning as it will only stop light machine gun fire and some cannon fire on the turret. Adversary SABOT rounds will penetrate clear through the engine and into the crew compartment most likely destroying the tank if engaged from behind.\n\nAn unconventional feature at the time the KPz-70 was designed was the housing of all the crew members in the turret. Because of the autoloading system, the need for a loader was eliminated and due to an attempt to further lower the silhouette of the tank, the driver was located to the turret with the gunner and commander. This can have potentially devastating consequences on the battlefield as the crew can easily be injured or incapacitated by penetrating munitions entering the crew compartment.\n\nFor defensive countermeasures, the tank is equipped with quad four-barrel externally mounted smoke canister launchers which can provide either a defensive screen for the tank or friendly forces. These launchers can be fired in pairs of two. Keep in mind the smoke grenade launchers are operated by the gunner so should he become incapacitated in a fight, the smokes will become unavailable until the gunner is either replaced by another crew member or the crew replenishment consumable restores them.\n\nDue to its low profile and effective array of camouflage options the KPz-70 scores high marks in the concealability category. It has a total of 4 camouflage options available to it. The standard (a 3 tone NATO CARC camouflage), winter camouflage (requires 700 battles against other players in the tank), a brown camouflage for desert environments, and lastly an olive drab option. The addition of various foliage can further increase the ability to conceal the tank.\n\n'''Armour type:'''\n\n* Spaced armour (Hull front, Turret front)\n* Rolled homogeneous armour\n* Cast homogeneous armour\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 34* mm (60-61°) ''Front glacis'' <br> 76.2 mm (64°) ''Lower glacis'' || 23 mm (40°) ''Top'' <br> 23-35 mm ''Bottom'' || 30 mm (12°) ''Top'' <br> 13 mm (57°) ''Bottom'' <br> 8 mm (12°) ''Engine exhaust'' || 20 mm ''Front'' <br> 8-12.7 mm ''Engine deck''\n|-\n| Turret || 50-200 mm (0-75°) || 12.7-38* mm (29-34°) || 12.7* mm (27-80°) || 20-50 mm ''Front'' <br> 12.7 mm ''Rear turret''\n|-\n| Cupola || 25 mm || 25 mm || 25 mm || 25 mm\n|-\n|}\n{| class=\"wikitable\"\n|-\n! Spaced armour !! Front !! Sides !! Rear\n|-\n| Hull || 200 mm ''Kinetic'' <br> 170 mm ''Chemical'' || N/A || N/A\n|-\n| Turret || 320 mm ''Kinetic'' <br> 280 mm ''Chemical'' || '''38 mm sections:''' <br> 320 mm ''Kinetic'' <br> 280 mm ''Chemical'' <br> '''12.7 mm sections:''' <br> 35 mm ''Kinetic'' <br> 40 mm ''Chemical'' || 35 mm ''Kinetic'' <br> 40 mm ''Chemical''\n|-\n|}\n'''Notes:'''\n\n* Suspension wheels are 20 mm thick and tracks are 30 mm thick.\n* Belly armour is 16 mm thick.\n* Gun mantlet ring around the gun barrel is 305 mm thick.\n* A 16 mm RHA plate separates the engine from the crew compartment\n* Hull spaced armour configuration is 34 mm RHA + 127 mm air + 46 mm RHA.\n* Turret spaced armour configuration is 38 mm RHA + 127 mm air + 130-33 mm RHA.\n* Turret rear spaced armour configuration is 13 mm RHA + 38 mm air + 19 mm RHA.\n\nThe main weakness of the KPz-70 to take advantage of as an opposing player is the weak armour when compared to other tanks of its rank. If the KPz-70 can be baited to come towards a position, it becomes much easier to fight. Avoid springing a well-placed KPz-70 ambush if at all possible or try to sneak around him to flank and attack his weakest armour. A well-placed shot through the side of the turret is generally ensured destruction as all of the crew is located in the turret along with an ammunition store with rounds being located under the turret basket.\n\nWith the proper position or speed, try getting around the KPz-70 and engaging him from where it does not expect. It's important to remember the KPz-70 has the ability to quickly snap the turret around and engage any enemy, so surprising the tank is of the up-most central importance to come out victorious.\n\nAnother weakness that can be exploited is its speed. Because of its speed, unskilled players or players unfamiliar with its playstyle will often rush into situations they are not equipped to fight properly and find themselves overwhelmed, allowing a prepared defence to eliminate them.\n\nOne last weak spot worth mentioning is the turret ring. High penetrating munitions can completely pierce this section and travel into the crew compartment. SABOT rounds are especially effective at this. Any tank or SPAA with fast firing 30+ mm gun can penetrate it easily.\n\nDo not try to out-shoot the KPz-70 as it has a very rapid reload that in most cases will ensure that unless the tank's ability to fire is disabled, it will recover and continue to fire to disable or destroy its offender.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=2,325|rbMinHp=1,327}}\n\nThe KPz-70 displays impressive mobility, in terms of its ability to pickup and maintain speed over various terrains - albeit it is somewhat lacklustre compared to some of the top tier vehicles such as the [[M1 Abrams]] and [[T-80B]]. Mobility is the best weapon the KPz-70 has.\n\nThe KPz-70 is equipped with a diesel-fuelled 1,500 horsepower (1,100 kW) Daimler Benz V12 engine. This engine pack compared to its American counterpart produces more power, but only slightly so giving the KPz-70 an amazing 29.8 hp/t at 50 - 51.7 tons (depending on upgrade configuration).\n\nA highly advantageous feature is the [[Hydropneumatic suspension|hydropneumatic suspension]] system which not only provides great cross country mobility but allows the crew to position the vehicle in such a way to only expose the strongest armour at an enemy threat. The suspension can also be used to gain further gun depression by raising the rear of the tank and lowering the front thus allowing the gunner to engage from a position that he might not have been able to engage from previously.\n\nThe KPz-70 features the standard NATO track and block design that can be found on most NATO vehicles. The rubber track blocks provide great traction off-road and on-road compared to all-metal tracks found on other fighting vehicles as sliding on a short halt or drifting is minimized.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nThe recommended research order of modules is Parts, FPE, the XM578E1 APFSDS shell, NVD, mobility modifications, and then any remaining modules.\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|XM150E5 (152 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[XM150E5 (152 mm)|152 mm XM150E5]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 48 || rowspan=\"2\" | -10°/+20° || rowspan=\"2\" | ±180° || rowspan=\"2\" | Two-plane || 34.3 || 47.4 || 57.6 || 63.7 || 67.8 || rowspan=\"2\" | 6.00 || rowspan=\"2\" | 6.00 || rowspan=\"2\" | 6.00 || rowspan=\"2\" | 6.00\n|-\n! ''Realistic''\n| 21.4 || 25.2 || 30.6 || 33.8 || 36.0\n|-\n|}\nThe most important feature that makes a tank is the cannon. In this department, the KPz-70 is no slouch. The 152 mm gun launcher system (the same one used on the [[M551|M551 Sheridan]]), but with a longer barrel and is capable of firing a variety of munition types including an experimental APFSDS round, a traditional HEAT round (with high penetration), an experimental smoke round, and lastly the very capable and proven MGM-51C Shillelagh. This wide range of munition choices gives the operator a variety of options in a pre-combat configuration which can greatly either hinder or enhance the tankers capability on the battlefield. The benefit of a longer barrel compared to its Sheridan counterpart ensures the KPz-70 is much more accurate at range and that the rounds leave the barrel at higher velocities thus increasing their overall damage-dealing capabilities. Additionally, the 152 mm gun launcher gets equipped with an autoloader, greatly reducing its time between follow-up shots on a target.\n\nFor targeting, the option to equip an incredibly accurate laser range finder is available. Additionally, the 7.62 mm machine gun mounted in the turret can be used for range finding as well. Because of the elevated engine deck, gun depression is decreased significantly when firing or aiming the gun over the rear of the tank. \n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| XM578E1 || APFSDS || 346 || 343 || 334 || 323 || 311 || 300\n|-\n| M409A1 || HEAT || 380 || 380 || 380 || 380 || 380 || 380\n|-\n| MGM-51C || ATGM || 431 || 431 || 431 || 431 || 431 || 431\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| XM578E1 || APFSDS || 1,478 || 3.7 || N/A || N/A || N/A || 76° || 77° || 80°\n|-\n| M409A1 || HEAT || 754 || 18.9 || 0.05 || 0.1 || 3,730 || 62° || 69° || 73°\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"11\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Range<br>(m)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| MGM-51C || ATGM || 286 || 3,200 || 27.8 || 0 || 0.1 || 3,600 || 80° || 82° || 90°\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"7\" | Smoke shell characteristics\n|-\n! Ammunition\n! Velocity<br>(m/s)\n! Projectile<br>Mass (kg)\n! Screen radius<br>(m)\n! Screen deploy time<br>(s)\n! Screen hold time<br>(s)\n! Explosive Mass<br>(TNT equivalent) (g)\n|-\n| XM410E1 || 754 || 18.9 || 25 || 5 || 30 || 50\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''48''' || 44&nbsp;''(+4)'' || 33&nbsp;''(+15)'' || 25&nbsp;''(+23)'' || 13&nbsp;''(+35)'' || 1&nbsp;''(+47)'' || No\n|-\n|}\n'''Notes''':\n\n* 2nd rack empty: 33&nbsp;''(+15)'' shells.\n* The KPz-70 can only pack 6 missiles.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n{{Specs-Tank-Weapon|3}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|Rh202 (20 mm)|MG3A1 (7.62 mm)}}\n\nThe Rheinmetall Rh 202 20 mm autocannon is highly effective at dealing with lightly armoured battlefield threats and on some tanks exposed sides or rears. In some situations, it may be more beneficial to utilize the 20 mm as it will allow the tank to deal damage rapidly while conserving the 152 mm main cannon ammunition. The cannon is also highly effective at shooting down low flying attackers. Note that if the commander is knocked out, the 20 mm will become unusable.\n\nThe KPz-70 is one of the few medium tanks (aside from French, [[Leopard 2K]] and [[MBT-70]]) to carry 20 mm coaxial autocannon. This weapon should not be treated lightly or dismissed as \"just an anti-aircraft\" gun, as it has 57 mm penetration at flat angle, and it will shred anything from light tanks and SPAA, to lightly armoured medium tanks' sides and SPG, if they are not angled. In case that their armour cannot be penetrated, use the autocannon to destroy a hostile tank's gun barrel and make them helpless, then return fire. This is even more effective, considering the main cannon can fire ATGM directly at enemy tank without losing the penetration or accuracy even when its barrel is broken, allowing you to punish people fishing for easy cannon barrel takedowns.\n\nIf necessary, the 20 mm can also fire at the sky to take out helicopters and careless jet pilots.\n\nDo note, that this pintle-mounted weapon is not protected by anything - HE hit to the hull (for example, if SAM tank fires at it) will likely obliterate it, forcing it to do pathetic damage and jam or miss a lot. Do not forget to repair it.\n\n7.62 mm machine gun is simply used to make bullet screens against hostile ATGM or to put more pressure on aircrafts, if they can be targeted by it.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[Rh202 (20 mm)|20 mm Rh202]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Pintle || 750 (750) || 900 || -9°/+65° || ±180°\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[MG3A1 (7.62 mm)|7.62 mm MG3A1]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 6,000 (1,000) || 1,200 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe tank plays very much like the [[Leopard A1A1]]. Players familiar with the Leopard playstyle will easily adapt to the KPz-70. It has reasonable mobility, especially with full upgrades and aced crew, allowing it to manoeuvre into spots not typically accessible by less mobile tanks. Utilize this to an advantage to set up ambushes as this is how the KPz-70 will get the best of many opponents. It's important to recognize when engagement is not beneficial so that the tank may get a better position or escape from the threat.\n\nDespite the initial appearance of strong frontal armour, it's important to remember when compared to its counterparts at its rank, it is not nearly enough to defeat threats head-on such as the [[T-64A (1971)|T-64A]]. Even ATGM from missile vehicles such as the [[RakJPz 2 (HOT)|Raketenjagdpanzer 2 HOT]] will penetrate the turret and upper glacis plate. Even other Rank V tanks can and will penetrate from the front. Because of the rather condensed placement of crew and ammunition, the KPz-70 will most likely be destroyed. Because of this, it is critical that the KPz-70 gets the first shot off in engagement and ensure it is either eliminated or crippled to such a capacity they either cannot engage or will instinctively panic and try to run to repair or determine the engagement location.\n\nThe gun is especially versatile and powerful with a wide range of ammunition selection, but generally, the cannon launched ATGMs and sabot rounds will get the job done in most situations. The 20 mm turret roof-mounted cannon is great for taking out lightly armoured targets (to include some tanks, ATGM vehicles, etc), anti-air, and aircraft.\n\nEssentially, if this tank is treated like a Leopard, the survivability rate will increase dramatically. The hydropneumatic suspension allows the tank to position in such ways that it can engage from non-conventional spots while exposing only the strongest armour towards the threat. The low silhouette makes the tank especially difficult to hit at longer ranges and this can be further enhanced (situation dependent) by the adjustable suspension. Because of the accurate cannon, it will also find be easy to engage at longer ranges which will maximize the KPz-70's strengths while reducing the targets.\n\nIn summary, the KPz-70 is a great addition to any end game lineup as it provides great flexibility in almost all engagements and is well worth the time and investment to acquire.\n\n===Tactics===\nAmbushing is the tank's strength. As covered previously, utilize the speed to get into firing positions quickly and cause chaos and confusion among the enemy.\n\nThe KPz-70 can also quickly capture objective points and when used properly hold positions so long as it does not stay in any one place too long.\n\nScoot and shoot tactics will benefit the KPz-70 playstyle as well as terrain masking techniques.\n\nShould the tank have to fight in closer engagement ranges or in close quarters, it's critical to always remember the armour will not protect the tank reliably. However, the speed, fast-rotating turret, and manoeuvrability will. Provided the player utilizes these to their advantage, the KPz-70 will be able to control the fight. Recognize when the enemy is baiting the tank into an ambush and avoid them as the KPz-70 doesn't stand a great chance of conducting a counter-ambush due to the weak armour.\n\nIf the KPz-70 does find itself a victim of an ambush, launch a smokescreen, escape, and reassess for a counter-ambush.\n\nThe KPz-70 benefits greatly from squad play. A skilled lone KPz-70 is most certainly a threat on the battlefield but 2 or even 3 KPz-70's working in conjunction with each other in a squad is an extreme danger to the opposing team as the use of squad tactics in combination with the great strengths of the tank can almost completely control the momentum of the conflict.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Great mobility, although out-stripped by some vehicles that utilize turbine engines\n* Extremely fast in both forwards and reverse\n* Fast reload at 6 seconds with autoloader\n* Great gun, with access to various types of ammunition, ATGMs included\n* 20 mm anti-aircraft autocannon on the top of the tank will shred apart any aircraft, especially helicopters\n* Low profile for visibility\n* Armor may be reliable against chemical shells\n* The missile has a very short propulsion phase (about 2 secs), after its engine shuts off it's almost impossible to spot until it is too close, as it leaves no smoke trail like a TOW, or a small red spot like Shturm. It looks like a slow cannon shell.\n* Has a hydropneumatic suspension system\n* The fuel tanks in the hull can absorb HEATFS shells\n\n'''Cons:'''\n\n* Unimpressive frontal plate armour, the turret ring is also exposed, allowing SPAA and light tanks to destroy it frontally\n* Vulnerable to the rear, if the hydropneumatic suspension is not used\n* Optics are vulnerable and can cause ATGMs and HE to explode downwards into the crew compartment\n* Very easy to one shot because of 3 crew cramped in the turret\n* Cannot aim backwards due to engine room\n* Giant engine room is very easy to get shot and destroyed\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\nBeing threatened by the Soviet T-64 tank, Germany and the United States joined together to develop a new main battle tank in the mid-1960s. This became the MBT/KPz-70 project. The new main battle tank would use advanced technology of the time, including hydropneumatic suspension, 152mm gun/launcher capable firing tank shell and ATGM, autoloading system, spaced armour, 1500 horsepower diesel engine and remote-controlled weapon station. Everything looks perfect on paper, but in reality, there were many problems. The autoloading system could load Shillelagh missile quite easily, but it would jam the tank shell. The housing of the driver in a rotating cupola inside the turret would cause an unanticipated problems to the driver. The caseless ammunition would also become unusable if the humidity is high.\n\nWith such design problems and over budget, MBT/KPz-70 project was officially cancelled in 1971. Though the MBT/KPz-70 never entered service, many of its design and technology had been passed on to its successor: M1 Abrams and Keiler, the latter of which became the Leopard 2.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=germ_kpz_70 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|ly9JS6errQQ|'''Best secondary armaments''' discusses the {{PAGENAME}} at 6:03 - ''War Thunder Official Channel''|PosWOnOGkSo|'''Best experimental vehicles''' discusses the {{PAGENAME}} at 5:27 - ''War Thunder Official Channel''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n* [[MBT-70]]\n* [[VT1-2]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/4923-gamescom-kpz-70-mbt-70-a-warrior-of-two-armies-en|[Devblog] KPz-70 & MBT-70 - A Warrior of Two Armies]]\n\n{{Template:TankManufacturer KMW}}\n{{Germany medium tanks}}\n[[Category:ATGM vehicles]]"}}