{"title":"M22","pageid":722,"wikitext":{"*":"{{Specs-Card\n|code=us_m22_locust\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!--''In the description, the first part needs to be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert the screenshot of the vehicle. If the novice player does not remember the vehicle by name, they will immediately understand what kind of vehicle it is talking about.''-->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} American light tank {{Battle-rating}}. It was one of the first American tanks to be released with the American ground tree in [[Update 1.45 \"Steel Generals\"]]. One of the tiniest tanks in the game, the Locust is able to manoeuvre some of the smaller areas on the battlefield to get a clean shot on an opponent.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!--''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat?''\n\n''If necessary use a visual template to indicate the most secure and weak zones of the armour.''-->\nOutside of heavy machine guns and autocannon rounds firing at a bad angle-of-attack, the M22's armour offers very little ballistic protection against the standard kinetic shells encountered. With only three men in the tank clumped together around the center, a single penetrating shot through the center is bound to knock out two or more crew member and leave the tank immobile or incapacitated.\n\nAircraft coming in at certain angles can possess the necessary penetration values to utterly shred apart the Locust, especially the thin roof armour of 9.5 mm at the turret and hull. However, an oblique angle towards the front armour is already enough to get through the sloped 12.7 mm armour plate present.\n\n'''Armour type:'''\n\n* Rolled homogeneous armour\n* Cast homogeneous armour (Gun mantlet)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 12.7 mm (64-65°) ''Front glacis'' <br> 25.4 mm (7-62°) ''Lower glacis'' <br> 25.4 mm (9-85°) ''Driver's port'' || 9.5 mm (34-51°) ''Top'' <br> 12.7 mm ''Bottom'' || 12.7 mm (11-15°) ''Lower''\n12.7 mm +9 mm ''Upper''\n| 9.5 mm \n|-\n| Turret || 25.4 mm (25-36°) ''Turret front'' <br> 25.4 mm (22-53°) ''Gun mantlet'' || 25.4 mm (3-6°) || 25.4 mm || 9.5 mm \n|}\n'''Notes:'''<br>\n\n* Suspension wheels are 15 mm thick, the bogies and tracks are 10 mm thick.\n* Belly armour is 12.7 mm thick.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp= 297|rbMinHp= 170|<!--AoAweight=(optional) -->}}\n\nAside from its small size, the M22's next famous value is its speed as a light tank. This allows the light tank to zip across the battlefield, possible getting to locations that can annoy enemies like a locust. \n\nIn Arcade Battles, be wary of going too fast with the enhanced engine power, especially on paved roads, as it could put the M22 in a speed the transmission would not be able to steer properly without \"snaking\" the tank. Another worst case scenario is running full speed into an immovable object, which can disable certain components or even flat out knock out the tank.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|M6 (37 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[M6 (37 mm)|37 mm M6]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 50 || rowspan=\"2\" | -10°/+30° || rowspan=\"2\" | ±180° || rowspan=\"2\" | N/A || 19.5 || 27.0 || 32.8 || 36.3 || 38.6 || rowspan=\"2\" | 3.77 || rowspan=\"2\" | 3.33 || rowspan=\"2\" | 3.07 || rowspan=\"2\" | 2.90\n|-\n! ''Realistic''\n| 12.2 || 14.4 || 17.4 || 19.3 || 20.5\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | '''Penetration @ 0° Angle of Attack (mm)'''\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| M74B1 || AP || 79 || 76 || 65 || 54 || 45 || 37 \n|-\n| M63 Shell || HE || 3 || 3 || 3 || 3 || 3 || 3\n|-\n| M51B1/B2 || APCBC || 87 || 84 || 73 || 60 || 50 || 41 \n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| M74B1 || AP || 883 || 0.87 || N/A || N/A || N/A || 47° || 60° || 65° \n|-\n| M63 Shell || HE || 807 || 0.73 || 0.0 || 0.1 || 38 || 79° || 80° || 81°\n|-\n| M51B1/B2 || APCBC || 883 || 0.87 || N/A || N/A || N/A || 48° || 63° || 71° \n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 2.3.0.69''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! Visual<br>discrepancy\n|-\n|| '''50''' || 39&nbsp;''(+11)'' || 25&nbsp;''(+25)'' || 1&nbsp;''(+49)'' || No \n|-\n|}\nNote:\n\n* Racks disappear after firing all the shells in the rack.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!--''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.''-->\n{{main|M1919A4 (7.62 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[M1919A4 (7.62 mm)|7.62 mm M1919A4]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 3,000 (250) || 500 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!--''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).''-->\n\nPerhaps the best word to describe this tank is -- tiny -- it really is, no other tank is as small as the Locust (save the [[ASU-57]]). This is a pro and a con, which we will cover in a second. The Locust is a light tank and thus is never really meant to go up against other tanks in the game. This severely limits the opponents the {{PAGENAME}} are able to face against \"fairly\" in this tank as the Locust's small size also means the crew is compacted into a small area and a crew knockout is very easy to do onto the Locust, so in order to beat the odds, some trickery has to be put into play...\n\n;Run and Gun\n\nThe Locust is really fast (although it might be hard to handle at its max speed), use this advantage to get to favorable positions or the flanks of the enemy. The tiny size of the tank helps by presenting a smaller target to the enemy and allows the usage of smaller cover that could not be typically used by an average tank of the rank. With fast manoeuvring and sneaky movements across terrains, the Locust can cross the battlefield quickly and carry out sharp strikes against the enemy. A skilled player can swiftly move from one capture point to another, destroy any opposition there, and capture the point.\n\n;Get in Close\n\nThe riskier tactic, which would work if done well, is to just get right up onto the enemy tank. Again the Locust is tiny and this could make it easier to be knocked out, but that also means the Locust can exploit some of the other tanks weaknesses, like their gun depression—notably early Soviet tanks and taller German ones (when facing an up-tier). Get up right on that tank, point blank on the sides where some enemies will not be able to even move their gun down to hit the Locust if it stays close to them. Also remember that the Locust's 37 mm gun has an impressive fire rate of about 3 seconds. Use this advantage to find weak points on their side or rear armour and score a subsequent knockout. However, Locust players must be careful as sometimes the enemy tank may move in a way that forces the Locust into their crosshairs or into other enemies' guns to take out the Locust as its attacking. The Locust players must also be careful to not accidentally destroy themselves by being too close to the tank when it explodes (if the enemy catches on fire.)\n\n=== Pros and cons ===\n<!--''Summarize and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - they can be substituted with softer forms such as \"inadequate\" and \"effective\".''-->\n'''Pros:'''\n\n* Enormous hp/ton ratio, allowing fast acceleration\n* Great speeds across flat terrain\n* Extremely low profile; tanks without a lot of gun depression can't shoot at the Locust at close range\n* Locust is shorter than the hulls of many tanks, so many opponents may not even be able to aim at the Locust if it's close enough\n* The gun has no trouble penetrating tanks at its BR range\n* Easy to turn a complete 180° at low speed and at a stop\n\n'''Cons:'''\n\n* High acceleration and speed make tank handling rather difficult unless familiar with specs\n* Handling becomes sluggish at higher speeds, noticeably in 3<sub>rd</sub> Gear\n* Small crew of 3 confined in tiny space, no spare crew members to take over incapacitated ones, a penetrating shot can take out two of them easily\n* Weak armour; will only stop 12.7 mm rounds, and sometimes not even\n* Due to its low suspension, it may get stuck in the soft or uneven ground\n* Strange driving issue, in arcade mode, that causes the Locust to shudder, wobble, and not accelerate at a constant rate\n* Doesn't have explosive filler for the 37 mm shells\n\n== History ==\n<!--''Describe the history of the creation and combat usage of the ground vehicle in more detail than in the introduction. If the historical reference turns out to be too big, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/ History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></nowiki></code>, as well as adding them at the end of the article. This section may also include the vehicle's devblog entry (if applicable) and the ingame encyclopedia description (under <code><nowiki>=== Encyclopedia Info ===</nowiki></code>, also if applicable).''-->\n===Development===\nThe development of this tank began in late 1941 as a request from the British military for an airmobile light tank that could travel on a glider. The British airborne forces used gliders as a mean to transport troops and equipment, and by 1941 the gliders were rated to be able to carry a tank weighing about 5.5 tons in a 300 to 350-mile flight. The British had a light tank design, the [[Tetrarch_Mk_I|Mk. VII Tetrarch]], but it was not built for the focus of airborne operations so the request was made for a purely-built airborne light tank to replace the Tetrarch, and for the tank to be made not in Britain due to constraints in industrial capacity.\n\nThe request to the Americans called for a tank weighing between 9-10 tons with a 37 mm cannon and a coaxial machine gun with a crew of three. The tank was to have a maximum speed of 64 km/h (40 mph) and could operate in a 320 km radius (200 miles). The turret and front armour thickness were to be between 40-50 mm and the sides 30 mm thick. US Ordnance Department requested three companies, General Motors, J. Walter Christie, and Marmon-Herrington to design a suitable tank, of which the Marmon-Herrington design was accepted. The design was made into a prototype in late 1941 and was designated the ''Light Tank T9''. This design had a crew of three and weighed 7.4 tons, with a 37 mm gun and coaxial machine gun, plus two more machine guns on the right side of the bow. The turret was powered and had a gun stabilizer. The tank was powered by a 162 hp six-cylinder Lycoming engine and the armour thickness was 12.5 mm on the entire hull side of the tank while the sloped area on the sides of the hull was 9.5 mm thick. The tank could go up to 40 mph (64 km/h) with the engine. The T9 was built to be mounted on a Douglas C-54 Skymaster plane, but it could still fit into a glider due to its dimensions and weight. The tank underwent a few changes, such as improvement in the tank suspension and removal of the two machine guns on the bow, the gun stabilizer, and the power traverse on the turret to reduce the weight. The result was designated the ''Light Tank T9E1''. Production was meant to start somewhere in 1942, but issues in the design change and factories caused the production to be delayed until April 1943. The tanks were produced from then until 1945, with a total unit of 830.\n\nThe tank was specified the '''Light Tank M22''' at some time in 1943, but this classified it as a \"limited standard\" equipment due to some faults discovered. Testings showed that loading the M22 tank on a C-54 plane required lots of time and complex equipment, plus the plane had to be landed on an airfield to be unloaded. The durability and reliability of the M22 were also brought into question, concerned that these factors would make it unsuitable for airborne operations and that the design was effectively obsolete. The M22 never saw service in American combat units except for training, and even with the establishment of two units with the M22s, they saw no combat due to America's lack of investment in airborne tanks. The British on the other hand believed that the M22 would be adequate at its role so adopted it as the '''Locust''', giving the name '''Light Tank M22 Locust''' to the tank.\n\n===Combat usage===\nThe British usage in World War II had the airborne light tanks used in 1st and 6th Airborne Division as the Light Tank 'C' Squadron. Although the M22 Locust started replacing the Tetrarch before the initiation of Operation Overlord, the Tetrarch was still used until October 1944, when a restructuring retired all Tetrarch and replaced them with Locusts. The 6th Airborne Division was involved in Operation Varsity in 1945, where eight Locusts were loaded onto Hamilcar gliders and flown to the battlefield on March 24. Of the eight Locusts sent, six landed intact, but two never reached their rendezvous point due to enemy action or mechanical breakdown. Of the four remaining Locusts, only two were undamaged at the rendezvous point. The tanks were deployed at a fortified area, where they engage German troops while being supported by an infantry company, the Locusts were forced to withdraw after the heavy losses in infantry denied them support. The four tanks and what is left of the infantry were finally relieved by the 44th Royal Tank Regiment and the rest of the 6th Airborne Division. Operation Varsity was the only operation the Locust would ever see action in World War II.\n\nThe M22 Locust, while serving rather well as an airborne tank, was reported to be obsolete by January 1946 by the War Office in Britain. New designs were to take over the Locust's role in the airborne formations. What's left of the Locusts in British inventory were given to foreign militaries. Belgium used some as command tanks in their armoured regiments. America received a few tanks back which was converted into agricultural tractors. Egypt used the Locusts in a large number to replace their ageing tank models from the interwar period, these saw service in the 1948 Arab-Israeli War.\n\nToday, sixteen M22 Locusts are known to have survived, though many have replica turrets. Of the batch, only three are known to be in running condition.\n\n=== In-game description ===\n\"In 1941 an airmobile light tank designated the T9 entered development, with three major companies assigned the project: Christie, GMC, and Marmon-Herrington. The design provided by Marmon-Herrington proved the winner, as it satisfied practically every client requirement.\nTrials of the new tank began in the fall of 1941, and in November 1942 the third T9E2 pre-production prototype was built.\n\nProduction began in March 1943 and continued through February 1944. Marmon-Herrington assembled and delivered over the space of that year 830 of the 1,800 tanks ordered. The first 26 had a box-shaped compartment for the driver, though it was removed for subsequent models. The frontal plate was then made from a single piece.\n\nThe tank was designated the M22 beginning September 1944, though the lack of heavy transport planes in the American army kept it out of the war.\n\nThe UK acquired 260 M22s via Lend-Lease, referring to them as Locusts. The British liked the tank thanks to its good mobility, small size, and reasonable weight. Its weak armament and armour, which was no thicker than 25 mm, were considered drawbacks. Some 37 mm cannons were equipped with Littlejohn adaptors, which were designed to boost initial velocity with special shells.\n\nThe M22 only saw combat in 1945. Its biggest battle was Operation Varsity, when 12 tanks were flown in using Hamilcar gliders on March 22, 1945. Some M22s may have taken part in the 1944 Normandy invasion.\"\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=us_m22_locust Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|YuBjyMQLRy0|'''Airmobile tanks''' discusses the {{PAGENAME}} at 2:43 - ''War Thunder Official Channel''|OqGt9pefGSA|'''{{PAGENAME}} Locust Tank Review''' - ''NUSensei''|Cdd0WWkWvRE|'''Tank Chat #87''' - ''Tank Museum''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Other vehicles of similar configuration and role\n\n* [[Tetrarch Mk I]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/devblog/current/716|[Devblog] Developers about the M22]]\n* [[wikipedia:M22_Locust|[Wikipedia] M22 Locust]]\n* [https://tanks-encyclopedia.com/ww2/us/light-tank-airborne-m22-locust <nowiki>[Tanks Encyclopedia]</nowiki> Light Tank (Airborne) M22 Locust]\n* [https://www.militaryfactory.com/armor/detail.asp?armor_id=252 <nowiki>[Military Factory]</nowiki> M22 Locust (Light Tank, Airborne, M22)]\n* [http://the.shadock.free.fr/Surviving_Panzers.html <nowiki>[The Shadock]</nowiki> Surviving M22 Locusts]\n\n{{TankManufacturer Marmon-Herrington}}\n{{USA light tanks}}"}}