{"title":"M4 Hybrid (Italy)","pageid":10609,"wikitext":{"*":"{{About\n| about = premium medium tank '''{{PAGENAME}}'''\n| other\n| usage-1 = other M4 Shermans\n| link-1 = M4 Sherman (Family)\n| usage-2 = other uses\n| link-2 = M4 (Disambiguation)\n}}\n{{Specs-Card\n|code=it_sherman_75_37\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium rank {{Specs|rank}} Italian medium tank {{Battle-rating}}. It was introduced in [[Update \"Starfighters\"]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n\n'''Armour type:'''\n\n* Rolled homogeneous armour (hull sides, rear and roof)\n* Cast homogeneous armour (front glacis, transmission housing, turret, gun mantlet)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 50.8 mm (54-57°) ''Front glacis'' <br> 50.8 mm (43-48°) ''Viewports'' <br>  38.1 (spherical) + 50.8 mm ''MG port'' <br> 50.8 mm (cylindrical) ''Transmission housing'' <br> 50.8 mm (8°) ''Truncated glacis over the tracks'' || 50.8 mm (7°) ''Front part'' <br> 38.1 mm <br> 38.1 + 25.4 mm ''Ammo racks'' || 38.1 mm (10°) || 50.8 mm (0-48°) ''Front glacis'' <br> 19.5 mm Turret area'' <br> 19.5 mm (7°) ''Engine bay - centre'' <br> 19.5 mm (23°) ''Engine bay - sides\n|-\n| Turret || 76.2 mm (7-65°) ''Turret front'' <br> 50.8 mm (7-25°) ''Turret front - gunner side'' <br> 38.1 + 38.1 mm (cylindrical) ''Gun mantlet'' || 50.8 mm (1-4°) ''Turret sides'' <br> 50.8 mm (58-66°) ''Roof radius'' || 50.8 mm (2-4°) ''Sponson'' <br> 50.8 mm (61-66°) ''Roof slope'' || 25.4 mm\n|-\n| Cupola || colspan=\"3\" style=\"text-align:center\" | 50.8 mm (16°) || 25.4 mm\n|-\n|}\n'''Notes:'''\n\n* Suspension wheels are 15 mm thick while tracks are 20 mm thick and bogies are 10 mm thick.\n\nThe hull is very similar to the US [[M4A1]] with a 50.8 mm frontal sloped armour but with a front glacis welded on the rest of the hull instead of a cast one. Protruding viewports and truncated corners interrupt the sloped armour of the glacis and thus are weak spots easy to target for the enemy when up close. The hull sides feature appliqué armour plates covering the ammunition stowage racks. The turret is also very similar but lacks the M4's appliqué armour on the right cheek (gunner side), leaving a small weakened zone in that area. Frontal protection is quite good for its rank and shots from smaller anti-tank guns can generally be shrugged off, particularly when hull down. However more powerful guns such as the [[Pz.IV F2]]'s long 75 mm can destroy the tank easily, so care should be taken. The side armour is only 38.1 mm thick and can be easily penetrated by just about any anti-tank gun if not angled.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=620|rbMinHp=354}}\n\nBased on the chassis of the M4A1, the {{PAGENAME}} has the same good all-round mobility: the tank accelerates quickly and is able to reach a maximum speed of 42 km/h in a dozen of seconds. The brakes are powerful and will make the M4 Hybrid skid rather than slow down when driving at maximum speed. The violent braking also causes the hull to wobble, but your vertical stabilizer will fully compensate this effect as soon as your vehicle is slower than 20 km/h. The reverse speed is rather poor: it won't get you out of a dangerous situation quickly enough. The lack of neutral steering makes turning on the spot slow (2 km/h): make sure to build a little speed before turning and you'll turn much faster (11 km/h). Turning in reverse is equally slow (-2 km/h) Turning at full speed doesn't make you lose much speed as your acceleration is good. The offroad mobility is good: the {{PAGENAME}} reaches 19 km/h when fording, 17 km/h when driving uphill with some speed built-up but a mere 10 km/h uphill from a stop start. The tracks are large and grant you a decent mobility on hard (solid ground, roads) and soft terrain (mud, snow, sand). Light and medium obstacles (fences, posts, bushes and small trees) are not a problem but large obstacles will reduce your mobility: avoid them.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|M3 (75 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[M3 (75 mm)|75 mm M3]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 97 || rowspan=\"2\" | -10°/+25° || rowspan=\"2\" | ±180° || rowspan=\"2\" | {{Annotation|Vertical|up to 24 km/h}} || 22.8 || 31.6 || 38.4 || 42.5 || 45.2 || rowspan=\"2\" | 6.50 || rowspan=\"2\" | 5.75 || rowspan=\"2\" | 5.30 || rowspan=\"2\" | 5.00\n|-\n! ''Realistic''\n| 14.3 || 16.8 || 20.4 || 22.6 || 24.0\n|-\n|}\n\n==== Ammunition ====\nWhen discussing {{PAGENAME}} shells, one always has to account for the fact that it's a medium tank. This means short to medium engagement range, so realistically it can benefit more from its short-range penetration figures than long-range sniping tanks would.\n\n* M72 shot - {{Annotation|AP|Armour-Piercing}} - Solid shot, stock shell. Acceptable penetration, poor post-penetration damage.\n* M48 shell - {{Annotation|HE|High-Explosive fragmentation shell}} - Low-velocity shell useful against soft targets, in particular when hitting an open-topped vehicle. Harmless against any vehicle with more than 10 mm of armour.\n* M61 shot - {{Annotation|APCBC|Armour-Piercing Capped Ballistic Capped}} - This shell has a better penetration than the M72 thanks to its ballistic cap and a good post-penetration damage thanks to its explosive filler.\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| M72 shot || AP || 91 || 88 || 78 || 67 || 57 || 49\n|-\n| M48 shell || HE || 10 || 10 || 10 || 10 || 10 || 10\n|-\n| M61 shot || APCBC || 104 || 101 || 90 || 78 || 68 || 59\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| M72 shot || AP || 619 || 6.3 || N/A || N/A || N/A || 47° || 60° || 65°\n|-\n| M48 shell || HE || 463 || 6.3 || 0 || 0.1 || 666 || 79° || 80° || 81°\n|-\n| M61 shot || APCBC || 618 || 6.79 || 1.2 || 14 || 63.7 || 48° || 63° || 71°\n|-\n|}\n\n==== [[Ammo racks]] ====\n<!-- '''Last updated: 2.9.0.33''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! 7th<br>rack empty\n! 8th<br>rack empty\n! Visual<br>discrepancy\n|-\n|| '''97''' || 91&nbsp;''(+6)'' || 88&nbsp;''(+9)'' || 86&nbsp;''(+11)'' || 78&nbsp;''(+19)'' || 63&nbsp;''(+34)'' || 46&nbsp;''(+51)'' || 31&nbsp;''(+66)'' || 1&nbsp;''(+96)'' || No\n|-\n|}\n[[File:Ammoracks_M4.png|right|thumb|x200px|[[Ammo racks]] of the M4 Sherman (identical).]]\n'''Notes''':\n\n* Racks disappear after you've fired all shells in the rack.\n* To go into battle with the turret basket empty of ammo, pack 78&nbsp;''(+19)'' shells (racks 1 to 4 emptied).\n* To go into battle with the turret basket and the flanks empty of ammo, pack 31&nbsp;''(+66)'' shells (Racks 1 to 7 empty).\n* The 8th rack is large and located at a a weak spot: the bottom section of the armour. In case of penetration, there is a high risk of ammo rack detonation. Make sure not to expose your flanks unnecessarily.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n{{Specs-Tank-Weapon|3}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|M2HB (12.7 mm)|M1919A4 (7.62 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[M2HB (12.7 mm)|12.7 mm M2HB]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Pintle || 300 (200) || 577 || -10°/+25° || ±60°\n|-\n|}\nThe roof-mounted M2HB .50 cal heavy machine gun is very good at knocking out tracks, punching through lightly armoured vehicles and shooting down low-flying aircraft. Use it sparsely because of its low ammo count.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[M1919A4 (7.62 mm)|7.62 mm M1919A4]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 3,000 (250) || 500 || N/A || N/A\n|-\n|}\nThe small calibre of the M1919A4 machine gun makes it largely ineffective against all armoured vehicles but the ones with an open compartment. It still can be used to ping targets as a rangefinding help or to mow down minor obstacles blocking your line of sight.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe M4 Sherman is an effective medium-range combat tank. Equipped with a fast-firing 75 mm gun and with good handling characteristics, the M4 can be an extremely useful asset in most battles.\n\nIn battle the M4 performs well as an all-rounder; the thick turret front and 10 degrees of gun depression make the tank ideal for taking hull-down positions which protect the thinner hull armour from being penetrated by enemy fire. The sloped front upper glacis, when angled, also provides good protection against enemy fire. An unusual - and useful - difference is that the upper glacis is sloped at 56 degrees rather than the standard 45 degrees, making it more of a threat and more powerful due to improving the chances of a round ricochet. The only downfall may be the 2 crew member position in the front that protrudes out to form a flat surface, but both are covered with an additional 20 mm plate. The reasonable mobility of the Sherman makes flanking a viable tactic. The main weakness of the M4 is the side armour - not only is it vertical and thin, but behind it most of the ammunition is stowed. The tall silhouette of the tank also makes finding suitable cover difficult. Overall, the M4 Sherman can be considered as an armoured jack-of-all-trades - it will serve a tanker well, however it will not excel in any particular role.\n\nIn battle, try to use terrain as cover. Hull-down positions are especially strong in the M4 Sherman, as it has a good 10 degrees of gun depression. The gun mantlet and turret are reasonably strong, but avoiding shots is still the best strategy. In this respect, a hull-down position hides the vulnerable hull. If this is not available, then angling the hull armour to present a greater slope is often a good idea, as this can bounce some low-powered cannon at any range and at longer ranges, render the hull impenetrable.\n\nAnother way to play the M4 Sherman is to tap into its traditional cavalry role, its mobility. The M4 Sherman is a great flanker as it is fast enough to get the jump on the enemy's side. Defeat the enemy at their weak front lines or go around the entire enemy force. Once in position at their sides or rear, ambush them. Ideally, the enemy should be too busy focusing on allies attacking in the front to notice the M4 instantly. Take out the weaker light or medium tanks, the 75 mm gun is not very ideal against heavy tanks like the [[KV-1 (L-11)|KV-1]] so take out its friends to allow allies more room to outmanoeuvre the KV tank. An organized attack will increase the M4 chances on the battlefield and success.\n\n'''Enemies worth noting:'''\n\n[[M4A2]] / [[M4A4 (1st PTG)|A4]]: these Sherman tanks are widely used by over 3 nations that spread across both the Allied and the Axis side, so no matter which nation you play they can be quite tough to destroy in the hands of a skilled tanker. Given the rather weak penetration of your short 75 mm gun, their hull can be almost impossible to penetrate when angled, hull down or 300m away. For a M4A4, there are 2 apparent bulges on the upper front plate, a penetration through there is a guaranteed kill most of the times. But in case the opponent covers them up or when it's a M4A2, aim for the middle parts of the gun mantlet or the turret armour unprotected by the mantlet, you can at least make them defenseless. Note that their guns are equally weak against you, so wiggle around to disrupt their aim while you reload, you have a good chance of bouncing some shells.\n\n[[Churchill Mk I]], [[Churchill Mk III]]:\n\nThe Churchills, with their complex hulls and sturdy turrets, can be quite hard to kill at range. Again, manoeuvre as close to them as possible, the idea distance being no more than 200m. If they are angling their hull but facing their turret at you, only go for the turret. For the Mk I Churchills, aim at the near-vertical part of their rounded cheeks to ensure successful penetrations. For the Mk III, also aim for their flat turret which is at most 89mm. The shell should go in easily and knock out most, if not all of the crew. Only when you are facing their hull without any angles should you shoot the hull, otherwise shoot the turret only, as their big tracks can easily get in front of the frontal hull. The side hull have multiple layers of armour, some of which are weirdly angled and can absorb plenty of shells.\n\n[[KV-1 (ZiS-5)]]:\n\nA vehicle that the M4 Sherman will have trouble against is the KV-1. While the [[KV-1 (L-11)|L-11]] is underpowered, the [[KV-1 (ZiS-5)|ZiS-5]] is potent enough to punch through the Sherman's front, and the Sherman is unable to penetrate the KV-1's thick armour especially with its add-on armour plates. If this heavy tank is encountered frontally, aim at the vertical area on the round gun mantlet as it is only 90 mm thick. You can knock out its gunner this way. Or shoot at the vertical part where the gun mantlet doesn't cover to disable its turret ring and gunner / loader. Note: do not shoot at the frontal hull as it is too thick for the M61 shell. Of course, the best way is to shoot at its sides and rear without any angle, where its armour is unsloped, though it will still have to be at a close range to penetrate the armour. In addition, shots to the sides will most likely hit fuel tanks or ammunition storage, causing a fire or ammunition detonation and at best, time to reassess the situation.\n\n[[R3 T20 FA-HS]] (AB / mixed RB):\n\nThis speedy wheeled vehicle can circle around you with ease and wipe out all your crew with its fast firing autocannon. In a close encounter, never expose your side to it, and do not even angle your hull. Face your hull directly to the R3, because on each side of the cast hull, above the inducer wheel there is a triangular area that blends and connects the upper front plate to the side. By angling the hull, this triangle becomes unangled to the R3, making it easily penetrated, and the driver / gunner will usually get knocked out first. It is harder for the R3 to penetrate your unangled hull thus giving you more time to react and destroy it.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent gun depression of -10° plus the angled frontal turret allows it to utilise hills very well.\n* Great penetration and post-penetration damage when using M61 shells; can frontally penetrate and one-shot most opponents like the [[Pz.IV F2]], [[Chi-Nu]] and T-34.\n* Great turret traverse speed allows it to deal with multiple threats easily.\n* Well angled upper front plate can bounce quite some shells when properly angled.\n* Adequate top speed allows it to get to positions in time, or to do tactical manoeuvres like flanking.\n* Pintle-mounted HMG provides an anti-aircraft defence or anti-tank duty against tank destroyers like [[Marder III]].\n* Fitted with a vertical stabilizer, allowing more accurate fire on the move compared to other tanks, as well as better usage of shoot-n-scoot tactics\n\n'''Cons:'''\n\n* Large profile and weak side armour; flankers like the Sd.Kfz.234/2 can easily see and penetrate it.\n* The cast hull creates frontal weak spots with very little effective thickness, eg. the triangles between upper front plate and the side, and the curved hull hatches\n* Frontal armour is still inadequate, will get frontally penetrated and one-shot by tanks like [[Pz.IV F2]]/[[Pz.IV G|G]], [[StuG III F]]/[[StuG III G|G]], [[M10 (Family)|M10]].\n* The best M61 shell struggles to penetrate heavy targets like [[KV-1 (ZiS-5)]], [[Churchill III]] or even the T-34 and M10 when angled.\n* Trajectory is curved and velocity is low due to its short barrel, thus distant/moving targets are hard to shoot at.\n* Hull traverse is quite slow, making it sluggish in a turn.\n* Roof armour of 19.5 mm thick is vulnerable to aircraft equipped with AP cannons like the [[M2 Browning (12.7 mm)|M2 Browning]].\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n;Development\n\nIn America the first M4 Hybrid was built on the 28th Aug of 1943 by the company Chrysler. The tank consisted of a [[M4|M4 Sherman]] hull (RHA) welded with a frontal glacis (UFP) of [[M4A1]], basically a mixture of cast and rolled armour. They only modified the hull and the rest was the same. These tanks were sent to Pacific and to Europe theatres where they were used by Allies in that time to fight Germany, Italy and Japan. Later, the tanks would be modified with better guns, leading to various variants showing up around the world. (ex. [[M4 Tipo IC]]).\n\n;Italy\n\nIn Italy the Armistice was signed in September 1943, ending the Italian armoured Troops, Italian tanks ended up captured by the enemy (Germany and Italian Social Republic) or they were destroyed. The Italian Armoured Troops were dislocated in Sardegna and Corsica and were not authorized to join the 1° Raggruppamento Motorizzato Italiano, constituted the 28 September 1943 in the area of Puglia, or the Corpo Italiano di Liberazione (C.I.L.) (Italian Liberation Corp) and Gruppi di Combattimento (Fighting Groups) who fought the Axis forces with the Allies from October 1943 to April 1945.\n\nAfter the war, Italy reconstituted in 1945 and 1946 a minor military command for the territorial defense, the unit was equipped wih Italian, British and American Tanks. For example, America and Great Britain would give Italy many Shermans tank variants for free, which they used extensively post-war, some of the  Sherman tanks used were :\n\n* M4 75/37 (M4 Hybrid, [[M4A4 (Italy)|M4A4]])\n* M4 76/55 ([[M4 Tipo IC]], [[Sherman Vc (Italy)|M4 Tipo Vc]])\n* M4 105/22 (M4A3(105))\n\nThese tanks and armoured vehicles were given to Italy, the first official armoured corps for Italy was founded in September 1947 and was reunited in Roma to create the first post-war tankers School. Italian Shermans were used from 1948 until the early 1950s, the last ones being officially put out of service in 1952.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicleCountry=italy&vehicleType=tank&vehicleClass=medium_tank&vehicle=it_sherman_75_37 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|TxiKY5ukN1I|'''Premium Review. {{PAGENAME}}. Not worth Full Price''' - ''Joseph 2000''|olWMdTeJ9Pc|'''{{PAGENAME}} - Containing Your Impatience For Showing Off''' - ''Napalmratte''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Vehicles equipped with the same composite hull\n\n* [[M4 Tipo IC]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n''Paste links to sources and external resources, such as:''\n\n* ''topic on the official game forum;''\n* ''other literature.''\n\n{{TankManufacturer Ordnance Department}}\n{{Italy medium tanks}}\n{{Italy premium ground vehicles}}"}}