{"title":"Matilda III","pageid":1014,"wikitext":{"*":"{{About\n| about = British heavy tank '''{{PAGENAME}}'''\n| usage = other versions\n| link = Matilda (Family)\n}}\n{{Specs-Card\n|code=uk_a_12_mk_2_matilda_2\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' (or just '''{{Specs|pseudonym}}''') is a rank {{Specs|rank}} British heavy tank {{Battle-rating}}. It was introduced in [[Update 1.55 \"Royal Armour\"]] along with the rest of the initial British Ground Forces Tree. The {{Specs|pseudonym}} in the game reflects its real-life counterpart with its extreme slow speed, but formidable front armour.\n\nThe Matilda is a great character on the battlefield. The name and its historical significance makes the Matilda a more noteworthy target than your teammates. The Matilda should be played like most other heavy tanks, absorbing damage for your team mates and dealing damage against the enemy as they try to penetrate your armour. Stay away from the front line to maximise armour effectiveness with distance.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n'''Armour type:'''\n\n* Cast homogeneous armour (Front hull, Turret, Side top)\n* Rolled homogeneous armour (Hull side, Hull rear, Hull roof)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front !! Sides !! Rear !! Roof\n|-\n| Hull || 75 mm (0-7°) ''Front plate'' <br> 22-47 mm (69°) ''Front glacis'' <br> 22-78 mm (12-46°) ''Joint area'' <br> 22 mm + 40 mm (56°) ''Lower glacis'' || 70 mm (21-26°) ''Top'' <br> 40 + 25 mm ''Bottom''|| 20 mm (32-79°) ''Top'' <br> 55 mm (25°) ''Bottom'' || 20 mm <br> 35 mm ''Driver's port''\n|-\n| Turret || 75 mm (1-48°) ''Turret front'' <br> 75 mm (0-22°) ''Gun mantlet'' || 75 mm (0-22°) || 75 mm || 18 mm\n|-\n! Armour !! Sides !! Roof\n|-\n| Cupola || 75 mm (6-7°) || 18 mm\n|}\n'''Notes:'''\n\n* Suspension wheels and tracks are both 20 mm thick.\n* Side skirts are not all flat. Small protrusions in the center area go inwards by 54° and are 13 mm thick, giving that portion 40 + 13 mm thick.\n* Smoke Launchers on right side of tank.\n* On the frontal lower glacis there's another 40 mm thick armor plate right behind 22 mm thick armour.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=245|rbMinHp=168}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|QF 2-pounder (40 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[QF 2-pounder (40 mm)|40 mm QF 2-pounder]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 93 || rowspan=\"2\" | ±20° || rowspan=\"2\" | ±180° || rowspan=\"2\" | Vertical || 16.18 || 22.40 || 27.20 || 30.08 || 32.00 || rowspan=\"2\" | 3.64 || rowspan=\"2\" | 3.22 || rowspan=\"2\" | 2.97 || rowspan=\"2\" | 2.80\n|-\n! ''Realistic''\n| 11.90 || 14.00 || 17.00 || 18.80 || 20.00\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | '''Penetration @ 0° Angle of Attack (mm)'''\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| Shot Mk.1 AP/T || AP || 72 || 68 || 52 || 37 || 27 || 19\n|-\n| Shell Mk.2 || HE || 4 || 4 || 4 || 4 || 4 || 4\n|-\n| Shot Mk.IXB APCBC/T || APCBC || 89 || 86 || 77 || 66 || 57 || 50\n|-\n| Shot Mk.1 APHV/T || AP || 80 || 75 || 58 || 41 || 30 || 21\n|-\n| Shell Mk.1 AP/T || APHE || 66 || 62 || 49 || 36 || 26 || 20\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| Shot Mk.1 AP/T || AP || 792 || 1.08 || N/A || N/A || N/A || 47° || 60° || 65°\n|-\n| Shell Mk.2 || HE || 687 || 1.34 || 0 || 0.1 || 85 || 79° || 80° || 81°\n|-\n| Shot Mk.IXB APCBC/T || APCBC || 792 || 1.24 || N/A || N/A || N/A || 48° || 63° || 71°\n|-\n| Shot Mk.1 APHV/T || AP || 853 || 1.08 || N/A || N/A || N/A || 47° || 60° || 65°\n|-\n| Shell Mk.1 AP/T || APHE || 792 || 1.08 || 1.2 || 9 || 20.9 || 47° || 60° || 65°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 2.5.1.106''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! 7th<br>rack empty\n! 8th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''93''' || 87&nbsp;''(+6)'' || 79&nbsp;''(+14)'' || 64&nbsp;''(+29)'' || 53&nbsp;''(+40)'' || 41&nbsp;''(+52)'' || 29&nbsp;''(+64)'' || 15&nbsp;''(+78)'' || 1&nbsp;''(+92)'' || No\n|-\n|}\n'''Notes:'''\n\n* Racks disappear after you've fired all shells in the rack.\n* Turret empty: 53&nbsp;''(+40)'' shells.\n\n==== Optics ====\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n! colspan=\"3\" | {{PAGENAME}} [[Optics]]\n|-\n! Which ones\n! Default magnification\n! Maximum magnification\n|-\n! Main Gun optics\n| x1.85 || x3.5\n|-\n! Comparable optics\n| colspan=\"2\" | [[Chi-Nu]]\n|-\n|}\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|BESA (7.92 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[BESA (7.92 mm)|7.92 mm BESA]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 4,000 (225) || 600 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nIf attacking, the Matilda should take point in the attacking force (if your team will wait for you) and crawl slowly towards the enemy locations with support from your team members. Stop and fire at any target that reveals itself to attack you. When defending, park some distance away from a choke point to a vital area and blast enemies as they try to enter. Remember to maintain team support so that enemies don't try to out manoeuvre you. Make sure to keep a safe distance away from the enemy to maximise the effectiveness of your armour with the shell damage drop-off. Like this, your armour will be very hard to penetrate. At the same time use the [[Ordnance QF 2-pounder (40 mm)|2-pounder gun]] to attack the enemy. Close-distance fighting is ill-advised as opponents will be able to more easily penetrate the front armour and find weak points. A very important tip to know about the {{Specs|pseudonym}} is to '''not go into towns!''' You will be easily out manoeuvred, allowing your opponents to get close and flank and destroy you.\n\nOpponents that deserve extra attention are the tank destroyers. The two German Marders carry a gun that can easily knock you out at long range, especially the [[Marder III H|Marder III (H)]], but those have thin armour, so use that to your advantage. The more armoured German TD, the StuG III, is even more dangerous. The [[StuG_III_A|StuG III A]] carry the [[KwK 37 (75 mm)|short 75 mm]] that can fire high-penetrating HEAT rounds while its front armour can resist the 2-pounder's shots from a longer distance. The [[StuG_III_F|StuG III F]] is a bigger problem with its [[KwK 40 (75 mm)|longer 75 mm gun]] and thicker armour, but its high battle rating of 3.7 should make this an uncommon sight. The Matilda will have a hard time to fight the StuGs due to the front armour and inability to manoeuvre to hit the side armour, thus it would be better to leave that to more manoeuvrable team members.\n\nOther tanks to worry about are the more common medium tanks each nation carries from the [[M4A1|M4 Shermans]], [[Pz.IV F2|Panzer IVs]], and [[T-34 (1941)|T-34]]s. These medium tanks have frontal armour able to resist the Matilda's 2-pounder rounds and easily out manoeuvre it as well. The most noteworthy tank to worry about is the Panzer IV with the [[KwK 40 (75 mm)|long 75 mm guns]], which can easily destroy your frontal armour.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent armour, comparable to [[KV-1 (L-11)|KV-1]].\n* Fast reloading gun with decent penetration.\n* Great in-game gun depression -20 to +20.\n* Good turret rotation.\n* It's small for a heavy tank.\n* Fast reload rate.\n* Can be paired with enemy tanks that the 2-pounder can destroy while they can't easily penetrate Matilda's armour.\n\n'''Cons:'''\n\n* Pitiful mobility, even for British infantry tanks.\n* Gun is ineffective against heavily armoured foes like the KV-1 and the Churchill.\n* Gun is inaccurate at longer ranges.\n* Slow, can't outflank others and will take a long time just to get to the combat zone.\n* Doesn't like hills and other obstacles.\n* Small caliber gun, a Rank I gun.\n* 3/4 crew in turret, 1 shot will knock out the tank.\n* Can be easily penetrated by HEAT and APCR shells, especially from German tanks.\n* Small size makes penetrating shot more likely to incapacitate entire crew.\n* Can be paired against higher tanks like the [[Pz.IV F2|Panzer IV F2]] that can easily penetrate armour.\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' --> [[File:Matilda II Italy.jpg|thumb|right|A captured Matilda II in North Africa.]]\n===Development===\nWith the development of tanks, the British Army doctrine regarding tanks split the classification into two types, the infantry and cruiser tanks. Cruiser tanks were high-speed tanks meant to exploit breakthroughs in enemy lines while infantry tanks were tanks meant to support the infantry advances. Tank developments were based off these classifications. Then in 1934, Major-General Percy Hobart came with a concept for two types of infantry tanks, one machine-gun armed tank with heavy armour and another heavier armoured tank with a cannon and machine gun. The former was developed by Vickers into the ''A11 Infantry Tank Mark I'', or the ''A11 Matilda''. The larger cannon-armed infantry tank was not produced for some time due to finance restrictions. The designing for the latter infantry tank started with the General Staff specification '''A12''' given in 1936. It was considered an improvement over the ''A11 Matilda'' and was produced by Woolwich, with Vulcan Foundry as the manufacturer. The A12 took many design implements of an older medium tank known as ''A7''. The increased armour of the developing tank suffered from a lack of engine power, to which it was solved with two AEC diesel engines used in London buses. An order for two wooden mock-ups and two steel prototypes were made to Vulcan in November 1936, to which they presented the wooden ones in 1937 and the steel prototypes in April 1938. The functioning prototype performed well in a 1,000 mile test and only required a few modifications to improve the gearbox, suspension, and the engine cooling. With the approach of World War II, the A12 was adopted and designated the '''A12 Infantry Tank Mk.II Matilda II''', but became more widely known by the name '''Matilda''' than its predecessor. The first orders were made after the trials with an order for 140 made in June 1938. Production started from 1937 from its test trials and lasted to 1943 with a total of 2,987 Matilda IIs produced.\n\n===Design===\nMatilda II, weighing in at 27 tons, was considerably well armoured for the weight it is given. At 78 mm thick, the front glacis was one of the thickest armour at the time, the [[Pz.IV E|Panzer IV]] at the time had an average armour thickness between 30 to 50 mm thick. Even the side armour of the tank was between 65 to 70 mm thick. The armour became its best known feature, that the tank was known as the \"Queen of the Desert\" for its service in North Africa. The cast three-man turret, also with great armour thickness, carried a 2-pounder and a BESA machine gun. It is traversed by a hydraulic system. Two smoke grenade dischargers are present on the right side of the turret that allows concealment when launched. The heavy armour was also the cause of the slow speed the Matilda II is also famous for, able to reach about 9.7 km/h in cross-country terrain and 26 km/h on roads. Though this slow speed was not taken as a drawback due to the tank's role as an infantry tank, going as fast as an infantry man could run made it able to support the infantry at the same pace they march. The engine powering the tank was two AEC 6-cylinder bus engines linked to a single shaft. Giving only 87 hp from each engine, the high mechanical attentions and a troublesome suspension system contributed to the Matilda's low speed.\n\n===Combat usage===\nThe Matilda II first saw service during the Battle of France in 1940 in the 7th Royal Tank Regiment. They only had 23 Matilda IIs at the start of the war, but it's presence in the Allied inventory sent waves through the German lines. The Matilda II proved to be mostly immune to all but the heaviest of German guns and are able disrupt German activities, as such in the counter attack at Arras in May 21, 1940. However, the Battle of France became lost within the months, and the remaining Matilda IIs that survived were abandoned when the Allies evacuated at Dunkirk.\n\nThe Matilda II saw service again in the North African Campaign against the Italian and German forces. In late 1940 in Operaton Compass, the Matildas in the 7th Armoured Division caused major damage in the Italian forces positioned in Egypt. The Italians, armed with only tankettes and 37-mm armed medium tanks, were unable to stop the Matilda's advances. The Matildas pushed Itlaian troops out of Egypt and all the way to Libya, where they proceeded to take over Bardia and Tobruk as well. The Matilda's armour became very well known in this time period, as in late 1941 the Axis forces, even the Germans, were still struggling to receive adequate equipment to take out the Matildas. The open terrain of the desert made the Matilda's low speed and mechanical issues a major problem, as it reduced its maneuverability. The open terrain also presented the Matilda a major target to the 88 mm FlaK guns in German inventory, which was more than capable in destroying the Matilda through the front. The devastating losses to these more potent anti-tank weaponry became well known in Operation Battleaxe in June 1941, and became more widespread with the presence of the more powerful 50 mm and 75 mm anti-tank guns in German service. Despite that, the Matildas were still used in the battlefield to fight against the Germans until they were effectively deemed insufficient against the German tanks and defenses sometime [[The_Last_Desert_Battle|in 1942]]. The Matilda could not be up-gunned with better British weaponry due to the small turret on the tank, and thus was replaced by the heavier armoured [[Churchill Mk III|Churchill]] and [[Valentine Mk IX|Valentine]] infantry tanks. These tanks proved much more economical, yet with room for upgrades, and the Matilda became a rare sight by the Second Battle of El Alamein. The remaining Matildas in North Africa were modified into mine-clearers known as ''Matilda Scorpions''.\n\nAfter being taken out of service in a front-line role, the Matilda II still saw service among British Allies. The Soviets received about 918 Matilda IIs, to which they used in the Battle of Moscow. Despite the unreliability and slowness of the Matilda II, they were used in the same capacity as their [[KV-1 (L-11)|KV-1]] heavy tanks, but the reduced firepower of the 2-pounder. Though most were lost by 1942, some were still seen as late as 1944. In the Pacific, the Matilda II continued to see use among the Australian forces, such as the 4th Armoured Brigade. It saw service in the Huon Peninsula Campaign in October 1943 and remained in service up until the end of the war. The Matilda II stayed in service due to the inferior tank designs of the Japanese tanks and the lack of heavy anti-tank guns, causing the Matildas to become dangerous foes against the Japanese forces. A few Matildas were captured by the Axis forces when a few were damaged in Operation Battleaxe, to which they were repaired and put into service by the Germans as the ''Infanterie Panzerkampfwagen Mk.II 748(e)'', which were well received by German troops despite causing confusion on friend-foe identity between the different sides.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicleCountry=britain&vehicleType=tank&vehicleClass=heavy_tank&vehicle=uk_a_12_mk_2_matilda_2 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|gR3JPNt0iPw|'''Heavyweight brits''' discusses the {{PAGENAME}} at 2:34 - ''War Thunder Official Channel''|4_cJ1CpEatw|'''Best gun depression'''  discusses the {{PAGENAME}} at 3:43 - ''War Thunder Official Channel''|DMSj1XIQ1wo|'''The Matilda Diaries Special - Breech Operation''' - ''The Tank Museum''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''\n\n{{Britain heavy tanks}}"}}