{"title":"Merkava Mk.1 (USA)","pageid":6335,"wikitext":{"*":"{{About\n| about = American medium tank '''{{PAGENAME}}'''\n| usage = other versions\n| link = Merkava (Family)\n}}\n{{Specs-Card\n|code=us_merkava_mk_1\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|market = Merkava Mk.1 (USA)\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a gift rank {{Specs|rank}} American medium tank {{Battle-rating}}. It was introduced in [[Update 1.87 \"Locked On\"]] as a reward for the 2019 [[wt:en/news/6145-special-battlefield-engineer-en|\"Battlefield Engineer\"]] crafting event.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\nThis tank has an extremely low profile, sloped frontal armour that is extremely sloped everywhere.\n\n[[File:Internal shields merkava mk1.jpg|420px|thumb|right|One of the Merkava Mk.1's secondary shields (There may be multiple of them layered over each other depending on angle of attack)]]\n\nEven if anything penetrates the front of the hull, the shell will then have to go through an assortment of modules and protection beyond the initial hull. The first in the way is a fuel tank, which shields the engine. Even if that is penetrated, there is still a list of rolled homogeneous armour behind it. Even if that is penetrated, the engine will take the entirety of shrapnel with seemingly no failure. This will often result in the tank catching fire with a destroyed transmission and/or engine but with no other damage the tank. If one tries to fire straight at the driver, the shell will most likely just ricochet, bounce off the turret and away unless it was APDS or APFSDS. Even then, any shell that hit directly from the front will likely only take down the driver.\n\nThe hull is also quite protected against ATGMs, as the module placement absorbs as much damage as [[IPM1]] and [[M1A1 Abrams]] NERA, so missiles should be fired at the turret instead unless one tries to just burn down the vehicle. In arcade mode, if an ATGM tank operator wants to destroy the tank fast, they should consider hitting the upper part of the hull next to the turret, for if only the engine is hit by projectile, then HEAT can overpenetrate it and spall into mid-section of the tank, sometimes just barely reaching the ready ammo rack and detonating it. In Realistic battle mode, simply hitting turret with ATGM might actually destroy the vehicle in one hit due to the crew loss.\n\nThe turret is well-protected, with its well-angled armour structure and layers of homogeneous armour. As such, anything short of APDS from specifically sniper tanks like [[Chieftain Mk 3]] or APFSDS have a high chance of doing no damage. The only place with no protection is the turret ring, which is vulnerable to well-aimed APHE shots.\n\nThe side hull armour of the tank is considerably weaker though and can be penetrated by APDS-equipped SPAA and light tanks. Tracks still block some shots, but it's possible to destroy the entirety of turret compartment with a high enough rate-of-fire before tank turns around. AP-I belt would probably fail to penetrate it, though.\n\nThe sides of the base of the turret seem to be a viable target for HESH, unlike the rest of the tank. Though, even there vehicle has a little fuel tank, which has a tendency to derail spalling away from last turret crew member.\n\nAs such, Merkava should avoid exposing its sides, to protect its turret crew and ammunition.\n\nIn addition to the assortment of armour, the vehicle has smoke launchers and smoke shells to cover itself.\n\nAmmunition is stored in the very back of the vehicle, at the very bottom and is covered with even more armour lists. Most of the attacks from front of the vehicle or from above will inevitably hit side skirts, turret, or other modules in way of the shell and achieve nothing. In case enemy tank attacks from behind, even tank's back is protected with layers of spaced armour, rolled homogeneous armour and fuel tanks, completely neutralizing weak chemical shells (such as HESH), or derailing HEATFS spall away from critical components. Only firing HEATFS diagonally through the shield in the middle of Merkava's rear seems to consistently achieve hitting ammunition or crew. Using AP based ammunition instead is highly advised.\n\n'''Armour type:''' <!-- The types of armour present on the vehicle and their general locations -->\n<!-- Example: * Rolled homogeneous armour (Front, Side, Rear, Hull roof)\n* Cast homogeneous armour (Turret, Transmission area) -->\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || ___ mm || ___ mm ''Top'' <br> ___ mm ''Bottom'' || ___ mm || ___ - ___ mm\n|-\n| Turret || ___ - ___ mm ''Turret front'' <br> ___ mm ''Gun mantlet'' || ___ - ___ mm || ___ - ___ mm || ___ - ___ mm\n|-\n| Cupola || ___ mm || ___ mm || ___ mm || ___ mm\n|-\n|}\n\n'''Notes:''' <!-- Any additional notes which the user needs to be aware of -->\n<!-- Example: * Suspension wheels are 20 mm thick, tracks are 30 mm thick, and torsion bars are 60 mm thick. -->\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp= 1395|rbMinHp= 796}}\n\nIn Arcade battles, the {{PAGENAME}} has a top speed of about 51 km/h forward. However, either due to extreme recklessness of its drivers, or better than average acceleration, it often gets to position faster than expected. Its reverse speed is quite low though, being about -10 km/h at best. In Realistic mode, its top speed is supposed to be about 46 km/h forward and about -8 km/h in reverse.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|Sharir (105 mm)}}\n\nThe Merkava Mk.1 uses a 105 mm Sharir cannon with a two-plane stabilizer. The default reload rate is 8.7 seconds and with crew training it will go down to 6.7 seconds. First-stage ammo stowage on the turret floor has 14 shells and the 48 remaining shells are in the back.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[Sharir (105 mm)|105 mm Sharir]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 54 || rowspan=\"2\" | -8°/+20° || rowspan=\"2\" | ±180° || rowspan=\"2\" | Two-plane || 38.1 || 52.7 || 64.0 || 70.8 || 75.3 || rowspan=\"2\" | 8.71 || rowspan=\"2\" | 7.70 || rowspan=\"2\" | 7.10 || rowspan=\"2\" | 6.70\n|-\n! ''Realistic''\n| 23.8 || 28.0 || 34.0 || 37.6 || 40.0\n|-\n|}\n\n==== Ammunition ====\nThe gun can be loaded with:\n\n* '''M152''': HEATFS; a shaped charge that can penetrate any vehicle's armour frontally. Like the APFSDS shot, increased armour thickness results in reduced amount of spalling (shrapnel) after penetration. You are able to take out enemies on any distance, since the HEAT round does not lose penetration with distance travelled - very handy on large maps like Kursk. Unlike APFSDS it has one downside: given that it is a chemical round, its fuse is highly sensitive in regards to its practical application in battle. As a result, virtually anything, such as trees or even a fence, will set it off prematurely, so you cannot fire through obstructions with this kind of round. Knowledge of potential opponents vehicle layouts will be very handy to use. It is the stock shell.\n* '''M156''': HESH; high-explosive squash head projectiles work very differently from other shell types. It ignores any angle, except for ricochet, and deals damage by metal-flakes which are blown off inside the armour by the exterior explosion. To create this deadly shrapnel inside the tank, make sure to only hit armour plates which are a direct part of the interior crew compartment of the tank. Hitting exterior parts of a tank like spaced armour, the suspension, tracks etc. will not harm crew members/modules at all. Currently, only true armour thickness (as opposed to the line of sight thickness) will provide sufficient means of protection, benefiting the USSR turret designs and in general German tanks. Like all high-explosive shells, the fuse is very sensitive and can be set-off by most objects e.g. fences, trees, pillars. The slow muzzle velocity of this shell can make it quite hard to hit targets at longer distances, but at the same time it can be handy because its arc trajectory, allows it to land hits on enemies hiding behind shallow hills.\n* '''M111''': APFSDS; a kinetic rod with high penetration power but without explosive. It is capable of easily penetrating the majority of the foes it meets, but these rounds do require finesse as to their placing. Because the projectile lacks an explosive filler, the best bet is to try and either knock out the majority of the enemy tank's crew or to destroy the enemy by ammo or fuel detonation through hitting their respective storage capacities. This, of course, requires knowledge about the vehicles the {{PAGENAME}} may face - so be sure to use the game's X-Ray view in the hangar and analyse the potential foes for their weak spots! Also, keep in mind that with increased armour thickness the amount of shrapnel shrinks.\n* '''M416''': Smoke; useful to blind enemy vehicles that are too remote for you to disable so that you can progress towards objectives.\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| M152 || HEATFS || 400 || 400 || 400 || 400 || 400 || 400\n|-\n| M156 || HESH || 127 || 127 || 127 || 127 || 127 || 127\n|-\n| M111 || APFSDS || 337 || 335 || 330 || 322 || 314 || 306\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| M152 || HEATFS || 1,173 || 10.5 || 0.05 || 0.1 || 1,270 || 65° || 72° || 77°\n|-\n| M156 || HESH || 732 || 14.85 || 0.1 || 4 || 4,310 || 73° || 77° || 80°\n|-\n| M111 || APFSDS || 1,455 || 3.79 || N/A || N/A || N/A || 78° || 80° || 81°\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"7\" | Smoke shell characteristics\n|-\n! Ammunition\n! Velocity<br>(m/s)\n! Projectile<br>Mass (kg)\n! Screen radius<br>(m)\n! Screen deploy time<br>(s)\n! Screen hold time<br>(s)\n! Explosive Mass<br>(TNT equivalent) (g)\n|-\n| M416 || 730 || 11.4 || 20 || 5 || 25 || 50\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.jpg|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 2.15.1.22''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''54''' || 31&nbsp;''(+23)'' || 7&nbsp;''(+47)'' || 1&nbsp;''(+53)'' || No\n|-\n|}\n\n'''Notes''':\n\n* Shells are modeled individually and disappear after having been shot or loaded.\n* Rack 3 is a ready rack, taking up 6 rounds before rear hull racks 1 and 2 are filled with ammunition. Due to the unique layout of the Merkava and the ammo racks being away from the front, it would not harm the tank's survivability by a large margin to carry more ammunition.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n{{Specs-Tank-Weapon|3}}\n{{Specs-Tank-Weapon|4}}\n{{Specs-Tank-Weapon|5}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|M2HB (12.7 mm)|FN MAG 60-40 (7.62 mm)}}\n\nAs for machine gun armament, the Merkava Mk.1 has one 12.7 mm M2HB and three 7.62 mm FN MAG 60-40 machine guns.\n\nTheir penetration statistics are standard for their calibre.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[M2HB (12.7 mm)|12.7 mm M2HB]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 900 (200) || 576 || N/A || N/A\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[FN MAG 60-40 (7.62 mm)|7.62 mm FN MAG 60-40]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 5,950 (200) || 600 || N/A || N/A\n|-\n| Pintle (Commander) || 1,750 (200) || 600 || -10°/+50° || ±120°\n|-\n| Pintle (Loader) || 1,750 (200) || 600 || -10°/+50° || ±120°\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThe Merkava Mk.1 have BR 9.0 in AB and 8.7 in BR and SB. In this BR range, the Merkava will face some strong enemies. Although the Merkava is designed for maximum crew survivability, but don't trust completely on that. Between the armour plates sits your engine, transmission and fuel tank, these modules can absorb some damage, but in return you will lose mobility completely or catch on fire sometimes.\n\nThe gun carried by the Merkava is familiar to all top rank tank commanders: 105 mm Sharir cannon which is a modified version of the British L7 gun. The shells it fire is also quite promising. When stock it can fire M152 HEATFS shell instead of the normal APDS shell. After research tankers can fire the powerful M111 APFSDS shell. This shell can penetrate most same-tier enemies the Merkava might face. When facing up-tier enemies, play more as a support role since you can only shoot weak spots of your enemies' front.\n\nThe mobility of the Merkava Mk.1 is not so good by MBT standard. Teammates and enemies will arrive places you normally go faster than you. Be careful when you approaching the front line, there might be enemies nearby! Due to the mobility, it is recommend again to play as a support role. It will be easier to protect the side of your team from enemies' flank.\n\nIn terms of threats:\n\n* Be careful for most MBTs firing kinetic rounds.\n* Leopards /Type 74 /OF-40: They carry the same gun as the Merkava, have almost the same rounds, but much faster. Their mobility makes them a big threat to the whole team when flanking. They are easy to kill due to weak armour.\n* AMX-30B2 Brenus: It has better mobility than the Merkava, it also have ERA which can cause trouble for players which have not yet research the M111 round. Stay back, tell your teammates, and let them finish it. It will be much easier to deal if you have the M111 round.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Armour is surprisingly effective, due to it being multi-layered\n* Sometimes capable of just driving into the capture point, as if it doesn't care\n* Has weapons and ammunition similar to the [[Centauro I 105]], which is enough for most encounters\n* Different ammunition types are cheap to use\n* ATGMs may have problems destroying this vehicle, as well as small rockets and HESH\n\n'''Cons:'''\n\n* APFSDS does not care about module-based protection and will go straight through the entire vehicle\n* Second layer of defence has a lot of openings, which can be exploited with side shots so the vehicle cannot be angled a lot\n* Turret ring and middle rear weak spots compromise vehicle's defences and make it vulnerable to APHE at close ranges\n* Side hull armour is weak, can be destroyed by light tanks with +30 mm cannons, obversely, default ammo usually fails to penetrate\n* In up-tier, it's going to be slower than most of the adversaries\n* Can be simply burned, if it cannot be destroyed normally\n* Thermal signature is in the front of the tank, that make you easy to be seen by thermal sight\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nDuring the mid-1960s, Israel began researching the possibility of developing and manufacturing a domestically designed tank. The need for such a vehicle became even more emphasized after failed negotiations with Great Britain around the same time led to Israel not being permitted to licence produce the Chieftain MBT. Thus, during the late 1960s official development on a domestic Israeli tank began.\n\nThe Israeli tank was primarily designed around combat experiences gained during the Yom Kippur War, resulting in heavy emphasis being put on crew survivability. By 1974, first prototypes of the new \"Merkava\" tank were constructed and put through initial testing. After nearly a decade of development, the Merkava Mk.1 was adopted for service by the IDF in December 1979 and modernized versions continue to serve with Israeli forces today.\n\n''- From [[wt:en/news/6140-development-merkava-mk-1-chariot-of-fire-en|Devblog]]''\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=us_merkava_mk_1 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed-hover\" heights=\"150\">\nFile:Merkava_Mk.1_WTWallpaper001.jpg\nFile:Merkava_Mk.1_WTWallpaper002.jpg\nFile:Merkava_Mk.1_WTWallpaper003.jpg\nFile:Merkava_Mk.1_WTWallpaper004.jpg\nFile:Merkava_Mk.1_WTWallpaper005.jpg\nFile:Merkava_Mk.1_WTWallpaper006.jpg\nFile:Merkava_Mk.1_WTWallpaper007.jpg\nFile:Merkava_Mk.1_WTWallpaper008.jpg\n</gallery>\n\n;Videos\n{{Youtube-gallery|yWWFv8qY5rQ|'''Battlefield Engineer: all new vehicles''' discusses the {{PAGENAME}} at 3:52 - ''War Thunder Official Channel''|iNZUNMGt1TI|'''{{PAGENAME}} - Tank Review''' - ''Napalmratte''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/6140-development-merkava-mk-1-chariot-of-fire-en|[Development] Merkava Mk.1: Chariot of Fire]]\n\n{{TankManufacturer Israeli Ordnance Corps}}\n{{USA medium tanks}}"}}