{"title":"Pz.II C","pageid":828,"wikitext":{"*":"{{About\n| about = German light tank '''{{PAGENAME}}'''\n| usage = other versions\n| link = Pz.II (Disambiguation)\n}}\n{{Specs-Card\n|code=germ_pzkpfw_II_ausf_C\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' ('''{{Specs|pseudonym}}''') is a rank {{Specs|rank}} German light tank {{Battle-rating}}. It was introduced during the Closed Beta Test for Ground Forces before Update 1.41.\n\nThe Pz.II C is a vehicle that fits well in any line-up using low-rank German tanks. The first of its column in the German tech tree, the Pz.II C can be distinguished from the later [[Pz.II F|Ausf. F]] model by its heavier frontal armour. A distinguishing feature for this series of Panzer II is the trademark 20 mm automatic cannon, which can be a curse to new users or a gift to players who know how to use the vehicle well. This autocannon can give several misconceptions on the Pz.II's utilities that can lure players into assuming it is a close quarters vehicle. The reality is much different - at close ranges, the 20 mm autocannon with its 280 round per minute (RPM) rate of fire and PzGr.40 APCR ammo can have a great effect on a single target, but the reload time and 10 round-capacity per magazine can backfire hard if the Pz.II C faces against more tanks than a single magazine can deal with.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n[[File:Pz.II C Screenshot 2.jpg|thumb|Pz.II C on frozen pass]]\nThe Pz.II C has (on the surface) decent frontal armour, with 35 mm for the front plate with a section of heavily sloped 30 mm armour on the glacis, then a sloped lower glacis that has 35 mm as well. The side, rear, and hull roof armour are a paltry 15 mm, including the turret sides. The front turret face is 30 mm that do not overlap with the 30 mm thick gun mantlet well so it will be rare, if not impossible, for a chance at relying on a 60 mm overlapping area to deflect rounds.\n\nGenerally speaking, the Pz.II C does not have enough armour to defend itself unless fighting from an extreme range (which most early-ranked tanks can't reasonably do well), facing SPAA vehicles that are only using high-explosive shells or facing against some early-ranked French tanks.\n\nPut shortly - do everything to ensure that the Pz.II C does not get hit, because even one well placed shot in the crew compartment will likely knock the Pz.II C out.\n\n'''Armour type:'''\n\n* Rolled homogeneous armour\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 20 + 14.5 mm (6°) ''Upper plate'' <br> 14.5 mm (74°) ''Upper glacis'' <br> 20 mm (33°) ''Lower glacis'' || 14.5 mm || 14.5 mm (6°) ''Upper plates'' <br> 10 mm (61°) ''Lower glacis'' || 14.5 mm (16°) ''Front glacis'' <br> 15 mm ''Crew compartment'' <br> 14.5 mm ''Rear'' <br> 10 mm (9°) ''Engine access panel'' <br> 5 mm ''Vents''\n|-\n| Turret || 20 + 14.5 mm (cylindrical) ''Turret front'' <br> 14.5 + 14.5 mm (cylindrical) ''Gun mantlet'' || 14.5 mm (21°) || 15 mm (24°) || 10 mm (15°) ''Front'' <br> 10 mm ''Rear''\n|-\n| Cupola || colspan=\"3\" style=\"text-align:center\" | 15 mm (cylindrical) || 10 mm\n|-\n|}\n'''Notes:'''\n\n* Suspension wheels and torsion bars are 10 mm thick while tracks are 15 mm thick.\n* Mudguards are 4 mm thick.\n* Belly armour is 5 mm thick.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=217|rbMinHp=124}}\n\nMobility-wise, the {{PAGENAME}} is actually better than most of its peers, but the [[BT-5|BT]] series tanks and [[M3 Stuart]]s will still outpace it quite easily. Regardless, the {{PAGENAME}} can get around the battlefield quite respectably, and the vehicle's power-to-weight ratio makes it easy to go up steep inclines than larger, heavier vehicles. However, the {{PAGENAME}} is not going to outrun a pursuing enemy team, so locating good cover is immensely useful for its survival.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n[[File:Pz.II C Screenshot 1.jpg|thumb|Pz.II C firing its main weapon]]\n{{main|KwK30 (20 mm)}}\n\nThe main armament of the Pz.II C is the 20 mm KwK 30 automatic cannon.\n\nWith the ability to load HVAP rounds capable of penetrating 48 mm at point blank range, combined with its magazine-loaded rapid fire, the 20 mm can puncture through most enemy armour at this battle rating range like it is fabric.\n\nThe biggest problem with the 20 mm autocannon is the 10 round magazines combined with a 7.8s stock reload time, meaning that the tank may successfully take out two or three enemy tanks with controlled bursts, but is likely to be taken out during the reload. Another problem to consider is in the powerful HVAP ammunition, in that its impressive penetration statistics can make the gun reach out to about 200-300 meters, but the penetrative power drops off rapidly after that due to velocity drop, even more so than the standard PzGr round.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"6\" | [[KwK30 (20 mm)|20 mm KwK30]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 180 (10) || rowspan=\"2\" | 280 || rowspan=\"2\" | -9°/+20° || rowspan=\"2\" | ±180° || rowspan=\"2\" | Vertical || 13.33 || 18.45 || 22.40 || 24.77 || 26.35 || rowspan=\"2\" | 7.80 || rowspan=\"2\" | 6.90 || rowspan=\"2\" | 6.36 || rowspan=\"2\" | 6.00\n|-\n! ''Realistic''\n| 8.33 || 9.80 || 11.90 || 13.16 || 14.00\n|-\n|}\n\n==== Ammunition ====\n\n* '''Default:''' {{Annotation|API-T|Armour-piercing incendiary tracer}}{{-}}{{Annotation|HEFI-T*|High-explosive fragmentation incendiary tracer (self-destroying)}} - The belt composition means that 50% of the shells (HEFI-T*) are useless against tanks. However, this belt is reliable against open-topped or thin-skinned vehicles like SPAA vehicles. Since there are no dedicated high-explosive shells for the selection, having one belt of this in reserve does not hurt for those situations.\n* '''PzGr:''' {{Annotation|API-T|Armour-piercing incendiary tracer}} - This belt offers a good transition from the Default to the PzGr 40 belt. The round offers decent damage against lightly armoured tanks, especially at close range. Due to lack of high-explosive filler, however, it is better to focus on the PzGr 40 belt to maximize penetration power.\n* '''PzGr 40:''' {{Annotation|HVAP-T|High-velocity armour-piercing tracer}} - Probably the best belt with the best penetrating shell for the vehicle. While the damage effects post-penetration can be quite poor, the rapid fire from the autocannon can mitigate this problem by following up quickly with another penetrating shot. In close combat, these shells should be used against modules and crew member to make the most of each shell. Against angled armour, however, the HVAP ammo may not be very effective. Unlike the Flakpanzer 1 and Flakpanzer 38, this belt is still 100% HVAP.\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"7\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Belt\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| Default || 37 || 34 || 23 || 14 || 9 || 6\n|-\n| PzGr || 37 || 34 || 23 || 14 || 9 || 6\n|-\n| PzGr 40 || 48 || 45 || 31 || 20 || 13 || 8\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Belt details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Belt\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| PzGr || API-T || 800 || 0.15 || N/A || N/A || N/A || 47° || 60° || 65°\n|-\n| PzGr 40 || HVAP-T || 1,050 || 0.1 || N/A || N/A || N/A || 66° || 70° || 72°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 2.13.0.125''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''18''' || 11&nbsp;''(+7)'' || 7&nbsp;''(+11)'' || 1&nbsp;''(+17)'' || No\n|-\n|}\n'''Notes''':\n\n* Ammunition is modeled as 18 magazines of 10 rounds.\n* Racks disappear after you've fired all magazines in the rack.\n* Right flank empty: 11&nbsp;''(+7)'' magazines.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|MG34 (7.92 mm)}}\n\nMounted opposite to the 20 mm autocannon is the MG 34, which is loaded with a 50-round belt with an AP-I/AP-I/AP-T ammo pattern. With 13 mm of maximum penetration at point blank range, this gun's 800 RPM rate of fire will make short work of unarmoured vehicles like truck-based SPAA, as well as exposed enemy crew members.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[MG34 (7.92 mm)|7.92 mm MG34]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 1,800 (150) || 900 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe main key to success with this vehicle is to drive aggressively, trying to take shots at relatively close range (100-300 meters or even less). Aim for the enemy's weak spots such as modules and crew members. Go for flank or rear shots in order to make the most of the 20 mm close-range penetration power on the enemy's thinner armour plates.\n\nWhen positioning the Pz.II C, try to use the terrain to remain hull down so that a quick reverse can mask the hull. With this position, the Pz.II C can quickly scoot forward and fire off a few quick shots before reversing to a safe position away from enemy fire. Keep this in mind when attempting to ambush the enemy in an open arena with little cover, as cover and concealment are more reliable in disrupting enemy return fire accuracy than the Pz.II's thin armour.\n\nAlternatively, the Pz.II C can be played as a support vehicle, a second line tank, to say the least, to assist more armoured allies when pushing the cap. Use short bursts (2-4 rounds ideally) to disable enemy vehicles by targeting weak points like their transmission or turret crew, then use the remaining ammo to take out the rest of the enemy crew, or let friendly tankers take them out for assists. The Pz.II C lacks the mobility to disengage and run from tanks like the M3 Stuarts or BT series tanks, but if their transmission, driver, or tracks are taken out, they will be temporarily immobilized and the Pz.II C player has bought themselves time to scurry back to friendly lines, where more powerful guns and numbers can be brought to counter the enemy.\n\nAlso, as a light tank with decent speed and low profile, the Pz.II C can act as a spotter (unfortunately without the use of the [[Scouting|scout]] mechanics) to locate enemy tanks for allies to prioritize and hit with guns, artillery, or airstrikes.\n[[File:Pz.II C Screenshot 3.jpg|thumb|Pz.II C driving through frozen pass]]\nThe biggest threat to the Pz.II C on the battlefield are tanks that have very good armour and firepower at the expense of their mobility. The [[Valentine Mk I|Valentine]], [[FCM.36]], and [[Matilda Mk II|Matilda]] are examples of tanks that will easily deflect even 20 mm PzGr 40 shots, either due to their impressive frontal hull and turret armour, or just because they are so slow that the Pz.II C will engage them at ranges that render the shell penetration power ineffective. If one of these tanks are spotted trundling along in the distance, do not bother taking the shot because the 20 mm are unlikely able to do even cosmetic damages, while at the same time drawing their attention and revealing the Pz.II C's position due to the shell tracers.\n\nGenerally speaking, if the target is about the size of a coin when looking at it on max zoom in the gunner's sight, it is too far for effective fire and should not be engaged.\n\nA more advanced method of playing this is to use it like an autoloading gun from higher BRs - fire only one or two shots per click at a given time. This helps avoid spraying uselessly at bigger, more stubborn targets.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Decent frontal armour: when angled it can be immune to common opponents like the [[BT-5]], [[BT-7]], [[M3A1 Stuart|M3A1]] and [[A13 (Family)|A13]]\n* Overall superior firepower: autocannon shoots rapidly, resulting in denser fire, and with the PzGr 40 belt it can penetrate any tank, including the [[B1 bis]] when aiming correctly\n* Has a stabiliser. Quite poor, but enough to fire precisely while reversing.\n* Fast top speed and great agility makes it a great flanker\n* Curved turret armour of 30 mm plus -10 degrees gun depression allows it to hull-down on hills easily\n* Small width means it can manoeuvre through or hide in narrow passages in urban maps, allowing it to ambush or flank unexpectedly\n* Low profile makes it easy to hide behind bushes or cover\n* In Simulator mode, friendly fire is less likely due to the very distinct shape and profile\n\n'''Cons:'''\n\n* Only performs well at close quarters combat, as both the AP and HVAP penetration drop below 30 mm past 500 m, making it struggle to penetrate common opponents such as the [[M3 Stuart (Family)|M3]]/[[M5 Stuart (Family)|M5]] Stuart and B1 bis\n* Magazine-loaded armament means there is lengthy downtime for reloading where you are vulnerable\n* Survivability is still inadequate: unsloped armour plus closely-packed crew of 3 means it is very vulnerable to [[T-26]], BT-5 or [[M8 General Scott (Family)|M8 Scott]] which all have explosive AP\n* Although top speed is good, it is still slower than other light tanks like the infamous BT-5, [[M8 Greyhound (Family)|M8 Greyhound]] and M3/M5\n* Poor damage of 20 mm shells means that new players cannot effectively destroy spacious tanks like [[LVT(A)(1)]]\n* Low penetration when not using HVAP-T rounds. When stock it is useless against a B1 bis or M3/M5 (frontally)\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n===Development===\nIn 1934, the development of the new German tanks, which would be the [[Pz.III E|Panzer III]] and [[Pz.IV E|Panzer IV]], was falling behind schedule despite an urgent need for tanks. As a stopgap solution until the designs were finalized, the Germany Army submitted a request for a new tank, giving the responsibility of designing to Krupp, MAN, Henschel, and Daimler-Benz. The product was a design based off the German Panzer I light tank, but was larger with the addition of an extra bogie wheel and had a 20 mm autocannon as its main armament. The finished tank was designated the '''Panzer II''' and production was to start in 1935, but tank deliveries did not start until 18 months later. At this time, it was in a low rate production status by 1936. By the time the Panzer II reached the '''Ausf. C''' designation, it was fitted with an improved suspension system to support the tank's weight. The changes included five larger wheels attached to new leaf springs. In 1937, the Ausf. C entered full production with MAN and other manufacturers. Over 1,600 Panzer II light tanks were produced between 1937 to 1942.\n\n===Combat usage===\nThe Panzer II would serve in the initial stages of World War II in Poland, France, North African Campaign, and Operation Barbarossa as Germany's most numerous tank (By May 1940, there were about a thousand Panzer Is and IIs, but only 381 Panzer III and 290 Panzer IVs). By 1941, it was clear that the Panzer II was starting to become obsolete. With increasing quantity of Panzer IIIs and IVs, the Panzer II was relegated to reconnaissance duties. By 1942, it was largely removed from front lines and production ceased by 1943. The turrets of these tanks were repurposed for use on defensive bunkers on the Atlantic Wall, and the chassis continued in service for other roles, such as a self-propelled gun and tank destroyer in the ''Wespe'' and ''Marder II'' respectively.\n\nEarly in the war during Poland and French Campaigns, the Panzer II Ausf. C's armour was deemed inadequate as every anti-tank weapon in service at the time could penetrate the armour. The German response was to increase the armour, first with a front armour increase to 30 mm on the Ausf. D, then ending with a 35 mm front armour and 20 mm side armour on the [[Pz.II F|Panzer II Ausf. F]].\n\n=== In-game description ===\nThis variant of the Pz.Kpfw. II light tank was designed by Henschel and produced by Daimler-Benz.\n\nThe Pz.Kpfw. II Ausf. C was the third production variant of the tank. It differed from the Ausf. A and Ausf. B tank variants in its improved engine cooling system and the installation of 50 mm thick armoured glass in the observation units. The new tank hull was 30 mm taller and 57 mm wider.\n\nIn 1940, Ausf.C variant tanks were upgraded: the frontal armour of the turret was reinforced with armour sheets 14.5 mm and 20 mm thick, and the frontal armour of the hull was further enhanced 20 mm plates. The construction of the body's front section was modified: over the bent 14.5 mm armour plating protecting the crew, two more plates were welded, joined to one another at a 70° angle. The upper plate had a thickness of 14.5 mm, the lower, 20 mm. A mounted turret which allowed for 360° observation replaced the two-hinged hatch in the tank's roof.\n\nThe front and rear rim of the turret was protected by a special armoured collar. The gun mantlet was equipped with a protective lipped shield on the top and bottom that prevented the joints of the mantlet and edges of the opening from being hit with shrapnel. The gap between the turret box and turret was protected by an armoured collar which was welded to the roof of the box. The driver/mechanic's hatch also received an armoured shield.\n\nThe tank's armament remained unchanged, but a modified TZF4/38 sight was installed, and the rear of the hull could have smoke grenade launchers (two on each side) mounted to it.\n\nSerial production of Pz.Kpfw. II Ausf. C tanks lasted from July 1938 to March 1940 and manufactured 100 vehicles.\n\nDespite its outdated design and weak armament, the Pz.Kpfw. II Ausf. C was used very actively in combat until mid-1942. Some tank divisions on the Eastern Front used the tanks till 1943.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=germ_pzkpfw_II_ausf_C Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Sights\n\n* [https://live.warthunder.com/post/675135/en/ RideR2's Realistic gunsight (TZF4a, TZF 5a/b/d/e/f/f2, TZF 9b/b1/c/d, TZF 12/a) for Pzkpfw II, Pzkpfw III, Pzkpfw IV, Pzkpfw V, Pzkpfw VI]\n\n;Videos\n{{Youtube-gallery|VX-W-nH8Nfs|'''{{PAGENAME}} Tank Review''' - ''NUSensei''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Vehicles equipped with the same chassis\n* [[Pz.II]]\n\n;Other vehicles of similar configuration and role\n* [[T-60]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/2778/current|[Vehicle Profile] PzKpfw II Ausf C/F and DAK]]\n\n{{Germany light tanks}}"}}