{"title":"Pz.III J1","pageid":820,"wikitext":{"*":"{{About\n| about = German medium tank '''{{PAGENAME}}'''\n| usage = other versions\n| link = Panzer III (Family)\n}}\n{{Specs-Card\n|code=germ_pzkpfw_III_ausf_J\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' ('''Panzer III J1''') is a rank {{Specs|rank}} German medium tank {{Battle-rating}}. It was introduced in [[Update 1.43]]. An improvement over the J version with the longer [[KwK 39 (50 mm)|50 mm KwK 39]] gun: the Panzer III J1 provides a better punch.\n\nThis variant, compared to its predecessor - [[Pz.III J|Pz.III J]], features only few, but very important upgrades.\n\nMost importantly, the J1 variant is the first Panzer III to have the long barreled KwK 39 L/60 50 mm tank gun. This gun offers 102 mm of armour penetration at a range of 100 m and 85 mm at 500 m. In a practical sense, it is just enough to deal with most tanks at this BR, although targeting weakspots or side/rear armour is often necessary, especially against well-armoured heavy tanks like the KV-1 but that is why you have APCR ammunition. APCR comes in two sets, PzGr 40 and PzGr 40/1. PzGr 40 has the highest penetration - 137 mm at close range, but it loses penetration quite rapidly when shooting far targets and is also a higher tier modification. ''(->More info can be found below in the \"[[#Ammunition|Ammunition]]\" section.)''\n\nThe second important upgrade is the electric turret drive - greatly improving the turret traverse speed, and removing the long present weakness of all older Panzer III variants.\n\nOptimal combat distance for this vehicle is somewhere between medium to close range. But don't be mistaken, the Panzer III J1 is not an frontline tank. You should be always on the move and harass the enemy without rest as any return fire will be lethal. Don't trust your armour and instead rely on your mobility. Flanking is the best option for J1 as you can use the high RoF for good effect and hopefully avoid the incoming retribution. You don't have the best mobility for a medium tank, but you definitely remain competitive against most enemy tanks you may encounter. Always try to find some good firing positions, with available cover, and if necessary, pull back and relocate. Always avoid direct close range confrontations with main enemy force; never try to fight more than 1 enemy at the time. However - playing purely as support/sniper tank isn't optimal either, because of your lower armour penetration.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n'''Armour type:'''\n\n* Rolled homogeneous armour\n* Cast homogeneous armour (Barrel shroud, Cupola)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front !! Sides !! Rear !! Roof\n|-\n| Hull || 50 mm (12°) ''Front plate'' <br> 25 mm (86°), 50 mm (53°) ''Front glacis'' <br> 50 mm (23-69°) ''Lower glacis'' || 30 mm || 50 mm (15-41°) ''Top'' <br> 50 mm (11-66°) ''Bottom'' || 15 mm\n|-\n| Turret || 50 mm (12-25°) ''Turret front'' <br> 50 mm (12-46°) ''Gun mantlet'' || 30 mm (22-25°) || 30 mm (13-16°) || 10 mm\n|-\n| Cupola || 50 mm || 10 mm\n|}\n'''Notes:'''\n\n* Suspension wheels are 15 mm thick while tracks are 20 mm thick.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=465|rbMinHp=265}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|KwK39 (50 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[KwK39 (50 mm)|50 mm KwK39]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 84 || rowspan=\"2\" | -10°/+20° || rowspan=\"2\" | ±180° || rowspan=\"2\" | N/A || 13.33 || 18.45 || 22.40 || 24.77 || 26.35 || rowspan=\"2\" | 4.81 || rowspan=\"2\" | 4.25 || rowspan=\"2\" | 3.92 || rowspan=\"2\" | 3.70\n|-\n! ''Realistic''\n| 8.33 || 9.80 || 11.90 || 13.16 || 14.00\n|-\n|}\n\n==== Ammunition ====\n\n* '''PzGr 39''' - Armour Piercing Capped shell - This is your main ammo type, use it whenever you think it has enough penetration to penetrate your target. It deals the most damage because of its explosive filler.\n* '''PzGr 40/1''' - Armour Piercing Composite Rigid shell - This type of ammo should be used if you are having trouble penetrating your opponent, or trying to hit a fast-moving tank at some distance. However, its damaging potential is much lower, because it has no explosive filler to further enhance damage after the penetration.\n* '''PzGr 40''' - Armour Piercing Composite Rigid shell - this variation of APCR is lighter, slightly faster and offers the best penetration (up to 150mm). Use it against heavily armoured beasts like the [[KV-1 (Family)|KV-1]] (If you can't flank them). However, don't expect it to cause any real damage upon penetration, it is even worse than that of PzGr 40/1. It basically only deals damage to modules/crew straight in its path. It is therefore almost useless to fire them at things like turret cupolas, as it will usually just fly right through them.\n* '''Sprgr. 38''' - High Explosive ammo - You should carry only very few of these. They are completely useless against anything other than unarmoured AA vehicles, to which it is lethal.\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| PzGr 39 || APC || 106 || 102 || 85 || 68 || 54 || 43\n|-\n| PzGr 40/1 || APCR || 130 || 121 || 90 || 62 || 43 || 29\n|-\n| PzGr 40 || APCR || 137 || 126 || 88 || 56 || 36 || 23\n|-\n| Sprgr. 38 || HE || 5 || 5 || 5 || 5 || 5 || 5\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| PzGr 39 || APC || 835 || 2.05 || 1.2 || 9 || 28.9 || 48° || 63° || 71°\n|-\n| PzGr 40/1 || APCR || 1,130 || 1.07 || N/A || N/A || N/A || 66° || 70° || 72°\n|-\n| PzGr 40 || APCR || 1,180 || 0.9 || N/A || N/A || N/A || 66° || 70° || 72°\n|-\n| Sprgr. 38 || HE || 870 || 1.82 || 0 || 0.1 || 170 || 79° || 80° || 81°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_Pz.IIIJ1.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 1.101.1.14''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''84''' || 70&nbsp;''(+14)'' || 62&nbsp;''(+22)'' || 34&nbsp;''(+50)'' || 1&nbsp;''(+83)'' || No\n|-\n|}\n'''Note''':\n\n* Turret empty: 62&nbsp;''(+22)'' shells.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|MG34 (7.92 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[MG34 (7.92 mm)|7.92 mm MG34]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 3,750 (150) || 900 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n'''Offensive'''\n\nWith this tank, you have essentially a \"jack of all trades, somewhat good at all of them\" kind of options set. You can stick with friendly tanks, and use the cannon's high rate-of-fire and excellent stats with APCR to nab scores from either destroying the enemy or getting team assists. Another way to go on the offensive is to go for a flanking move since at practical distances (400-1,000 m) the gun's penetration statistics are far less than the maximum advertised. However, the cannon still has enough power at those ranges to at least immobilize particularly important enemy tanks like a [[KV-1 (L-11)|KV-1]] or [[Churchill Mk I|Churchill]] with a drivetrain shot. You can attempt multiple shots to destroy enemies, but by that point, you will begin receiving \"responsive fire\", and your tank's armour is not good enough to withstand more than 1-2 hits before being taken out.\n\nA possible solution is to use \"shoot and scoot\" manoeuvres, popping out to fire and then scurrying to a different spot, but this poses issues if the terrain won't allow you to have a consistent cover (which may result in a downed tank between cover) or if there simply isn't much of any cover (like on the [[Kursk (Ground Forces)|Kursk]] map's outer capture points).\n\n'''Defensive'''\n\nWhen on the defense, you have a number of advantages and some severe disadvantages - being able to hunker down and hammer in shots with the long 5 cm cannon away from the immediate frontlines mean that most tanks that you will face will likely be more focused on more offensive-oriented players in your team, which may cause them to unintentionally show their hull sides towards the Panzer III J1's position. This scenario, combined with your excellent rate of fire and penetration statistics, means you can make quick work of an unsuspecting light or medium tank, assuming you can find cover in a location the enemy will not be looking at.\n\nIf detected or ranged by a tank or tank destroyer (assuming they have an angle that negates your cover's protection), your armour will not protect you from very much, as even 20mm AP rounds can penetrate the armour plates if close enough. If you simply find yourself stuck behind cover because the enemy has your position, it is advised to pop smoke (as you have multiple use smoke-grenade launchers) and use the smoke to full effect, making it as difficult as possible for enemy tanks to get an exact bearing on your position as you try to move to better or another cover in general.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Great firepower: high rate of fire, high penetration, and explosive filler\n* Quite mobile and fast\n* Excellent -10° gun depression\n* APCR is great against moving or heavy targets like Matildas\n* Boxy armour construction is great when angling\n\n'''Cons:'''\n\n* APCR has poor damage against modules and crew, and low penetration at range\n* Gun lacks penetration at range, is likely to bounce on armour slopes\n* Overall weak armour, can be penetrated by common enemies like T-34, T-50, M3 Lee\n* Turret rotates slowly, fatal if being flanked\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n===Development===\nThe '''Panzerkampfwagen III''' medium tank, or the '''Panzer III''' was developed in the 1930s. Starting in early 1934, Heinz Guderian set down some specifications for a new tank, which the Army Weapons Department took up to design the tank to weigh no more than 24,000 kilograms with a top speed of 35 km per hour. This tank's role was to be the main tank of the German army and was expected to destroy opposing tanks, as opposed to a tank made to destroy anti-tank guns and opposing infantrymen, which the [[Pz.IV C|Panzer IV]] served as.\n\nDaimler-Benz, Krupp, MAN, and Rheinmetall produced prototypes meeting the specifications and the Daimler-Benz model was chosen after testing in 1936-1937. The Panzer III model used a leaf-spring suspension in its early models (Ausf. A - Ausf. D) before utilizing a six-wheeled torsion-bar suspension in the [[Pz.III E|Ausf. E]] and beyond. The Panzer III had a crew of five men, the commander, gunner, loader, driver, and assistant driver. The best feature of the Panzer III during its introduction that is the most overlooked was the three-man turret, which was not as common at the time. This frees the commander to be able to effectively command the tank while maintaining situational awareness, rather than be burdened by the role of a loader or gunner, improving combat effectiveness of the tank. The 37 mm (later 50 mm) anti-tank gun was also very effective against contemporary tanks. Despite this rather advanced design, the turret did not have a turret basket for the crew. It was a proven design and production began in May 1937. The total number of Panzer III tanks constructed in its production life was 5,774 units (excluding the far more produced [[StuG III F|StuG III]] variant).\n\n===Design===\nThe '''Panzer III Ausf. J1''' features a much better 50 mm gun compared to its predecessors, the 50 mm KwK 39, which is an improvement over the 50 mm KwK 38 by its longer barrel that provided additional accuracy. Longer cartridges with more propellant charge were used, providing extra velocity and penetration. This new 50 mm gun gives the Panzer III a fighting edge against [[T-34 (1941)|T-34]]s and [[M4|M4 Shermans]], which the older 50 mm KwK 38 had trouble fighting against. The Panzer III Ausf. J1 still featured the 50 mm armour thickness on the front and rear originally from the [[Pz.III J|Ausf. J]] variant, but later models had new offset armour on the front of the hull and turret that provide 20 mm of effective protection These armour also apply as spaced armour due to not being attached to the hull or turret mantlet. The spaced armour on the front helped defend the tank against Soviet anti-tank rounds or HEAT rounds fired at it on those plates, as it dissipates the penetration power before striking the hull.\n\n===Combat usage===\nThe Panzer III J1 was only a stopgap design to integrate the 50 mm KwK 39 into service as fast as possible. The final designs in its later models were later redesignated the [[Pz.III L|Panzer III Ausf. L]] and [[Pz.III M|Panzer III Ausf. M]]. It saw service on the eastern front, where it performed poorly against superior [[T-34 (Family)|T-34]] and [[KV-1 (Family)|KV-1]] tanks. However, it also saw service in North Africa, where it would easily defeat allied light tanks such as the [[M3 Stuart]] and the [[Crusader Mk III|Crusader]], even when outnumbered. However, the introduction of more medium tanks by the allies in the African theater would prove to be problematic for the Panzer III. Those that survived the defeat in Africa would try to defend Sicily from the allied invasion of Italy.\n\n=== In-game description ===\nThen next modification to the Pz.Kpfw.III medium tank after Ausf. J, featuring an enhanced armament.\n\nThese tanks, which were armed with KwK38 L/42 cannons, were unable to fight successfully against Soviet T-34 and KB tanks, whose armor could withstand the impact of projectiles fired by the short-barreled cannon. The tank's armament had to be enhanced. The new weapon selected was the long-barreled KwK39 L/60, which featured high ballistic characteristics. However, despite these enhanced characteristics, fighting Soviet tanks remained extremely difficult. Tanks with the new armament began to be released in December, 1941. A total of 1,067 tanks with the Pz.Kpfw.III Ausf.J modification and KwK39 L/60 cannon were produced.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=germ_pzkpfw_III_ausf_J Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Sights\n\n* [https://live.warthunder.com/post/675135/en/ RideR2's Realistic gunsight (TZF4a, TZF 5a/b/d/e/f/f2, TZF 9b/b1/c/d, TZF 12/a) for Pzkpfw II, Pzkpfw III, Pzkpfw IV, Pzkpfw V, Pzkpfw VI]\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n''Paste links to sources and external resources, such as:''\n\n* ''topic on the official game forum;''\n* ''other literature.''\n\n{{Germany medium tanks}}"}}