{"title":"Sherman II","pageid":1003,"wikitext":{"*":"{{About\n| about = British medium tank '''{{PAGENAME}}'''\n| other\n| usage-1 = other versions\n| link-1 = M4 Sherman (Family)\n| usage-2 = other uses\n| link-2 = M4 (Disambiguation)\n}}\n{{Specs-Card\n|code=uk_sherman_II\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} British medium tank {{Battle-rating}}. It was introduced in [[Update 1.65 \"Way of the Samurai\"]]. The Sherman II is the designation of the American [[M4A1|M4A1 Sherman]] and is fitted with a [[M3 (75 mm)|75 mm gun]] with access to APCR ammunition.\n\nThe Sherman II is basically a M4A1 Sherman, to which users of it in the American ground forces tree will be very familiar with. Almost everything with it is identical with the American version, however the Sherman II has access to the T45 APCR ammunition. This tank play style is one maximizing the -12° gun depression in hull-down positions and its very good automotive performances to travel with blistering speed on the battlefield to attack the enemy from a place they wouldn't expect.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n'''Armour type:'''\n\n* Cast homogeneous armour\n* Rolled homogeneous armour (Lower side hull)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 38.1-50.8 mm (48°-72°) ''Front glacis'' <br> 50.8 mm (11-58°) ''Transmission area'' || 38.1 mm (1-71°) ''Top'' <br> 38.1 ''Bottom'' || 38.1 mm (0-69°) ''Top'' <br> 38.1 mm (13-51°) || 19.5 mm\n|-\n| Turret || 76.2 mm (2-66°) ''Turret front'' <br> 50.8 mm (3-49°) ''Gun mantlet'' || 50.8 mm (0-65°) || 50.8 + 4 mm (0-60°) || 25.4 mm\n|-\n| Cupola || 50.8 mm || 50.8 mm || 50.8 mm || 25.4 mm\n|-\n|}\n'''Notes:'''\n\n* Suspension wheels are 15 mm thick, bogies are 10 mm thick, and tracks are 20 mm thick.\n* Sand skirts on the suspension sides are 4 mm thick.\n* Front armour slope not even, lower part is weaker than top.\n* A small patch on the turret front right side is thinner (50.8 mm) than the rest (76.2 mm).\n* Bolt edges on the transmission housing are 101.6 mm thick.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=620|rbMinHp=354}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|M3 (75 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[M3 (75 mm)|75 mm M3]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 90 || rowspan=\"2\" | -12°/+18° || rowspan=\"2\" | ±180° || rowspan=\"2\" | {{Annotation|Vertical|up to 24 km/h}} || 22.85 || 31.62 || 38.40 || 42.47 || 45.18 || rowspan=\"2\" | 6.50 || rowspan=\"2\" | 5.75 || rowspan=\"2\" | 5.30 || rowspan=\"2\" | 5.00\n|-\n! ''Realistic''\n| 14.28 || 16.80 || 20.40 || 22.56 || 24.00\n|-\n|}\n\n==== Ammunition ====\nWhen discussing the {{PAGENAME}}'s shells, one always has to account for the fact that it's a medium tank. This means short to medium engagement range, so realistically it can benefit more from its short-range penetration figures than long-range sniping tanks would.\n\n* M72 shot - {{Annotation|AP|Armour-piercing}} - Solid shot, stock shell. Acceptable penetration, poor post-penetration damage.\n* M48 shell - {{Annotation|HE|High-explosive fragmentation}} - Low-velocity shell useful against soft targets, in particular when hitting an open-topped vehicle. Harmless against any vehicle with more than 10 mm of armour.\n* M61 shot - {{Annotation|APCBC|Armour-piercing capped ballistic capped}} - This shell has a better penetration than the M72 thanks to its ballistic cap and a good post-penetration damage thanks to its explosive filler.\n* T45 shot- {{Annotation|APCR|Armour-piercing composite rigid}} - Subcalibre round with high penetration but only on flat surfaces, poor post-penetration damage.\n* M89 smoke shell - Useful to blind enemy vehicles that are too remote for you to disable so that you can progress towards objectives.\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| M72 shot || AP || 91 || 88 || 78 || 67 || 57 || 49\n|-\n| M48 shell || HE || 10 || 10 || 10 || 10 || 10 || 10\n|-\n| M61 shot || APCBC || 104 || 101 || 90 || 78 || 68 || 59\n|-\n| T45 shot || APCR || 139 || 135 || 121 || 105 || 91 || 79\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| M72 shot || AP || 619 || 6.3 || N/A || N/A || N/A || 47° || 60° || 65°\n|-\n| M48 shell || HE || 463 || 6.3 || 0 || 0.1 || 666 || 79° || 80° || 81°\n|-\n| M61 shot || APCBC || 618 || 6.79 || 1.2 || 14 || 63.7 || 48° || 63° || 71°\n|-\n| T45 shot || APCR || 868 || 3.81 || N/A || N/A || N/A || 66° || 70° || 72°\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"7\" | Smoke shell characteristics\n|-\n! Ammunition\n! Velocity<br>(m/s)\n! Projectile<br>Mass (kg)\n! Screen radius<br>(m)\n! Screen deploy time<br>(s)\n! Screen hold time<br>(s)\n! Explosive Mass<br>(TNT equivalent) (g)\n|-\n| M89 || 259 || 3 || 13 || 5 || 20 || 50\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_M4A1.png|right|thumb|x250px|[[Ammo racks]] of the M4A1 (identical).]]\n<!-- '''Last updated: 1.101.1.33''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! 7th<br>rack empty\n! 8th<br>rack empty\n! Visual<br>discrepancy\n|-\n|| '''90''' || 82&nbsp;''(+8)'' || 75&nbsp;''(+15)'' || 72&nbsp;''(+18)'' || 70&nbsp;''(+20)'' || 54&nbsp;''(+36)'' || 38&nbsp;''(+52)'' || 22&nbsp;''(+68)'' || 1&nbsp;''(+89)'' || Yes\n|-\n|}\nNotes:\n\n* The visual discrepancy concerns rack 8: 28 shells are modeled but it contains only 21 shells.\n* Racks disappear after you've fired all shells in the rack.\n* Flanks and turret empty: 22&nbsp;''(+68)'' shells.\n\n==== Optics ====\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n! colspan=\"3\" | {{PAGENAME}} [[Optics]]\n|-\n! Which ones\n! Default magnification\n! Maximum magnification\n|-\n! Main Gun optics\n| x1.85 || x3.5\n|-\n! Comparable optics\n| colspan=\"2\" | [[M4A2]]\n|-\n|}\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n{{Specs-Tank-Weapon|3}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|M2HB (12.7 mm)|M1919A4 (7.62 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[M2HB (12.7 mm)|12.7 mm M2HB]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Pintle || 600 (200) || 576 || -10°/+22° || ±60°\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[M1919A4 (7.62 mm)|7.62 mm M1919A4]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 3,000 (250) || 500 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe best use of the Sherman II is in defence or in an exploitation movement.\n\nIn the defence: hull-down position. Find a terrain like a hill where the Sherman can inch forward, exposing only the turret, yet be able to aim down most of the horizon with the 75 mm gun. This allows the Sherman to use the most of the turret and gun mantlet armour as well as minimizing the amount of the body able to be hit by incoming enemy fire while dishing out quite a considerable amount of fire towards the enemy with a fast-firing 75 mm gun. If enemy fire at the hull-down position intensifies or wound the crew members, simply reversing can put the Sherman under adequate cover and reposition for another attempt to attack the enemy.\n\nIn exploitation, attack enemy utilizing the Sherman's adequate speed and handling. Manoeuvre into enemy territory scanning for targets. A benefit of the fast reloads and the traverse rate of the Sherman is that it allows for quick reaction to enemies spotted at various directions. Remember, the general rule of tank combat, the first person to shoot generally wins the battle. As such, it is imperative for the success of this tactic to attack an enemy not aware of the Sherman's presence and movement. As such, an unaware enemy will probably be exposing their weak points such as the side armour, allowing for a well-placed 75 mm shot to damage the interior. Try not to be caught up in one position as being stuck in one place will cause the enemy to eventually swarm the Sherman and destroy it.\n\nWhile the Sherman isn't a purpose-built brawler, it can perform decently in that role. The frontal armour cannot be relied on, but a combination of proper positioning and careful angling can deflect some less-potent guns. As is the case with its American cousins, the Sherman II is equipped with a gyroscopic stabilizer effective at speeds up to 25 km/h (15.5 mph). This ability to shoot accurately on the move is a significant advantage in close quarters combat and meeting engagements, as the few seconds an enemy takes to stop and aim is ample time for the Sherman II to turn them into a burning wreck.\n\n'''Enemies worth noting:'''\n\n[[M4A2]] / [[M4A4 (1st PTG)|A4]]: these Sherman tanks are widely used by over 3 nations that spread across both the Allied and the Axis side, so no matter which nation you play they can be quite tough to destroy in the hands of a skilled tanker. Given the rather weak penetration of your short 75 mm gun, their hull can be almost impossible to penetrate when angled, hull down or 300m away. For a M4A4, there are 2 apparent bulges on the upper front plate, a penetration through there is a guaranteed kill most of the times. But in case the opponent covers them up or when it's a M4A2, aim for the middle parts of the gun mantlet or the turret armour unprotected by the mantlet, you can at least make them defenseless. Note that their guns are equally weak against you, so wiggle around to disrupt their aim while you reload, you have a good chance of bouncing some shells.\n\n[[KV I C 756 (r) (Germany)|KV I C 756 (r)]]:\n\nA tough tank that the M4 Sherman will experience difficulty against is this German upgunned KV-1. While the preceding KV-1's L-11 cannon is not as powerful, the 75 mm KwK40 is considerably much more powerful against the Sherman's frontal armour, and the Sherman can't easily penetrate the KV-1's thick armour particularly when it has extra armour plates attached. In the event that this hefty tank is spotted and it's angling against you, focus on the gun mantlet as it is only 50 mm thick. You can knock out its turret crew and/or armament without any problem. Or on the other hand take shots at the tall commander's cupola, there's some opportunity to take out the gunner from there. Obviously, the most ideal way is to fire shots at its sides from as close as you can get, where its armour is unsloped. Moreover, shots to the sides will undoubtedly hit its fuel tanks or ammo racks, causing a fire or ammo explosion. Remember to utilise your superior (although not excellent) mobility plus your vertical stabiliser when dealing against such heavy tanks.\n\n[[Churchill (Family)|Churchill III]] heavy tanks:\n\nThe Churchills, with their complex hulls and sturdy turrets, can be quite hard to kill at range. Again, manoeuvre as close to them as possible, the ideal distance being no more than 200 m. If they are angling their hull but facing their turret at you, only go for the turret. For the Mk I Churchills, aim at the near-vertical part of their rounded cheeks to ensure successful penetrations. For the Mk III and the German Churchill, also aim for their flat turret which is at most 89 mm. The shell should go in easily and knock out most, if not all of the crew. Only when you are facing their hull without any angles should you shoot the hull, otherwise shoot the turret only, as their big tracks can easily get in front of the frontal hull. The side hull have multiple layers of armour, some of which are weirdly angled and can absorb plenty of shells.\n\n[[Pz.IV F2]]/[[Pz.IV G|G]]/[[Pz.IV H|H]]/[[Pz.IV J|J]]:\n\nThe historical nemesis of any Sherman, the Panzer IV is one of the Sherman's biggest threats at this rank. The long barrel 75 mm gun will easily penetrate the Sherman from the front. The F2 variant is admittedly easy to deal with. A single APCBC to its hull or turret should end it pretty quickly, even at long range. The other variants are slightly harder to deal with. They have thicker hull armour, at 80 mm, which will be much harder to penetrate with the APCBC over 500 m. Luckily the turret armour remains the same at 50 mm. Either aim here with APCBC or sacrifice damage potential and use the AP round to penetrate the hull.\n\n[[StuG III F]]/[[StuG III G|G]]:\n\nAnother historical nemesis of the Sherman, and another big threat. The StuG III packs the same punch as the Panzer IV line with its long barrel 75 mm gun, whilst losing the turret, which turns out to be both an advantage and a disadvantage. Lacking a turret means that it will have to traverse the whole vehicle to target an enemy, but it also means that it has a lower profile. The StuG's armour profile is also more complex than the Panzer IV, with less flat areas. Certain areas are sloped and very bouncy. Luckily, there is a big weak spot. There are two flat plates on the front of the hull. The flat plate on the right is the drivers port. Shoot that and you are able to kill the driver, gunner and loader in one go. This is a very efficient way to destroy this vehicle. With the F variant, you can use APCBC to instantly one-shot this vehicle. With the G variant, it is more reliable to use AP at ranges within 500 m to ensure penetration.\n\n[[R3 T20 FA-HS]]:\n\nThis speedy wheeled vehicle can circle around you with ease and wipe out all your crew with its fast firing autocannon. In a close encounter, never expose your side to it, and do not even angle your hull. Face your hull directly to the R3, because on each side of the cast hull, above the inducer wheel there is a triangular area that blends and connects the upper front plate to the side. By angling the hull, this triangle becomes unangled to the R3, making it easily penetrated, and the driver / gunner will usually get knocked out first. It is harder for the R3 to penetrate your unangled hull thus giving you more time to react and destroy it.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent gun depression -12° plus the angled frontal turret allows it to utilise hills very well\n* Great penetration and post-penetration damage when using M61 shells; can frontally penetrate and one-shot most opponents like the [[Pz.IV F2]], [[M4]], [[Chi-Nu]]\n* Has access to APCR ammunition, effective against thick but flat armour like that of the [[Pz.Kpfw. Churchill (Germany)|Pz.Kpfw. Churchill]]\n* Great turret traverse speed allows it to deal with multiple threats easily\n* Adequate top speed allows it to get to positions in time, or to do tactical manoeuvres like flanking\n* Pintle-mounted HMG provides an anti-aircraft defence or anti-tank duty against tanks like [[Marder III]]\n* Fitted with a vertical stabilizer, allowing more accurate fire on the move compared to other tanks, as well as better usage of shoot-n-scoot tactics\n\n'''Cons:'''\n\n* Frontal armour is still inadequate, will get frontally penetrated and one-shot by tanks like [[Pz.IV F2]] / G, [[StuG III F]] / G, [[M10 (Family)|M10]]\n* Large profile and weak side armour; flankers like the Sd.kfz.234/2 or GAZ trucks can easily see and penetrate it\n* When opponents are angling, both AP and APCR struggle to penetrate heavy targets like [[Pz.Kpfw. Churchill (Germany)|Pz.Kpfw. Churchill]] and [[KV I C 756 (r) (Germany)|KV I C 756 (r)]]\n* Narrow tracks offer poor ground flotation, thus poor off-road capabilities. Can only reach its top speed on paved or hard surfaces\n* Prone to damage by artillery barrages, tracks can be hit and the fuel supply can be ignited\n* Ammunition storage is vulnerable to detonation\n* May tip over when travelling across steep inclines\n* The cast hull creates frontal weakspots with very little effective thickness, eg. the triangles between upper front plate and the side, and the curved hull hatches\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n===Development===\nThe Battle of France in 1940 proved to America that their current tank arsenal would not be able to withstand a German assault. The only tanks in their inventory at that time was the [[M2A4|M2 Light Tanks]] and the [[M2|M2 Medium Tank]], both are inadequate against the German [[Pz.III (Disambiguation)|Panzer IIIs]] and the [[Pz.IV (Family)|Panzer IVs]]. The US Army, in response, ordered for a tank armed with a 75 mm gun. While a 75 mm gun was available for use, a turret able to mount the gun was not. So while the turret and tank design underwent development, the 75 mm would be mounted on the stopgap design, the [[M3 Lee]] tank in a sponson mount. This interim design put the 75 mm on a lower and limited traverse mount that restricted its firing angle, but it did give the Allies a tank with the gun, so it was issued by the thousands until a better design could be made.\n\nDuring the M3's development, the designs of the 75 mm armed vehicle were being drawn up and submitted by the Ordnance Department. Specifications on the tank design were strict in order to maximize logistical support. Restrictions were made on the tank's height, width, and weight in order to make it able to be transported over bridges, roads, railroads, and on naval ships. These specifications would help the Army by making the tank be very flexible on strategic, logistical, and tactical grounds. On April 1941, the Armored Force Board chose the simplest of the designs, which was a redesigned M3 hull and chassis with a turret mounting the 75 mm gun designated the T6, completed in September 1941. This tank would then designated the Medium Tank M4 in American service. The tank would eventually become the most used Allied tank during World War II as it was lent out by the thousands in the Lend-Lease program to the Allied countries. The British called the M4 the \"Sherman\", which coined into the tank's name M4 Sherman that it would be known as in history. The production for the Shermans began on October 1941 and would continue to be produced until the end of the war in 1945 with around 50,000 units produced, making it the second most-produced tank in World War II before the [[T-34 (Family)|T-34 tank]].\n\n===Design===\nMany variants of the Shermans were produced, but they all followed a similar layout. The driver and bow gunner sat in the front driving compartment, the fighting compartment in the middle housed the turret its three crew member, and in the back was the engine compartment. The Sherman used many features present in previous American tank designs, the vertical volute suspension system (VVSS) and radial engine from the [[M2A4|M2 Light Tanks]], and the sloping armour of the [[M2|M2 Medium Tanks]]. This became a contributing factor on the Sherman's reliability on the field, as most of the design flaws were ironed out with the previous tank designs. The tank mounted the 75 mm M3 gun, giving the tank very good AP and HE capabilities. The Sherman's turret traverse speed was very fast, able to traverse a full 360 degrees in only 15 seconds, which is considerably faster than the traverse speed on most German tanks. Another unique feature on the Sherman was the installation of a gyroscopic stabilizer on the gun and sight, making the Sherman one of the first produced tanks to incorporate those features. While the stabilization was only done for the vertical plane, it kept the gun stable enough to be able to shoot on the move effectively, with a study showing a 70 % hit probability on an enemy 300 to 1,200 yards away when moving at a speed of 15 mph. However, this feature was controversial among the crew and experiences with it vary.\n\nThe [[M4A1|M4A1 Sherman]] model (known in British nomenclature as the Sherman II) ran on a gasoline Continental R975C-1 radial engine and was one of the first models of the Sherman developed. The model in-game features the early M38 telescopic sight in the M4 periscope with no zoom, which was later replaced with a M55 telescopic sight in the gun mantlet by recommendation from the British.<ref name=\"ZalogaArmorT1\">Zaloga Steven. ''Armored Thunderbolt: The U.S. Army Sherman in World War II'' Stackpole Books, 2008, \"Baptism Of Fire\"</ref> The tank's hull was fully cast, giving the tank a distinctive rounded slope front and sides. Though the rounded shape gave the frontal armour uneven angling, it provided adequate protection up to 100 mm in thickness in certain areas.  Cast armour was used because casting took less man hours to perform, but suffered from the limited capability of most American factories and was hard to repair on the field. Thus, welding was prioritized as the primary manufacturing method in the other Sherman variants.<ref name=\"ZalogaArmorT3\">Zaloga Steven. ''Armored Thunderbolt: The U.S. Army Sherman in World War II'' Stackpole Books, 2008, \"The School of Tank Technology\"</ref> Nevertheless, up to 6,281 M4A1s were produced from February 1942 to December 1943, out of the 49,234 Sherman units produced in the war.\n\n===British nomenclature===\nThe British had a different naming convention with their equipment than the Americans. It is this naming system that actually gave the M4 Medium tank their namesake \"Sherman\". As the American differentiate the M4 models with letter and numbers such as [[M4|M4]], [[M4A1|M4A1]], [[M4A2|M4A2]], and [[M4A3 (76) W|M4A3]]. The British use roman numerals past the name \"Sherman\". Thus, the nomenclature translate to:\n\n* [[Firefly «Scorpion»|Sherman I]] - M4\n* [[Sherman II]] - M4A1\n* Sherman III - M4A2\n* Sherman IV - M4A3\n* [[Sherman Firefly|Sherman V]] - M4A4\n* Sherman VII - M4A6\n\nPast these designation, there would be a letter to signify differences in model design. A designation ending with \"A\" indicates the usage of the [[M1 (76 mm)|76 mm gun]]. A designation ending with \"B\" indicates the usage of the [[M4 (105 mm)|105 mm howitzer]]. A designation ending with \"Y\" would indicate the usage of the [[M4A3 (76) W|Horizontal Volute Suspension System (HVSS)]]. Finally, a designation ending with \"C\" indicates the usage of the [[Ordnance QF 17-pounder (76 mm)|17-pdr gun]], essentially translating to the [[Sherman Firefly|Firefly]]. There was a word addition \"Hybrid\" exclusive to the Sherman I variant, meaning the M4 Hybrid design which used a cast front armour, but a welded rear design.<ref name=\"JohnChrisSherman\">Christopher John. Sherman M4 Medium Tank Amberley Publishing, 2014</ref>\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=uk_sherman_II Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|ChaaW8OgkXQ|'''{{PAGENAME}} Tank Review''' - ''NUSensei''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Other M4A1 vehicles in the game\n\n* [[M4A1]] - American equivalent of the Sherman II.\n* [[M4A1 (France)]] - French equivalent of the Sherman II.\n* [[M4A1 (76) W]] - American version with a [[M1 (76 mm)|76 mm gun]]\n* [[M4A1 (75) W (China)]] - A version with a T23 turret, but with a 75 mm gun, in the Chinese tech tree\n* [[M4A1 (FL10)]] - A premium version with an [[AMX-13]] turret placed on it; located in the French tech tree\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n=== References ===\n<references />\n\n{{TankManufacturer Ordnance Department}}\n{{Britain medium tanks}}"}}