{"title":"Shturm-S","pageid":6717,"wikitext":{"*":"{{Specs-Card\n|code=ussr_9p149\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Soviet tank destroyer {{Battle-rating}}. It was introduced in [[Update 1.89 \"Imperial Navy\"]]. This particular ATGM carrier relies purely on stealth, unlike the [[IT-1]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n'''Armour type:'''\n\n* Rolled homogeneous armour\n\n{| class=\"wikitable\"\n! Armour !! Front !! Sides !! Rear !! Roof\n|-\n| Hull || 14 mm (54°) ''Front Plate'' <br> 7 mm (80°) ''Upper glacis'' <br> 14+5 mm (38°) ''Lower glacis'' || 7 mm (23°) ''Top'' <br> 7 mm ''Bottom'' || 15 mm ''Middle'' <br> 7 mm ''Top/Bottom'' || 7 mm\n|-\n| Cupola || 7 mm (30°) || 7 mm (30°) || 7 mm (30°) || 7 mm\n|-\n|}\n'''Notes:'''\n\n* Suspension wheels are 10 mm thick while tracks are 15 mm thick.\n[[File:Shturm-S obliterated by IT-1 missing shot from 20 m.jpg|thumb|right|The side armour of the carrier might as well not exist. It should always fight while using cover or distraction of some sort.]]\nPretty much every enemy tank in the game will be able to destroy the Shturm-S including rank I anti-air.\n\nFrom the side or the roof, within 200 m the crew compartment can be penetrated by 7.62 mm. It also can be penetrated by HEAT overpressure, which is terrible. Artillery is also dangerous, as way too many close misses might ignite the ammo rack or knock out the crew.\n\nAirstrikes are especially lethal to this tank, so much, that the vehicle might as well be without armour. In the case of a cannon air raid, sides should be presented, as there is a chance the aircraft will focus on engine compartment first, in the case of a rocket raid, front should be presented, as otherwise overpressure damage will destroy the Shturm-S instantly. Since there is no way to know which plane carries what in RB mode, it is better to face enemy aircraft regardless.\n\nThe front is more or less protected from .50 calibre, so, if necessary, it can be exposed towards an enemy who still has his HMG working, but it should not be relied on.\n[[File:Shturm-S low profile demonstration.jpg|thumb|right|Despite having poor armour, Shturm-S technically can snipe right next to opponents and not be seen or hit because of it's low profile.]]\nThere are very few areas on this tank that can be hit by a cannon round and survive. The entire front is essentially an instant kill zone, as even a scratch by APFSDS will cause enough spalling to obliterate both crew members, and it is extremely rare to only lose one. Very rarely, a HEAT shell falling straight to the middle might fail to completely knock out crew members, but the chance is also very slim.\n\nThe only place where Shturm-S can survive a side shot by a cannon is the engine room in the very middle. Thus it is very important to present the tank completely flat when flanked, as to make centre of mass shot seem more lucrative (for example, in AB, some people might not even bother aiming manually and just press \"aim assist\" and \"fire\", which results in a shot straight to the middle). After hitting the engine, enemies usually aim straight for the ammo rack, so it only works once.\n\nGiven that this vehicle only has 2 crew, susceptible to any overpressure damage with paper-thin armour and both crew members tend to get shot at the same time, generally, avoid everything. Use carrier's low profile and put a solid piece of dirt between you and the enemy and only fire and gain attention of enemies if the kill is guaranteed.\n\nThe ESS can be unlocked and used in conjunction with thermal scope to fight or retreat from obsolete tanks in open fields, but it will not save from tanks which also have thermal scopes (particularly in RB, where many people use it by default, but in AB ESS might still work, as not everyone use it there) or scouting ability (particularly in AB, as it is vastly easier to use and far stronger there). ESS is also useful when fighting late ATGM helicopters with laser lock-on feature, as it will break any automatic guidance and force their gunner to guide the missiles manually with thermal scope (which may take them too long before the Shturm-S manages to load an HE-VT ATGM and fire back) and does not allow already dead helicopters to get the last laugh by automatically guiding the ATGM in spite of being torn to pieces.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp= 341|rbMinHp= 212}}\n[[File:Shturm-S swimming.jpg|thumb|right|Sometimes, swimming ability can compensate Shturm-S's mediocre mobility.]]\nThe mobility is best described as nippy but not fast. Compared to Soviet medium tanks of its BR, the {{PAGENAME}} is faster (at least in a straight line) but compared to other nations it is slower.\n\nThe mobility hindrance in higher BRs is much more noticeable for the {{PAGENAME}}, being 50% slower than MBTs such as the [[M1A1 Abrams|M1A1]]. The rear gear only goes up to -10 km/h. This reduces amount of sniping spots the carrier can reach before it gets countersniped.\n\nThe {{PAGENAME}} lacks neutral steering meaning that turning around can take some time.\n\nThe carrier can swim like most of the other Soviet light tanks.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|9M114 Shturm}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[9M114 Shturm]] ATGM || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 12 || rowspan=\"2\" | -5°/+15° || rowspan=\"2\" | ±85° || rowspan=\"2\" | N/A || 22.0 || 30.5 || 37.0 || 40.9 || 43.5 || rowspan=\"2\" | 13.00 || rowspan=\"2\" | 13.00 || rowspan=\"2\" | 13.00 || rowspan=\"2\" | 13.00\n|-\n! ''Realistic''\n| 14.9 || 17.5 || 21.3 || 23.5 || 25.0\n|-\n|}\n\nShturm-S uses ATGM launchers by picking them up with a special handle at its rear. Once the missile is fired, the handle simply discards them and picks up a new one from inside of the tank.\n\n[[File:Shturm-S stepping on a ledge.jpg|thumb|right|Due to overall Shturm-S fragility and awkwardness of aiming device placement, it is necessary to pay close attention to smallest details next to cover, as they might be more than just a decoration for Shturm-S.]]\n\nThe handle is put down if the vehicle speeds up too much (faster than 19 km/h), but if it was reloading while the tank was moving, it will pull the launcher out at the end of the reload, whether you want it or not. When launcher is pulled out, it is always pointing forward.\n\nDO NOT hold \"fire\" button while reloading or waiting for launcher to pull out, because launcher has a tendency to malfunction if you don't wait fot at least 0.2 sec after it finished. This \"malfunction\" causes the missile to simply disappear.\n\nEach missile type has great manoeuvreability, but the launch sequience is greatly complicated by the fact, that launcher (located in the very back of the tank) is offset from the actual guiding camera (located on the front-right of the tank), and missiles are launched at high speeds, causing them to often miss at close range. Since the launcher is pointing forward when pulled out, firing too early might also cause the missile to miss, depending on how much it needs to turn and compensate to get on course. Aim assist of arcade mode also has a tendency to aim lower than it should and often spontaneously breaks off because of this, so it should not be relied on for anything but AA duty.\n\n[[File:Demonstration of Shturm-S launcher aim usefulness for AB.jpg|thumb|right|Sometimes it is impossible to fight fair and square with Shturm-S, particularly when tank is pinned down behind cover. Launcher aim trick might allow to counterattack tankers who believe they've already won, if you so desire. This is far less effective in RB.]]\nThere is a (most likely unintended) feature of choosing missile launcher as a guidance device. Switching between camera and launcher can be done by choosing \"machine gun\" or \"primary weapon\" as a current weapon. The major difference is that the previous problem of inability to aim properly is diminished and there is now a special crosshair demonstrating what is the launcher really aimed at, but the launcher is automatically putting itself down after firing, and in RB missiles will only follow sniper crosshair (therefore following the launcher) so in RB this will only work at distances shorter than 50 m. Researching and installing horizontal turret drive makes this gimmick unusable in RB, so it may be worth not installing it on some maps with a lot of tight spaces. For AB, the line of sight is counted off default launcher position when the launcher is chosen as a weapon, whether it's out or not, which allows the Shturm-S to fire and guide over certain cover without losing missile control or exposing anything, but the launcher itself. Unfortunately, missiles have to be guided from third-person view or with activated aim assist, as otherwise using sniper scope will cause the missile to follow sniper crosshair, but they can be at least aimed in sniper view beforehand. This trick allows for additional tactical decisions, as while it is incredibly risky, the Shturm-S can straight up camp and attack from a flat ground right next to its opponents by using just a short uphill or a dead tank as a cover and lead surprise attacks even when it seems impossible for the carrier to aim properly using camera.\n\n[[File:Shturm-S maximum range for launcher aim RB.jpg|thumb|right|Maximum effective range for the launcher aim trick in RB is limited to about 50 m, so only use it in close quarters.]]\nThe Shturm-S cannot properly fire or aim from medium tank hulldown spots, as even the launcher itself is a bit too short to pull over such cover, so it is inferior to [[IT-1]] in that regard. In arcade mode and, at some spots, RB, tank can fire over obstacles by using a stepping stone of some sort.\n\nThe vehicle can carry up to 12 of missiles. It is necessary to choose next ATGM type before firing the current one because Shturm-S can't change payload choice after firing and can't put the wrong launcher back.\n\nWhen rearming on a capture point, the main type of ATGM is replenished first (the one on top-left of \"ammo distribution\" UI), so choose carefully. Rearming on a cap is rather slow with about 15 seconds for one missile, full rearm outside of cap in AB is about 35 seconds.\n\nMissiles are vulnerable to jamming, so when fighting tanks with IRCM, it is necessary to also attack from the side, so that the missile doesn't get derailed.\n\nThe list of available ATGM in order of acquisition:\n\n* HEAT - Default ATGM, which has about 550 mm penetration. Launched at atleast 230 m/s with high acceleration. Can deal with anything at the BR, but does only punctual damage like HEATFS. Tanks with heavy NERA or ERA amount will resist it and suffer less than fatal damage or no damage.\n\n* Tandem HEAT - ATGM with a double payload. Launched at atleast 230 m/s with high acceleration. Extremely high post-penetration damage. Designed to annihilate ERA and other countermeasures and then destroy the tank in one hit. Each payload can penetrate about 800 mm of composite armour at a flat angle. Tandem warhead ignores ERA and penetration should be calculated as if it was not present, unless you hit the target at an extreme angle, launching the actual projectile into yet another ERA layer.\n\n* HE - A guided missile with a HE payload. Launched at about 130 m/s with poor acceleration. Can penetrate about 55 mm of armour, making it on par with the second strongest HE shells in terms of pure damage. Can be used to cause overpressure damage by hitting tracks or tank's roof, similarly to HE shells, but has negligible area of effect and is weak against ERA plating. Due to its low launch speed it is suitable for close range combat, particularly in AB. Outside of the tank's own BR, it can be used as a utility ammo to destroy NERA tanks, which the tandem HEAT might not be able to even scratch. This missile has enough explosive mass to damage ground, but it has no practical application outside of AB, since damage is very low.\n\n* Proximity HE - A guided missile specifically redesigned to destroy planes and helicopters. Launched at about 130 m/s with poor acceleration. In terms of damage, it differs from HE by having a slightly higher area of effect (enough to occasionally destroy light tanks standing right next to the target) but slightly weaker penetration (enough to sometimes fail to destroy targets on direct hit) and practically no damage to the ground. It has enough fuel to fly for about 7 km away. In reality, it is mostly equal to normal HE missile. This missile also has a proximity detonator, which activates after missile flies about 300 m away from the carrier and the ground, which helps with hitting aircraft despite not having radar or any other targeting devices. While detonator is set to explode next to the aircraft (about 5 m away) if possible, certain support helicopters can survive the explosion. The proximity detonator will not react to the tanks or the ground even if brought back down to ground level and does not seem to react to rockets and other missiles, unless it is fired straight into them (they often react to it first).\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| 9M114 || ATGM || 560 || 560 || 560 || 560 || 560 || 560\n|-\n| 9M120 || ATGM (tandem) || 800 || 800 || 800 || 800 || 800 || 800\n|-\n| 9M120F-1 || ATGM-HE || 55 || 55 || 55 || 55 || 55 || 55\n|-\n| 9M220O || ATGM-VT || 51 || 51 || 51 || 51 || 51 || 51\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"11\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Range<br>(m)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| 9M114 || ATGM || 550 || 5,000 || 31.4 || 0 || 0.01 || 3,930 || 80° || 82° || 90°\n|-\n| 9M120 || ATGM (tandem) || 550 || 6,000 || 33.5 || 0.4 || 0.01 || 4,480 || 80° || 82° || 90°\n|-\n| 9M120F-1 || ATGM-HE || 550 || 6,000 || 33.5 || 0.4 || 0.01 || 6,930 || 79° || 80° || 81°\n|-\n| 9M220O || ATGM-VT || 550 || 7,000 || 33.5 || 0 || 0.01 || 6,160 || 79° || 80° || 81°\n|-\n|}\n\n==== [[Ammo racks]] ====\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! 7th<br>rack empty\n! 8th<br>rack empty\n! 9th<br>rack empty\n! 10th<br>rack empty\n! 11th<br>rack empty\n! 12th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''12''' || 12&nbsp;''(+0)'' || 11&nbsp;''(+1)'' || 10&nbsp;''(+2)'' || 9&nbsp;''(+3)'' || 8&nbsp;''(+4)'' || 7&nbsp;''(+5)'' || 6&nbsp;''(+6)'' ||   5&nbsp;''(+7)'' || 4&nbsp;''(+8)'' || 3&nbsp;''(+9)'' || 2&nbsp;''(+10)'' || 1&nbsp;''(+11)'' ||   no\n|-\n|}\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\nMechanized Ammo Rack capable of automatic loading.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\n'''Overview'''\n\nThe Shturm-S can be effective in battles if used correctly. Shturm-S commanders should make sure to use their advantages while playing to negate the weaknesses of the vehicle. For the Shturm-S, playing in a backline role behind cover at medium ranges is the best option and specific approaches depend on game mode.\n\n'''RB Strategies'''\n\nPlayers should use the thermal sights to spot enemies easily and ambush them while they are not looking. Use of cover is essential due to the total lack of armour on the Shturm, even a .50 cal machine gun can penetrate some points in the frontal armour. It is ill advised to push aggressively in the Shturm due to the ATGM launcher which will retract when moving. Additionally, engaging at long range may be difficult as the ATGMs can take some time to reach the target, meaning the target has plenty of time to move into cover. Using the Shturm at close range is suicidal. Luckily the ATGMs on the Shturm are quite satisfactory. The 9M120 ATGM has a tandem shaped warhead which negates ERA protection, and the 9M220O ATGM has a proximity fuse which can easily destroy helicopters. It is recommended to use these two ATGMs, taking mostly the 9M120 HEAT ATGM to destroy enemy armour, with a few of the 9M220O ATGM to deal with enemy helicopters.\n\n'''AB Strategies and survival tips'''\n\nSince Shturm-S is essentially countered by AB mechanics and every tank only needs to press \"aim assist\" and fire any weapon to destroy it, some extreme and outlandish tactics must be used.\n\n[[File:Shturm-S obliterated by CM25.jpg|thumb|right|Punishment for not following the harsh rules of AB is an instant countersnipe.]]\n\nTo understand, whether to even spawn Shturm-S or not, follow these questions:\n#Can you even make it to the sniper point before being shot by a hypothetical [[Leopard (Family)|Leopard]]?\n#Can you fire through or over obstacles at your sniping spot, and how many of them is there?\n#Is it physically impossible to snipe you from any other side, but front (so that you can see it coming in third person view and dodge)?\n#If it is possible to snipe you from a side, is your entire team on that side (just three tanks do not count)?\n#Can you angle upwards at that sniper spot, so that you can snipe easier?\n#Can you destroy [[CM-25]], [[Wiesel 1A2]], [[Dardo]] or [[M3A3 Bradley]] (if they are present) and do you know where they are?\n#In case enemy team currently does endless air raids, do you have ATGM-VT?\n\n[[File:Shturm-S hanging on a hill AB sniping spot.jpg|thumb|right|Sniping with Shturm-S in AB can get really weird, as it have to use unorthodox tactics. Try to not limit your imagination and you might find another interesting spot to try out.]]\nIf you answered negatively to at least two questions, it is probably better to spawn something else according to the situation, as otherwise you will just get destroyed.(For proper hulldown camping or battle in town or forest [[IT-1]] works better, for a heated brawl [[BMP-1]] works just fine, etc.)\n\nIt is possible, that following the questionnaire, you were unable to find any use for Shturm-S. Do not worry, as it is possible to make it work by imitating a vertical ATGM tank and by using hill hulldown spots which seem lunatic at first, but work just fine for Shturm-S in Arcade.\n\nThese are the tips and thought processes that you can go through to make your life easier:\n\nFirst of all, you have to deal with carrier's weaknesses, as Shturm-S can't take a hit and survive. It is ideal to fire at opponents when their marker is still dark red or just became bright red, as it means that they can only fire at the camera or, maybe, the launcher. When using HEAT warhead, an indirect shot of such kind is only possible if an enemy is at least 180 m away from Shturm-S, HE missile is somewhat slower and a 100 m or even 50 m shot might become possible, but it requires better user aim and won't work against certain tanks.\n\nThere are a few obvious choices to make using this mentality: you want to occupy a corridor in urban enviroment, that has some rubbish, slight uphill or tank carcasses in a way, so you can fire over them and enemies can't do anything about it, OR you want to occupy a hill, steep cliff or an angled rock, which will cover your entire hull and allow you to slide down when needed.\n\nSecondly, you have to work on your hulldown technique. Since even a scratch to a corner of the carrier's front will obliterate it, you should ensure that no kinetic shell can land on the tank itself, it should be absolutely physically impossible.\n[[File:Shturm-S using generic sniping spot in AB.jpg|thumb|right|By using all of the special precautions together, Shturm-S can use any regular sniping spot without being threatened at all. Never forget to angle, as otherwise you will get countersniped instantly.]]\nAngle in a diamond shape and pull your right-front corner out of cover. Camera should be on the very front as you pull the tank up. Move up ONLY until any one enemy tank is highlighted in bright red, meaning that you have aim assist onto enemy tank's turret. This will ensure that only an enemy ATGM tank or chemical shells can destroy you. If you were following the rule of \"impossibility of being shot from any side but the front\" you should be able to notice any shells coming at you and back off before they connect with the camera. Kinetic shells, which fly at insane speed, will not destroy Shturm-S if they hit the camera, so you don't need to worry about them anymore.\n\nThird step is learning new firing techniques. Since Shturm-S has to imitate vertical ATGM tanks in AB, you can use ANY cover, however ridiculous, as long as your tank can support vertical stance behind that hill, cliff, or whatever cover of your choice.\n\nOnce you have an enemy tank in you arcade mode LOS/aim assist range, go into binocular view, as it allows full 360 degree sight and is located much higher than sniper scope, allowing you to see the entire scenery freely and removing the need to expose the camera any further. Aim at an enemy tank that is located further than 180 m, press \"fire\" to aim AB marker at their turret or hull, exit binocular view, press fire again to launch missile at them. Do not touch anything after this to let the missile destroy them. Sometimes missile goes way too low, particularly when you try to annihilate other hulldown tanks, in such case try to pull the camera up a bit higher and aim at the very top of their turret, generally this should be enough.\n\nA textbook example of using this technique:\n\n<gallery mode=\"packed-hover\" heights=\"200px\">\nShturm-S snipe stage 1.jpg|Step 1: Detecting an enemy, angling and pulling the camera out until the enemy is marked in bright red. Pay extra attention to surroundings during this.\nShturm-S snipe stage 2.jpg|Step 2: Use binocular view to aim at an enemy tank and suggest it's weakspot, then hold \"fire\" to take aim at it.\nShturm-S snipe stage 3.jpg|Step 3: Exit binocular view and press \"fire\", then do not touch anything until missile hits the target.\n</gallery>\n\nAs could be seen on the screenshots, no normal tank can destroy Shturm-S which is following the rules, even if they fire back. Do not forget to move down from the firing spot after firing, as otherwise you are just giving unseen opponents time to aim chemical shells or ATGM at you, which is not ideal. If you are being focused by artillery, you can retreat. Temporary retreat can be made even into a lake, since Shturm-S can swim.\n[[File:Shturm-S sniping off plateau.jpg|thumb|right|It's not impossible to snipe from a faraway high ground in AB, but a lot of care and precautions should be taken as well.]]\nOnce you got tandem warheads, some bolder tactical moves can be taken, for example, you can camp in a semi-open spot, as long as you are out of a default aim assist range (1.5 km), as tandem HEAT can one-shot many tanks unlike default missiles. This, however, is still not recommended to do without ESS, as any player with a rangefinder or any significant game experience will adjust the sniper scope manually and snipe you. To make it more feasible, try to aquire high ground as well.\n\nIf you found a spot, which covers the tank (along with the camera) completely, but is flat and any movement might expose too much of the carrier, it is possible to swap main weapon to the launcher itself to snipe from such position without camera. Attacks should be guided from third person view as usual, or you must activate aim assist before aiming and keep it active after firing, as otherwise the missile will follow the launcher's scope into a wall. This can be used to fight in some towns, as the windows are sometimes tall enough to cover Shturm-S, but also allow it to pull the launcher above them.\n\nThe HE missile makes AB sniping even easier, as it is slow and will generally manage to curve into enemy tank roof by itself from 100 m, likely causing overpressure and destroying the target. It is also much easier to manually use at point blank ranges. Unfortunately, it is extremely ineffective against \"non standard\" soviet tanks, which you will often meet, such as [[T-55AM-1]], [[Object 268]], [[IS-7]] and so on, and is bad against many American tanks, so at least 3 Tandem HEAT should always be carried and preloaded when moving around. HE-VT is similar to normal HE in that regard and can replace it completely. If not sure about ammunition balance, try to look at the enemy team tanks in score menu (tab), as it is generally possible to guess whether you can get away with simply loading full HE or almost full HEAT loadout will be necessary.\n\n[[File:Shturm-S HE missiles efficiency AB.jpg|thumb|right|HE missile can be pretty good for close range combat unlike HEAT, but it requires some user skill and adjustment.]]\nAfter a while it will become apparent, that aircraft are a great threat to the Shturm-S. Most of the times, fighters prefer to attack BMPs and other light tanks instead of the Shturm-S, but attackers and bombers usually go straight for it if they can, because the Shturm-S can have anti-air missiles and with them essentially becomes a SAM tank (a whole BR lower than any actual SAM tanks). If you see an enemy attacker, bomber, or combat helicopter spawning, it is adviced to immediately stop sniping, back off, hold aim assist on the enemy aircraft and fire whichever ATGMs you have at it until it explodes. ATGM-VT might react to enemy rockets or missiles, but is not extremely sensitive and can be guided around such countermeasures easily, so use it whenever possible, as it makes hitting moving aircraft easy. Taking out a group of 3 planes requires pre-firing first missile before they even spawn or to use ESS after a second hit, as otherwise you might not be able to reload before one of the fighters throws itself onto you.\n\nBy fighting both ground and air, the Shturm-S can improve team chances of winning significantly. Even if you didn't do much personally and only took out 3 tanks, but crippled enemy air force by either shooting down high priority targets like [[B-57B]] or protecting allied bombers, you might just become the reason for your team winning. Since downing enemy aircraft gives airstrike points, it is possible to launch a strike craft back at the enemy team for each time they failed to bomb your teammates, putting a very serious strain on enemy top players, as it is difficult for them to steamroll weaker players when their airstrikes are constantly being cancelled and turned against them. When using an attacker a lot, make sure to also use ESS, as frustrated interceptors might just ditch your plane and go straight for the Shturm-S instead. If current battle uses planes for airstrikes, at a perfect skill level and with some luck the Shturm-S might be able to defeat 7 tanks and down 8 planes without using airstrikes at all and accumulate enough points to call a nuclear strike (15 bomber points), potentially ending the game in its favour regardless of what the team was doing. Remember, using attacker or fighter only detracts 2 or 1 points from the counter, but using a bomber resets it completely, so use attacker first, then use a bomber.\n\nIf you have to fight enemy tanks directly in AB, there are only three ways you can beat someone without dying yourself:\n\nFirst of all, don't do it if you only have regular HEAT missile, you are unlikely to deal enough damage to survive.\n\nSupport: If you see that enemy team is piling up onto your teammate, pull up and fire at them. As long as nobody is looking at you, you should be fine. After this, back off or keep moving towards next cover, stop each 13 seconds to fire again just to make them question if it's even worth fighting you. Try to not gain attention of more than one tank at a time.\n\nDirect combat with tanks that do not have autocannons: Fire Tandem warhead at the tank's cannon barrel, if you are lucky enough to actually hit it, they should back off to repair. Chase them and abuse the fact that launcher pulls out after reload regardless of your movement speed and execute the enemy tank with either Tandem or HE (whichever you prefer or need for current opponent). Remember to face the enemy tank when attacking, as launcher is always pointing forward when pulled out. In case if you prefer to use HE, it cannot break cannon barrels, but it is far easier to launch over terrain without direct camera assistance to reduce risks of dying to a random countersnipe.\n\nSmoke attack: Only feasible for a spaded tank, but can be used even in general melee range. Before the enemy got a direct aim at you (the earlier, the better), use ESS and back off into it, trying to also move away from the firing line (between them and your original spot). Go into sniper aim and toggle thermal scope(night vision) on. Since thermal scope can see through ESS, the Shturm-S temporarily transforms from a goofy situational tank to an invisible death fog machine. Even some SPAA (like the [[Falcon]]) can be very stringent about their ammo count and firing habits, so as long as they don't know where exactly you are, they won't try to spray the entire fog wall just to find you. Calmly observe their behaviour and send an ATGM straight into their weak spots. Do not let enemy tanks drive literally next to you, as \"absolute detection\" will mark the Shturm-S even through the fog at ranges up to 50 m, leading to a likely counterattack. Remember, other tanks with thermal scopes can also see through ESS (but not always use it in AB), and you cannot use it to look into \"normal\" smoke screens. Do not use this tactic against light tanks, as a single \"scout\" will mark you for the entire enemy team through smoke and they will start firing in your general direction (obviously, the Shturm-S cannot survive this).\n\nProof of ESS combat trick feasibility, even in less than perfect situation:\n<gallery mode=\"packed-hover\" heights=\"200px\">\nShturm-S ESS combat 1.jpg|Step 1: Fire off ESS and back off into it. Even if enemy tank fires back, it is likely to miss or less likely to one-shot the carrier. Ideally, you want to not get hit.\nShturm-S ESS combat 2.jpg|Step 2: Enter sniper mode and turn on thermal scope. As can be seen here, Shturm-S can see through its own engine exhaust and will easily snipe anything through it.\nShturm-S ESS combat 3.jpg|Even players which use SPAA as a combat tank often forget that they have some 2000 RPM autocannons and may also enter smoke to fight you instead of just filling it with shells. Dodge them for as long as possible and destroy them once the weapon is reloaded. In AB, avoid letting an enemy to get as close as on the screenshot.\n</gallery>\n\n'''Notable Enemies'''\n\nThere are many notable enemies for the Shturm-S, being basically any vehicle in the game armed with anything bigger than a rifle-calibre machine gun and being capable of hitting it. However, some threats are greater than others. Shturm-S commanders should watch out for:\n\nATGM tanks: They can destroy Shturm-S with overpressure and are far less likely to let you go, as they understand what you are capable of. Tanks with proximity ATGM like [[CM-25]] are the most dangerous, as they can obliterate enemies by firing over their cover and there is nothing you can do about it, but to spot and destroy them first.\n\nAutocannon armed vehicles: These will easily shred the Shturm in seconds and should be avoided. Many SPAAs can also create a shell wall to prevent missiles from destroying their teammates or themselves.\n[[File:Shturm-S checks sides.jpg|thumb|right|Remember, they are always watching and waiting for your mistakes. One can never be too paranoid when using Shturm-S.]]\nVehicles with substantial composite armour: Most vehicles at and below the tier of the Shturm-S do not have composite armour capable of stopping its top ATGM, but many top tier tanks (which the Shturm-S will face often if used at a higher BR) such as the [[M1A2 Abrams|M1A2]] or [[Challenger 2]] are able to easily stop its ATGM with their thick turret armour. Shturm-S commanders should learn the weak spots of enemy tanks. For example, almost all american top tier battle tanks can be destroyed by HE missiles hitting the middle of their upper front plate (unless they have a jammer, then hitting them directly will be next to impossible in the first place) .\n\nSniper medium tanks (mostly in AB): Other snipers are also a serious threat, since they compete for a complete domination over map with you, and they are exceptionally allergic to ATGM tanks with high missile speed, such as Shturm-S, so they will never stop trying to snipe you, until they finally do. They are the main reason for the AB rule \"Make it physically impossible to snipe you from the side\".\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Access to \"Shturm\" and \"Ataka\" ATGMs with a total of four different variants of missiles - HEAT, tandem HEAT, HE-frag, and proximity-fused HE-frag\n* Fast-flying, relatively easy to control missiles are great for long ranges and tricky shots alike\n* Very low profile - combined with good positioning, the vehicle can be invisible with only the launcher peeking over a hilltop or wall\n* Capable of travelling across water, although relatively slowly and with poor control\n* Can double as a SAM tank in AB, to a point it can single handedly dominate the sky and even protect the bombers from interceptors if fires immediately\n\n'''Cons:'''\n\n* Poor defence - the armour stops absolutely nothing but 7.62 mm MGs and may protect against 12.7 mm from a further range\n* Very vulnerable from the top, making it easy prey from the air - unless equipped with proximity HE ATGM (the last one available for unlock) for self-defence against air targets\n* Cannot change missile type mid-reload, nor after one is reloaded\n* Rearming is rather slow, and leaves you vulnerable\n* Relatively limited arc of fire; while the launcher can rotate quite a bit, either way, the guidance module sits at the front of the vehicle, and after firing at a target located to the sides of the vehicle, the missile will require some distance before flying straight - self-defence for close-range combat is difficult\n* Have to follow an extensive set of rules to be useful in AB\n* Missiles can be jammed, so although they are very useful even in rank VII, some enemies cannot be touched\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nThe MT-LB, also known as \"Mnogotselevoy Tyagach Legky Bronirovanny\" in Russian (which stands for \"Multi-Purpose Towing Vehicle Light Armoured\"), has been mass-produced since 1966. The vehicle was primarily used as an artillery tractor that acted as a means of transport of the gun crew and ammunition complements. However, as it happens with every well-designed platform, the carrier ultimately became a base for all kinds of armament sets. In the early 70s, the USSR began development of an anti-tank hypersonic missile system with a strike range of up to 5,000 metres for armoured targets. The system received the designation \"Shturm\" and was intended to be equipped on both air and ground units. In the end, it was the MT-LB that was chosen as the base for the former role. In 1979, the new ground combat vehicle was put into service under the designation 9P149 \"Shturm-S\".\n\n''- From [[wt:en/news/6175-development-9p149-shturm-s-the-invisible-hunter-en|Devblog]]''\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=ussr_9p149 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|mF0d3bos75I|'''The Shooting Range #281''' - ''Round Study'' section at 08:34 compares the missiles of the {{PAGENAME}}.|kF1OmW7f1c8|'''The Shooting Range #154''' - ''Metal Beasts'' section at 00:39 discusses the Shturm-S.}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/6175-development-9p149-shturm-s-the-invisible-hunter-en|[Devblog] 9P149 \"Shturm-S\": The Invisible Hunter]]\n\n{{USSR tank destroyers}}"}}