{"title":"StuG III G","pageid":860,"wikitext":{"*":"{{About\n| about = German tank destroyer '''{{PAGENAME}}'''\n| usage = other versions\n| link = StuG III (Family)\n}}\n{{Specs-Card\n|code=germ_stug_III_ausf_G\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|GarageImage_{{PAGENAME}}_AddArmour.jpg|ArtImage_{{PAGENAME}}.png|ArtImage2_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' (or '''{{Specs|pseudonym}}''') is a rank {{Specs|rank}} German tank destroyer {{Battle-rating}}. It was introduced in [[Update 1.43]].\n\nCompared with previous models, the G variant of the StuG III tank destroyer comes with thicker armour of up to 80 mm on the front glacis and a 75 mm StuK 40 L/48 gun that gives the vehicle characteristics on par with a Panzer IV. With this cannon on a low-profile construction due to its casemate design, the StuG III G can prove to be a formidable vehicle in the ambush role.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n\n'''Armour type:'''\n\n* Rolled homogeneous armour (hull, superstructure)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 80 mm (50°) ''Lower glacis'' <br> 80 mm (19°) ''Lower plate'' <br> 30 mm (76°) ''Bottom junction glacis'' || 30 + 5* mm (*Side skirts) || 50 mm (15°) ''Upper plate'' <br> 50 mm ''Lower plate'' <br> 30 mm (66°) ''Bottom junction glacis'' || 30 mm (4°) ''Front part'' <br> 16 mm ''Engine compartment'' <br> 30 mm (13°) ''Rear part''\n|-\n| Superstructure || 80 mm (0-11°) ''Upper plate'' <br> 80 mm (1-10°) ''Gun mantlet'' <br> 30 mm (69°) ''Upper glacis'' <br> 30 mm (50°) ''Side glacis overhanging the tracks'' || 30 + 5* mm (*Side skirts) || 30 mm || 11 mm\n|-\n| Cupola || colspan=\"3\" style=\"text-align:center\" | 50 mm (cylindrical) || 11 mm\n|-\n|}\n\n'''Notes:'''\n\n* Suspension wheels and torsion bars are 15 mm thick while tracks are 20 mm thick.\n* The side skirts protect against HEAT and HE rounds by detonating the fuses before they penetrate the vehicle..\n* The [[Add-on Armor|Add-on Armour]] module unlockable at tier IV  adds extra tracks (20 mm thick) on several weak spots.\n* The belly of the {{PAGENAME}} is 30 mm thick.\n\nWhile comparatively well armoured to other tank destroyers of its battle rating, it is not well protected enough to allow it to be a frontline assault tank. It is not recommended to attempt angling the vehicle more than 30 degrees to the enemy, as the sides are thin and will easily be penetrated if you attempt to angle the front. One slight advantage this tank has over the previous models of StuGs is the side skirts, which may prevent damage from incoming HE and HEAT shells; they do not provide a large protection bonus for incoming AP rounds, however. A penetration through the driver port can knock out the driver, gunner, and commander as they sit in a line.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=426|rbMinHp=265|AoAweight=0.45}}\n\nWhile based on the chassis of a Panzer III, the {{PAGENAME}} is uparmoured and thus heavier than a regular Pz.III medium tank. It still benefits from the same all-round mobility but lacks acceleration and top speed. The tank still accelerates decently and is able to reach a maximum speed of 43 km/h in around 12 seconds. The reverse speed is average: it will not get you out of a dangerous situation quickly but isn't a handicap either. The lack of neutral steering makes turning on the spot slow (2 km/h): make sure to build a little speed before turning and you'll be able to turn faster (6 km/h).\n\nIf enemies are approaching you to flank, try to shake your hull around to make it harder for them to shoot your tracks and transmission. Defensively, since the StuG III G is a casemate vehicle,  the key to survival is putting distance between you and the enemy. When enemies start to close the distance, keep your gun pointed in their direction and hit the reverse gear. When you have to turn toward enemies, it is recommended to use the reverse gear so you don't push out further than you need to.\n\nIf the enemy has destroyed one of your tracks, you are still able to turn in a circle and fight. Even when being fired upon, try to sit still for as long as possible to repair the track, as that is your lifeline. If your transmission or engine is taken out, you must call upon friendly forces to defend you, or help you to repair, and/or drag you back into cover.\n\nThe stock tracks are narrow and grant you a decent mobility on hard terrain (solid ground, roads) but poor mobility on soft terrain (mud, snow, sand). Once researched, the \"Ostketten\" wide tracks for snowy terrain will grant you a very good mobility on soft terrain and when driving uphill. The {{PAGENAME}} reaches 15 km/h when fording, 17 km/h when driving uphill with some speed built-up but a mere 7 km/h uphill from a stop-start (12 km/h with Ostketten).\n\nLight obstacles such as fences and bushes are not a problem but medium to large obstacles like posts, trees, concrete blocks and parked vehicles will reduce your mobility or stop you in your tracks: avoid them.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|StuK40 (75 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[StuK40 (75 mm)|75 mm StuK40]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 54 || rowspan=\"2\" | -6°/+17° || rowspan=\"2\" | ±10° || rowspan=\"2\" | N/A || 13.21 || 18.28 || 22.20 || 24.55 || 26.12 || rowspan=\"2\" | 7.67 || rowspan=\"2\" | 6.78 || rowspan=\"2\" | 6.25 || rowspan=\"2\" | 5.90\n|-\n! ''Realistic''\n| 8.92 || 10.50 || 12.75 || 14.10 || 15.00\n|-\n|}\n\nThe 75 mm StuK40 stays reliably accurate until around 1,000 m distance. Beyond 1,200 m the loss of accuracy becomes a real handicap, together with the poor magnification of the gunner's optics. It is recommended to take positions which will allow you to shoot at enemies at medium to long ranges below 1,000 m. The high muzzle velocity of your APCBC and APCR shells grants you pretty flat trajectories and thus helps firing at moving targets from medium to long distances. HE and HEAT shells are slower and will fly with a curved trajectory, so you will have to aim higher to hit the target. It is recommended to take 2-3 HE or HEAT shells in order to destroy lightly armoured trucks as AP will likely pass through them and do little to no damage and the StuG has no coaxial weapon. They will likely be moving faster than you can traverse, so glancing shots might be the only option. HE or HEAT rounds will explode on contact and the resulting overpressure can kill the entire enemy truck crew instantly, no matter where it hits. The StuG III G is not equipped with a stabilizer, so it can't shoot accurately while moving.\n\nThe gun has a limited traverse on the horizontal axis. This can make the tracking of a target difficult as targets going to the left or right can quickly move out of your gunsight. Take that constraint into account when positioning your hull in a firing spot and aiming. The traverse speed of the gun, however, is decent in comparison to other tank destroyers at the battle rating which makes your targeting process fast even in the case of hull repositioning. Elevation and depression angles of the gun are poor, so you may have to sit on top of or slightly over a hill to shoot at targets below you, or be driving up a hill to shoot at targets above you. Shooting at planes is not recommended in this vehicle as you are unlikely to hit it unless it is flying directly at you at eye level.\n\nYour reload time is similar to vehicles at the same BR, if not a little shorter than average. This can make follow-up shots quick if the enemy isn't destroyed on the first shot. The recoil is average for a German vehicle and not high enough to throw your gun too far off target after firing, but beware that it will affect you if you are balanced on a ledge or firing at your maximum horizontal angles.\n\n==== Ammunition ====\nThe ammunition available to the {{PAGENAME}} allows for engaging all types of targets:\n\n* '''PzGr 39''': APCBC; a capped armour-piercing shell with a ballistic cap that has a high penetration power and decent explosive filler. It will destroy any armoured target it penetrates.\n* '''Hl.Gr 38B''': HEAT; a shaped charge shell with good penetration power and post-penetration damage. Due to the nature of HEAT rounds, there is no penetration loss over distance: The shaped charge will penetrate the same amount of armour whether the target is 10 m away or 1,000 m away. It is a slow shell, however, and penetrates flat surfaces only. It is effective against lightly armoured and open-topped vehicles.\n* '''PzGr 40''': APCR; a composite round with a very high penetration power but no explosive filler, resulting in very poor post-penetration damage. It penetrates only flat vertical surfaces and will easily ricochet on sloped armour. It is recommended to use these only on targets that you cannot penetrate with PzGr 39.\n* '''Sprgr. 34''': HE; a high explosive round useful for destroying open-topped and lightly armoured vehicles. It is recommended to take a few of these as you don't have a coaxial weapon for use against lightly armoured targets.\n* '''K.Gr.Rot Nb.''': Smoke; an obscuring shell useful for blinding enemy vehicles that are too remote for you to disable so that you can progress towards objectives. They can also be used defensively, fired in front of you to hide behind or fired ahead of friendly forces to cover their manoeuvres. While the shell is able to kill crew members directly and damage aircraft, it is not recommended to use these to try to kill enemy vehicles.\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| PzGr 39 || APCBC || 140 || 137 || 125 || 112 || 100 || 89\n|-\n| Hl.Gr 38B || HEAT || 80 || 80 || 80 || 80 || 80 || 80\n|-\n| PzGr 40 || APCR || 166 || 162 || 146 || 128 || 112 || 98\n|-\n| Sprgr. 34 || HE || 10 || 10 || 10 || 10 || 10 || 10\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| PzGr 39 || APCBC || 750 || 6.8 || 1.2 || 14 || 28.9 || 48° || 63° || 71°\n|-\n| Hl.Gr 38B || HEAT || 450 || 4.4 || 0.05 || 0.1 || 872.1 || 62° || 69° || 73°\n|-\n| PzGr 40 || APCR || 930 || 4.1 || N/A || N/A || N/A || 66° || 70° || 72°\n|-\n| Sprgr. 34 || HE || 550 || 5.74 || 0 || 0.1 || 686 || 79° || 80° || 81°\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"7\" | Smoke shell characteristics\n|-\n! Ammunition\n! Velocity<br>(m/s)\n! Projectile<br>Mass (kg)\n! Screen radius<br>(m)\n! Screen deploy time<br>(s)\n! Screen hold time<br>(s)\n! Explosive Mass<br>(TNT equivalent) (g)\n|-\n| K.Gr.Rot Nb. || 540 || 6.2 || 13 || 5 || 20 || 50\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 2.5.1.106''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''54''' || 40&nbsp;''(+14)'' || 17&nbsp;''(+37)'' || 1&nbsp;''(+53)'' || No\n|-\n|}\n'''Notes:'''\n\n* Racks disappear after you've used all shells in the rack.\n* Pack 17&nbsp;''(+37)'' shells into battle to deplete your right flank of ammo (racks 1 & 2 emptied).\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThis tank destroyer is best played as a support vehicle. Unlike its predecessors, it has excellent armour and can be nearly invincible from long ranges. However, if playing the StuG close to the front lines, (for example, capturing points) this armour will not be adequate against the close-range power of most vehicles. Any shot which penetrates the armour will most likely destroy the vehicle due to the tight interior layout. The sides are a weak point from any ranges, so try not to show it to the enemy. It is recommended to support teammates from the flanks, attack from long ranges, and refrain from closing the distance even for objectives unless necessary. If properly concealed, the enemy will not know where they are being attacked from as they concentrate their assault forwards.\n\nOnce in a game, it is recommended to choose the spawn point patiently to pick the best area to start accepting firing positions. Wide open areas are not good for the StuGs so when repositioning, make sure it is safe before moving ahead. Flanking an enemy cap point where the where teammates are frontally attacking can present easy, distracted targets. Be careful not to get detected by the enemy and find a place where the StuG can be in cover and start shooting. Always look around, and if the situation gets bad, relocate to another vantage point. If the StuG is rooted deep in enemy lines and alone, try to hold back and attack if there is only one enemy. From long ranges, the StuG can always be a winner in 1v1 duels if played cautiously. From short ranges, the key is situational awareness and how fast the StuG can shoot the enemy before they flank and destroy. If you are being attacked from multiple enemies, try to prioritize the most dangerous ones and move from them to the less dangerous ones.\n\nNotable enemies:\n\n* American Tanks - [[M4 Sherman (Family)|M4 Shermans]] are easy targets, but their 75 mm guns can penetrate the StuG's frontal armour if unangled. 76 mm-armed Shermans are more dangerous. [[M4A3E2|M4A3E2 Jumbos]] can lead to stalemates, but getting too close can allow the Jumbo to aim for weak spots. The best way to defeat the Jumbo is to flank and hit them at the side, preferably the lower area at the suspension where it is only 38.1 mm thick.\n* Soviet tanks - [[T-34 (Family)|T-34s]] are also easy targets, but 57 mm-armed [[T-34-57|T-34-57s]] and 85 mm-armed [[T-34-85|T-34-85s]] can destroy the StuG in one or two shots. It is easy to penetrate the T-34's hull, as the hull goes nearly unchanged across all variants so they should be detected and destroyed quickly. From long ranges, angling the StuG slightly might enhance the front armour against the T-34's shells, but angling too much will allow the T-34 to punch through the vulnerable side armour. [[KV-1 (Family)|KV-1s]] can be shot through the side and the front gun mantlet, but their tough armour will often be able to bounce or eat shells. Try to destroy their mobility or weapons before they do the same to you. Autocannon-armed trucks like the [[ZiS-12 (94-KM)]] are a diminutive but real danger to the StuG. An HE or HEAT shell should be used to destroy them before they quickly flank and punch through your thin side armour.\n* British tanks - British tanks have some low calibre guns, but their high muzzle velocity and fast reload rate will penetrate and destroy the StuG easily. The Cruiser tanks and armoured cars like the [[Cromwell (Family)|Cromwell]] and [[SARC MkVI (6pdr)|SARC Mk VI]] will be difficult targets, as they are mobile and can flank quickly. Try to be the first to detect the tank and fire at them while they are trying to position themselves, as their armour can be easily pierced by the StuK40 gun. If faced with a [[Churchill Mk VII]] from the front, it is recommended to withdraw and call on teammates and aircraft for support. If the Churchill is distracted, reposition to take aim at the side armour and try to destroy the interior with a couple of APHE rounds. Other Churchills ([[Churchill I|Mk I]] or [[Churchill III|Mk III]]) can be penetrated frontally, as long as they are not angled. [[Sherman Firefly|Sherman Fireflies]] and the [[Archer]] are equipped with the excellent 17-pounder gun, which can punch through the StuG in one shot. Try to prioritize destroying these vehicles first.\n* Japanese tanks - Japanese tanks are generally overlooked and under-prioritized, but don't underestimate them and never let them flank. Even the Japanese 37 mm guns can penetrate the StuG from the side. [[M24 (Japan)|JSDF M24s]], [[Na-To|Na-Tos]], [[Chi-Nu II|Chi-Nu IIs]], and [[Chi-To|Chi-Tos]] are particularly dangerous. M24s can close the distance fast and manoeuvre faster than the StuG can blink, literally driving circles around it and blowing it up. Na-Tos, Chi-Nu IIs and Chi-Tos have good guns with great post-penetration damage. Allowing one to hit you will result in destruction.\n* Italian tanks - Italian vehicles armed with the 90 mm 90/53, like the [[Breda 501]], will be able to destroy the StuG frontally in one shot. Interestingly, the Italians also have the [[StuG III G (Italy)|StuG III G]] which, having identical capabilities to the German version, can instigate long, stalemate sniping matches between it and you. The fact that both of you have identical vehicles also means that you both have extensive understanding of both of your vehicles. Try to shoot first. The similarly configured [[75/46 M43]] is slightly more dangerous, as penetration of its upper front plate can be unreliable and its 75 mm cannon is more potent. The [[R3 T20 FA-HS]] is potent for obvious reasons.\n* Chinese tanks - When facing Chinese ground forces, they will most likely be using the tanks mentioned in the American and Soviet sections. The same concerns apply.\n* French tanks - A lot of mid-tier French vehicles like the [[M4A4 (SA50)]] have great cannons which can practically ignore the StuG's armour. Though the [[AMX-13 (FL11)]] is not one of those, its high mobility allows it to motor around the StuG and flank. The [[AMX-13 DCA 40]] can wear down the StuG's modules and crew quickly due to its quick-firing 40 mm cannon.\n* '''Swedish tanks:''' Though Swedish tanks are generally slow and carry little armour, some Swedish vehicles like the [[Pvkv II]] can be dangerous. APDS can penetrate the StuG's armour but will do little damage post-penetration. Swedish HEAT rounds at the tier can be blocked by the side skirts.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Powerful 75 mm cannon with decent penetration, great accuracy, good velocity, and a piercing APCR: even with the stock APCBC it can frontally one-shot most opponents like the [[M4]], [[T-34 (Family)|T-34]], [[Cromwell (Family)|Cromwell]] or even the [[KV-1 (Family)|KV-1]]\n* Great frontal angled armour of 80 mm plus 20 mm add-on tracks (100 mm total, same as the [[Tiger H1]]) makes it immune to low-penetrating rounds\n* Competent reverse gear and mobility\n* Low silhouette makes the StuG easy to conceal in RB and SB\n* Large side skirts can more or less provide some additional protection against HE and HEAT rounds\n* Multi-role potential: can be effective in city combat and close quarters, or long-range sniping\n\n'''Cons:'''\n\n* Vertical parts of frontal armour can be penetrated relatively easily; a penetration through the driver port can knock out the driver, gunner, and commander, resulting in instant knock-out for the StuG\n* Fixed casemate superstructure restricts gun traverse, especially in horizontal and vertical angles\n* No neutral steering, so it can't turn on the spot\n* No coaxial weapons for use against lightly armoured targets or aircraft\n* A HE shell onto the machine gun shield can send the shrapnel down through the hull roof down into the crew compartment, particularly from large calibre cannons such as the [[M-10T (152 mm)|152 mm M-10T]]\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n===Development===\nThe role of a self-propelled gun came from combat experiences in World War I. During the German offensives on the Allied front; infantry lacked artillery support against fortifications in places out-ranged by their heavy artillery behind the lines. A need for a mobile artillery piece was necessary to keep up with the German infantry and fight enemy fortifications with a direct-fire assault role. The father of this concept was German General Erich von Manstein and was coined as the ''Sturmartillerie'' (assault artillery), and these units were to be embedded in infantry divisions.\n\nOn June 15, 1936, Daimler-Benz AG was ordered to develop a support vehicle mounting the 75 mm howitzer as its armament in a casemate structure with a traverse of 25 degrees. The vehicle was to provide full protection for its crew and be no taller than an average soldier. Daimler-Benz repurposed the chassis and running gear of their [[Pz.III E|Panzer III]] design for the role. These new vehicles were named the '''Sturmgeschütz III''' (assault gun), or the shortened '''StuG III''' and the finished designs were sent to Alkett for prototype production and five were produced in 1937. These prototypes were made of mild steel and had the 75 mm StuK 37 L/24 cannon, an adaption of the original 75 mm KwK 37 cannon on the [[Pz.IV E|Panzer IV]]. This gun would be featured on the StuG III variants [[StuG III A|Ausf. A]] to Ausf. E. The StuG III entered production from January 1940 to the end of the war on April 1945 due to the many upgrades done on the vehicle to increase serviceability and its low cost. At about a total production of 11,300 StuG III and its variants, the StuG III design was the most produced armoured fighting vehicle in German service.\n\n===Design===\nThe StuG III had a fully enclosed armoured shell, keeping the crew safe within the vehicle. As a casemate structure, it has a limited traverse range for its front view, and the whole vehicle must be turned if a target is outside its traverse range. The StuG III featured about 50 mm of armour on the front, but about 30 mm of armour everywhere else, this was upgraded as the war progressed to 80 mm. The suspension system is identical to the Panzer III's, a torsion bar system. The StuG III had a crew of four, the commander, driver, loader, and gunner. Initial variants lack machine guns, so the StuG was required to work with support units to ensure it does not get overrun by infantry. It wasn't until December 1942 when a machine gun could be accommodated for the loader to use. Initial variants also did not have a commander's cupola, so his view was quite restricted. However, models after September 1943 had them installed.\n\n===Combat usage===\nDuring the initial stages of World War II, the StuG III with the 75 mm StuK 37 howitzer fared well in the campaigns in France and Poland, but when the invasion of Soviet Union commenced, the lack of German guns able to destroy their [[T-34 (1941)|T-34]] and [[KV-1 (L-11)|KV-1]] tanks prompted Germany to rearm their vehicles with newer guns. So the original StuK 37 cannon from the [[StuG III A|initial designs]] was upgraded to the 75 mm StuK 40 cannons. The [[StuG III F|StuG III Ausf. F]] has the shorter L/43 cannon, but the '''StuG III Ausf. G''' featured the longer L/48 cannon with improved design features on the vehicle. The Ausf. G was the most common and produced StuG III variant in the war. It featured a widened superstructure with a straightened back wall, also making it slightly higher with a height of 2160 mm now. The exhaust fan is moved to the back, and a commander's cupola is added onto the design. The driver's periscope on the design was abandoned, and the vehicle has Schürzen armour plates installed on the hull to protect the weaker hull sides against anti-tank rifles and HEAT rounds. Instead of the 50 mm hull armour with an additional 30 mm welded on the Ausf. F, the Ausf. G featured a solid 80 mm plate on the hull front. A machine gun mount has also become integrated into the design with a small shield for the loader as well to operate it in safety, though a \"remote\" operated version was also installed later so that the loader would only need to get out to reload the machine gun. This design is the most numerous of the StuG III variants, and the 11,300 StuG IIIs built, 8738 StuG III Ausf. Gs were built from December 1942 to April 1945, with some converted from fully built Panzer IIIs.\n\nThe new 75 mm StuK 40 cannon could engage many Allied tank designs. This upgrade changed the StuG III role from its usual infantry support role into a tank destroyer, though it can serve both roles with acceptable performance. The vehicles were deemed very successful and attributed to more tanks destroyed than any other armoured fighting vehicle in German service. The success of the StuG III urged Germany to prioritize the production of casemate structure vehicles built from chassis of other vehicles for further development in tank destroyers such as the [[Jagdpanther|Jagdpanther]], [[Jagdpanzer 38(t)|Jagdpanzer 38(t)]], and the [[Ferdinand|Ferdinand]].\n\nThe StuG III design was also made into different variants with different armaments, such as a 105 mm howitzer on the ''[[StuH 42 G|StuH 42]]'' , a flamethrower on the ''StuG III (Flamm)'', and even a 150 mm sIG 33 infantry gun on the ''Sturm-Infanteriegeschütz 33B''.\n\n===Legacy===\nThe StuG III design would see service in the entire war due to its adaptability to the changing course of the war, going from an offensive support weapon to a defensive tank destroyer. The StuG III holds the distinct title of knocking out the most Allied tanks in German service with about 20,000 tanks destroyed, much more than the better [[Panther D|Panther]] and [[Tiger H1|Tiger]] tanks. It was a widely-exported design to Germany's allies, such as Bulgaria, Hungary, Italy, Romania, Spain, and Finland. The StuG III would continue serving in various countries past World War II in conflicts in the 1960s, such as the Six Days War in Syria's service that was donated by the Soviet Union. Today, some are still serving as static pillboxes on the Golan Heights.\n\n=== In-game description ===\nThe final and most mass-produced variant of the Sturmgeschütz III. These guns began to be released in December 1942 and continued to be made until the end of the war. With these modifications, the designation of production models was changed to StuG.40 Ausf. G. The design of their conning tower was different from that of previous variants. The tower was wider, and extended halfway over both of the vehicle's treads. A commander's cupola was installed, which greatly improved the gun commander's view and required an increase in the emplacement's height, up to 2,160 mm. The ballistic protection of the gunner's sight was also improved. The first series of this assault gun still had 50 mm of forward armour, but by the summer of 1943 this had been reinforced by additional plates 30 mm thick. From May 1943 onward, the vehicles were fitted with Schurzen side skirts as a means of protection against high-explosive anti-tank shells and anti-tank rifle bullets. From August 1943 to September 1944, the assault guns were coated with an anti-magnetic Zimmerit paste. Some sources claim the paste could make shells ricochet off, but it was probably applied to counter magnetic mines.\n\nVehicles manufactured before October 1943 had a commander's cupola which could rotate, as it was mounted on ball bearings. However, due to a lack of ball bearings, the cupola began to be welded on in September 1943 and following. From August 1944 to the end of the war, the self-propelled assault guns once again had rotating commander's cupolas.\n\nIn 1944, the troops began to receive assault guns with remote-controlled machine guns to fight against infantry, in addition to a new, streamlined gun mantlet. The characteristic outline of this mantlet received the name Saukopfblende.\n\nBy the end of the war, the companies Alkett and MIAG had built 7,834 StuG.40 Ausf. G assault guns.\n\nThe overall quality of the armament and armour of this assault gun made it a frequent winner in battles against allied tanks.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=germ_stug_III_ausf_G Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|A8oDDjb-m4A|'''{{PAGENAME}} Tank Review''' - ''NUSensei''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n* [[StuG III (Family)]]\n\n;Other vehicles of similar configuration and role\n* [[SU-85]]\n* [[75/46 M43]]\n* [[Pvkv m/43 (1946)]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/3380/current|[National Forces] German Sturmgeschütz Units]]\n* [[wikipedia:Sturmgesch%C3%BCtz_III|[Wikipedia] Sturmgeschütz III]]\n* [https://tanks-encyclopedia.com/ww2/nazi_germany/Sturmgeschutz-III.php <nowiki>[Tanks Encyclopedia]</nowiki> Sturmgeschütz III]\n* [https://www.militaryfactory.com/armor/detail.asp?armor_id=257 <nowiki>[Military Factory]</nowiki> SdKfz 142 StuG III (Sturmgeschütz III)]\n\n{{Germany tank destroyers}}"}}