{"title":"T-26 (China)","pageid":7381,"wikitext":{"*":"{{About\n| about = Soviet light tank '''{{PAGENAME}}'''\n| usage = other versions\n| link = T-26 (Family)\n}}\n{{Specs-Card\n|code=cn_t_26_1940\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a reserve rank {{Specs|rank}} Chinese light tank {{Battle-rating}}. It was introduced in [[Update 1.91 \"Night Vision\"]]. It is identical to the Soviet [[T-26]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\nThe armour of the T-26 is thin, thus making the vehicle's survivability low. Armour is nearly flat on all sides, so it is recommended to not expose yourself to enemy fire. The crew are not lined up behind each other from the front, meaning that enemies using shells without HE filler may have to take up to 2-3 shots before knocking out all of your crew. Beware of heavy machine guns (common on American tanks) and autocannons (common on German and Italian tanks), since they will be able to both penetrate your armour and shred your crew/modules.\n\n'''Armour type:'''\n\n* Rolled homogeneous armour\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front !! Sides !! Rear !! Roof\n|-\n| Hull || 15 mm (22°) ''Front plate'' <br> 7 mm (64-80°) ''Front glacis'' <br> 15 mm (6-52°) ''Lower glacis'' || 15 mm (21-23°) ''Top'' <br> 15 mm (0°) ''Bottom'' || 15 mm (0°) ''Top'' <br> 15 mm (12°) ''Bottom'' || 10 mm ''Hull'' <br> 6 mm ''Rear''\n|-\n| Turret || 15 mm (13-15°) ''Turret front'' <br> 15 mm (5-44°) ''Gun mantlet'' || 15 mm (17-19°) || 15 mm (17°) || 10 mm\n|-\n|}\n'''Notes'''\n\n* Suspension wheel is 10 mm thick while tracks are 15 mm thick.\n* Belly armour is 6 mm thick.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\nWhile being a light tank, its mobility is one of a medium/heavy tank. The top speed is very low for a light tank, combined with the low power to weight ratio given by its weak engine. The T-26 has poor acceleration and speed on most surfaces. It can reach around 30 km/h only on hard, flat surface, after a long, uninterrupted acceleration period. With even a small turn the speed will drop significantly. The narrow tracks significantly reduce its off-road mobility in muddy, sandy or snowy maps. Despite the tracks being short and far apart, the T-26 still has slow hull traverse and often needs a forward/backward jerk to start turning properly. Reverse speed is also very poor (-4 km/h), which cannot save you from most bad situations. Despite these, drawbacks, it will eventually take you where you want to be, provided that you are a very patient player, choose your route well, and avoid too many tricky turns.\n\n{{tankMobility|abMinHp=141|rbMinHp=80}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n[[File:T-26 China screenshot 2.jpg|thumb]]\n{{main|20-K (45 mm)}}\n\nThe 45 mm 20-K is the typical Soviet Rank I gun. Players should get used to it since it will be your main armament until other vehicles are researched. The APHEBC round has a good amount of HE filler, meaning penetrating shells will do good damage, sometimes even knocking out enemies with a single shot. At longer ranges, shells begin to lose penetration and accuracy; it is not made for sniping. It is recommended to bring ~10-15 BR-240SP (pure AP shells) for heavier targets as they have more penetration. This gun is very forgiving to beginners, with its very fast reload speed, decent damage, and manoeuvrability.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[20-K (45 mm)|45 mm 20-K]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 205 || rowspan=\"2\" | -6°/+22° || rowspan=\"2\" | ±180° || rowspan=\"2\" | N/A || 15.2 || 21.1 || 25.6 || 28.3 || 30.1 || rowspan=\"2\" | 3.77 || rowspan=\"2\" | 3.34 || rowspan=\"2\" | 3.07 || rowspan=\"2\" | 2.90\n|-\n! ''Realistic''\n| 9.5 || 11.2 || 13.6 || 15.0 || 16.0\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | '''Penetration @ 0° Angle of Attack (mm)'''\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| BR-240 || APHEBC || 70 || 68 || 59 || 50 || 42 || 35\n|-\n| BR-240SP || AP || 73 || 71 || 62 || 52 || 44 || 37\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| BR-240 || APHEBC || 760 || 1.43 || 1.2 || 9 || 29.26 || 48° || 63° || 71°\n|-\n| BR-240SP || AP || 757 || 1.43 || N/A || N/A || N/A || 47° || 60° || 65°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_T-26.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! 7th<br>rack empty\n|-\n| '''205''' || 202&nbsp;''(+3)'' || 197&nbsp;''(+8)'' || 187&nbsp;''(+18)'' || 177&nbsp;''(+28)'' || 167&nbsp;''(+38)'' || 157&nbsp;''(+48)'' || 139&nbsp;''(+66)''\n|-\n! 8th<br>rack empty\n! 9th<br>rack empty\n! 10th<br>rack empty\n! 11th<br>rack empty\n! 12th<br>rack empty\n! 13th<br>rack empty\n! Visual<br>discrepancy\n!\n|-\n| 121&nbsp;''(+84)'' || 103&nbsp;''(+102)'' || 79&nbsp;''(+126)'' || 61&nbsp;''(+144)'' || 29&nbsp;''(+176)'' || 1&nbsp;''(+204)'' || No\n!\n|-\n|}\n'''Note''':\n\n* Turret empty: 157&nbsp;''(+48)'' shells.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|DT (7.62 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[DT (7.62 mm)|7.62 mm DT]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 1,890 (63) || 600 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\n;Combat tactics:\n\nIt is recommended to play the T-26 in a support role, flanking the battlefield and finding a good position to support your teammates from. The 45 mm cannon has very good characteristics with its rounds (APHEBC, AP) being able to deal a fair amount of damage to enemy vehicles from both short and long-range. The fast reload allows for quick adjustment of aim between shots, meaning the T-26 can be a highly effective flanking vehicle if a good camping spot is found. The limited gun depression however, (-6°) will affect which positions are usable. Keeping back at long-range is certainly an effective way to avoid taking damage. \n\nThe T-26 can also be used for brawling with enemy vehicles, but it should be kept in mind that the thin armour on the T-26 (≤15 mm) will leave the vital modules of your vehicle such as your crew, gun and powerplant (engine & transmission) at risk of taking damage. The mobility of the T-26 is also less than many of its counterparts like the [[Pz.35(t)]] or the [[M2A4]], which could potentially put it at risk in a brawling scenario. On the other hand, the T-26's quick reload will usually give it an upper hand if you can survive the first shot.\n\nDue to the top speed of the T-26 being less than many other vehicles at its BR (30 km/h), it will usually arrive in the battlefield after the fighting has already begun. This can be an advantage in that you arrive after your team has already identified many targets. This also means that you will most likely not be on the front line of attack will usually allows for you to last a bit longer than players who rushed the center of the battlefield. On the other hand, it is also less likely that you will reach capture points before they are capped by your teammates, who will be faster than you.\n\nThe lack of armour is really something to be kept in mind, even some tank machine guns like the  [[M2HB (12.7 mm)|12.7 mm M2HB]] and [[Breda Model 31 (13.2 mm)|13.2 mm Breda Model 31]] will be able to go through your thickest pieces of armour (15 mm). Because of this, it is recommended to try your best to avoid enemy vehicles getting the first shot. Driving under cover is advisable to avoid being spotted. \n[[File:T-26 China screenshot 1.jpg|thumb]]\nIn terms of the T-26's gun, there are 2 round options. The APHEBC round has a maximum of 70 mm effective penetration with an explosive filler. This will allow for the round to penetrate most armour at the BR and also do a good amount of post-penetration damage if the fuse is set off. The second round type is an AP round. This has a maximum of 73 mm effective penetration, but lacks any explosive filler. This makes its post-penetration damage less effective than the APHEBC round. More information on these two options can be found in the [[#Ammunition|ammunition]] section above.\n\nIt is also worth keeping in mind that the T-26 only has a reverse speed of 3 km/h. This is important to remember when driving into potential enemy fire. It is recommended to be aware of enemy positions and cover, as a retreat will be a lot slower than an advance.\n\nBe aware that enemy aircraft with bombs or powerful guns can easily take out the T-26. It is advised to stick to the treeline to avoid being spotted and attacked. The T-26 has little anti-aircraft capabilities so it is advised to let the friendly SPAAs deal with aircraft.\n\n;Specific enemies worth noting:\n\n[[Pz.II]] - These speedy German tanks can be extremely dangerous. Their fast firing [[KwK30 (20 mm)|20 mm KwK30]] or [[KwK38 (20 mm)|KwK38]] autocannons can shred your armour and the modules behind it. Pz.IIs have better mobility than the T-26 to boot. Generally, it is advised not to engage head on but if you are forced to, then make sure you get off the first shot before they start spraying. These concerns are also shared with the [[Sd.Kfz. 140/1]]. The good thing about facing the Panzer II is that it doesn't have much armour, like most Rank I vehicles, so you can easily penetrate and knock it out with a single shot. Another tactic is to have a teammate with you, preferably a mobile light tank like the [[M22]] or the [[BT-5]]. Your ally can distract the Panzer II while you line up your shot to take it out. Pz.IIs also have poor turret traverse speed, so getting behind it and shooting its engine can prevent it from bringing its gun to bear on you. \n\n[[AB 41]] and [[L6/40]] - Italian counterparts to the German Pz.II series, these vehicles both feature [[Breda Mod.35 (20 mm)|20 mm Breda Mod.35]] autocannons which present the same concerns and counters as the Pz.IIs. The difference is that the L6/40 is slightly slower than the Pz.IIs, while the AB 41 is significantly faster. Generally, if your round penetrates either vehicle, it will most likely do significant damage. \n\n[[M2A2]] - This unassuming and unusual American vehicle relies on a [[M2HB (12.7 mm)|.50 cal M2HB]] (12.7 mm) heavy machine gun, located in its left-hand turret. The M2A2 shouldn't be dismissed as a threat however, as despite its odd layout, relatively small armament, and light armour, it is one of the fastest light tanks at Rank I. Given the T-26's relatively slow speed, the M2A2 will outflank you easily. Its .50 cal machine gun isn't always able to do a lot of damage to heavily armoured vehicles, but the T-26's is among the vehicles that the M2HB can consistently penetrate. When facing an M2A2, it is recommended to shoot first and stop it from closing the distance. If you are on its right side, it will have to turn towards you to bring its .50 cal to bear. Its [[M1919A4 (7.62 mm)|7.62 mm M1919A4]] medium machine gun, located in its right turret, will not do any significant damage to the T-26.\n\n[[M8 Scott]] and [[LVT(A)(4)]] - This American howitzer carrier takes the speedy hull of the M5 Stuart and mates it with a turret containing a 75 mm howitzer and a .50 cal M2HB. Being very fast, this tank can flank the T-26 very easily. It does not often need to do this however, since its HEAT round can annihilate the T-26 in one shot. It doesn't even need to do that however, since it could opt to just spraying your vehicle down with the .50 cal. By comparative principle, it is an M2A2 with a 75 mm. The [[LVT(A)(4)]] presents similar concerns, as it is marries the M8 Scott's turret to the hull of an LVT. Because of this, the LVT(A)(4) is able to swim. It is recommended to be watching the waterways, as most players do not expect an attack to come from areas that normal tanks cannot traverse.\n\n[[Ka-Chi]] - This Japanese medium tank is often underestimated for its nation of origin, but it is not to be ignored. Its massive size may prevent your  shells from doing significant damage in one shot, and some may occasionally be completely absorbed by the front pontoon or deflected if angled. Its height can allow it to see over your cover and spot you. It won't be able to lower its gun too far however, especially with floats attached, and if the T-26 is able to sneak around the Ka-Chi, you can potentially rush into the deadzone right alongside the vehicle and shoot into its flank, without chance of retaliation. It is recommended to be watching the waterways, as most players do not expect an attack to come from areas that normal tanks cannot traverse.\n\n[[B1 bis]] and [[B1 ter]] - Nearly any Rank I vehicle unfortunate enough to come face-to-face with a B1 is in for a rough time. If the recommended tactic for the T-26 is being a support vehicle, it should be especially employed when a B1 is encountered. The B1 bis has thick armour (60 mm  of frontal armour) that can absorb or deflect your 45 mm shells. The B1 ter presents the same issue for you, but even worse. (70 mm of frontal armour) There is little a T-26 can do when facing one of these heavy tanks head on, except for shooting the infamous \"mail-slot\" weak spot located on the turret ring, or damaging the tracks in hopes of immobilizing it. Calling in for friendly ground and air assistance is highly advised when encountering such beasts.\n\n[[He 112 A-0]] - This German plane is essentially a flying Panzer II. With a powerful rapid-firing [[MG C/30L (20 mm)|20 mm MG C/30L]] autocannon, it can use API-T rounds have enough penetration to go through the T-26 at nearly every angle. Experienced pilots can wreak havoc on your team until their ammo is expended. It is recommended to find solid roof cover when enemy aircraft are overhead. \n\n[[:Category:Anti-aircraft vehicles|SPAA]] - Nearly every anti-aircraft vehicle at the tier, save for the Soviet [[GAZ-AAA (4M)]] and the British [[Light AA Mk I]], will be able to penetrate and destroy the T-26 with ease. Not to mention that SPAAs guns have high fire rates. As with any other vehicles, it is advised to shoot first. Certain SPAAs which are commonly underestimated like the Soviet [[GAZ-AAA (DShK)]], French [[P.7.T AA]], American [[M15 CGMC]], and French [[CCKW 353 AA]] should be especially noted, as despite not having 20 mm autocannons like their Axis counterparts, they all have weapons capable of efficiently knocking out a T-26.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Great firepower; the stock APHE shell can frontally penetrate and knock out many tanks with a single shot\n* Very fast reload\n* Fairly accurate gun at short to medium ranges\n* Massive ammo capacity and fast reload time which is good for new players learning how to manoeuvre and fire\n* Effective coaxial machine gun for use against open-topped enemy vehicles and trucks\n\n'''Cons:'''\n\n* Low survivability due to the thin, nearly unangled armour\n* Three crew members packed tightly together significantly reduces survivability\n* Poor overall mobility; low top speed, very low reverse speed, slow hull traverse, and difficulty in climbing steep slopes\n* Average -5° gun depression limits its potential in hilly terrains\n* Some ammo is stored inside turret which tends to explode when hit\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n{{main|T-26#History|l1=History of the T-26}}\n[[File:T-26s, Shanghai (1949).jpg|thumb|T-26s in Shanghai, 1949]]\n\n=== In Chinese Service ===\nIn 1937-39, a period of high tensions between the USSR and Japan, the Soviets provided 88 T-26 M33 tanks to China. The T-26, which along with the BT tanks, would constitute three-quarters of the Soviet tank force at the start of its war with Germany in 1941, had been developed from and was very similar to the Vickers 6-ton tank, a model which China had previously bought from Britain. With 20 of those tanks, mostly the Vickers Mark E armed with a short 47 mm gun, fighting with the 1st and 2nd Tank Battalions around Shanghai in 1937, is where most had been lost to the Japanese. The T-26s that came after appear to have been radio-equipped. They were assigned to the 1st Tank Regiment, which had elements attached to the new 200th (Motorised) Division, the first such division in the Chinese army. The 200<sup>th</sup> division, with at least nine T-26s, was deployed to Burma in the spring of 1942. Most of its tanks were believed lost in that campaign, although they acquitted themselves well. Other T-26 elements saw action in China proper throughout the war.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=cn_t_26_1940 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Related development\n* [[T-26 (Family)]]\n\n== External links ==\n''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''\n\n{{TankManufacturer OKMO}}\n{{China light tanks}}"}}