{"title":"T-34 (1943) (China)","pageid":7390,"wikitext":{"*":"{{About\n| about = Chinese medium tank '''{{PAGENAME}}'''\n| usage = other variants\n| link = T-34 (Family)\n}}\n{{Specs-Card\n|code=cn_t_34_1942\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} Chinese medium tank {{Battle-rating}}. It was introduced in [[Update 1.91 \"Night Vision\"]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n'''Armour type:'''\n\n* Rolled homogeneous armour (Hull, Turret roof)\n* Cast homogeneous armour (Turret, Driver's hatch, Machine gun mount)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front !! Sides !! Rear !! Roof\n|-\n| Hull || 45 mm (61°) ''Front glacis'' <br> 99 mm (5-35°) ''Welded glacis joint'' <br> 45 mm (52°) ''Lower glacis'' <br> 60 mm (1-73°) ''Machine gun ball mount'' <br> 75 mm (60°) ''Driver's hatch'' || 40 mm (40°) ''Top'' <br> 45 mm (0°) ''Lower'' || 40 mm (47-49°) ''Top'' <br> 40 mm (47°) ''Bottom'' || 16 mm\n|-\n| Turret || 53 mm (3-58°) ''Turret front'' <br> 45 mm (2-78°) ''Gun mantlet'' || 53 mm (21-22°) || 53 mm (18-20°) || 15 mm\n|-\n|}\n'''Notes:'''\n\n* Suspensions wheels and tracks are 20 mm thick.\n\n==== Hull armour ====\nThe 1943 model has a very similar hull armour profile to the [[T-34 (1941)|1941]] model, relying on angling instead of sheer thickness for protection. There are two key differences: the machine gun ball mount has an increased thickness of 60 mm of armour (compared to 45 mm on earlier models), as does the driver's hatch (75 mm, compared to 45 mm on earlier models). The weak spots created by the driver's optics on earlier models have also been removed. The driver's hatch has the thickest armour on any part of the T-34 and can be quite resilient to enemy fire if hit.\n\nIt should be noted that due to the relatively thin plate thickness used (40–45 mm), the T-34's hull is vulnerable can be vulnerable to overmatching from 75 mm and larger guns.\n\n==== Turret armour ====\nThe new hexagonal turret features thicker armour than on the 1941 model. However, there are a few caveats:\n\n* The angling is noticeably worse, and there are some relatively flat spots on the front that can be vulnerable to penetrations from even relatively weak guns at close ranges.\n* The turret front, side, and rear armour is made of cast armour instead of rolled plate, which is slightly weaker.\n\nOverall, the turret armour is not a significant improvement over the earlier models and is in some ways weaker.\n\n==== Module/crew layout ====\nThe bulk of the T-34's main gun ammunition is carried low in the hull, making it relatively hard to detonate the ammunition of a T-34, especially if it is carrying a reduced ammunition load. However, the T-34's hull sides are spanned by relatively large fuel tanks; thus, side penetrations can cause the diesel fuel to catch fire.\n\nThe crew are seated in a quite compact manner inside the tank, and successful penetrations are likely to disable multiple crew members at once.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=775|rbMinHp=442|AoAweight=0.25}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|F-34 (76 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[F-34 (76 mm)|76 mm F-34]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 100 || rowspan=\"2\" | -5°/+30° || rowspan=\"2\" | ±180° || rowspan=\"2\" | N/A || 23.80 || 32.94 || 40.00 || 44.24 || 47.06 || rowspan=\"2\" | 8.45 || rowspan=\"2\" | 7.48 || rowspan=\"2\" | 6.89 || rowspan=\"2\" | 6.50\n|-\n! ''Realistic''\n| 14.88 || 17.50 || 21.25 || 23.50 || 25.00\n|-\n|}\n\n==== Ammunition ====\n\n* '''BR-350A (MD-5 fuze)''': APHEBC; high explosive mass will knock out any tank it penetrates with a single shot, however penetration is mediocre\n* '''BR-350B (MD-8 fuze)''': APHEBC; increased penetration at the cost of slightly less explosive mass\n* '''BR-350SP''': APBC; a solid shot that is somewhat more lethal than APCR, but with less penetration\n* '''BR-354P''': APCR; best penetrating shell, at the cost of no post-penetration damage\n* '''BP-353A''': HEAT; best penetration beyond 1,000 m, but the T-34s generally do not fare well in long-range duels\n* '''OF-350M''': HE; useful for breaking the hulls of lightly armoured/unarmoured vehicles\n* '''Sh-354T''': Shrapnel; useful against vehicles that are resistant to the HE shell but too thinly armoured to trigger the fuzes of APHE shells\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| BR-350A (MD-5 fuze) || APHEBC || 87 || 85 || 76 || 67 || 59 || 52\n|-\n| BR-350B (MD-8 fuze) || APHEBC || 94 || 92 || 83 || 73 || 65 || 57\n|-\n| BR-350SP || APBC || 102 || 100 || 91 || 81 || 72 || 64\n|-\n| BR-354P || APCR || 125 || 119 || 92 || 68 || 50 || 36\n|-\n| BP-353A || HEAT || 80 || 80 || 80 || 80 || 80 || 80\n|-\n| OF-350M || HE || 10 || 10 || 10 || 10 || 10 || 10\n|-\n| Sh-354T || Shrapnel || 37 || 35 || 29 || 25 || 20 || 17\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| BR-350A (MD-5 fuze) || APHEBC || 662 || 6.3 || 1.2 || 14 || 150 || 48° || 63° || 71°\n|-\n| BR-350B (MD-8 fuze) || APHEBC || 655 || 6.3 || 0.9 || 14 || 98.56 || 48° || 63° || 71°\n|-\n| BR-350SP || APBC || 655 || 6.78 || N/A || N/A || N/A || 48° || 63° || 71°\n|-\n| BR-354P || APCR || 950 || 3.02 || N/A || N/A || N/A || 66° || 70° || 72°\n|-\n| BP-353A || HEAT || 355 || 5.3 || 0.05 || 0.1 || 959.42 || 62° || 69° || 73°\n|-\n| OF-350M || HE || 680 || 6.2 || 0.05 || 0.1 || 621 || 79° || 80° || 81°\n|-\n| Sh-354T || Shrapnel || 680 || 6.2 || 0.5 || 8 || 85 || 62° || 69° || 73°\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"7\" | Smoke shell characteristics\n|-\n! Ammunition\n! Velocity<br>(m/s)\n! Projectile<br>Mass (kg)\n! Screen radius<br>(m)\n! Screen deploy time<br>(s)\n! Screen hold time<br>(s)\n! Explosive Mass<br>(TNT equivalent) (g)\n|-\n| D-350A || 680 || 6.45 || 13 || 5 || 20 || 50\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks T-34 (1942).png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! 7th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''100''' || 97&nbsp;''(+3)'' || 77&nbsp;''(+23)'' || 73&nbsp;''(+27)'' || 69&nbsp;''(+31)'' || 49&nbsp;''(+51)'' || 25&nbsp;''(+75)'' || 1&nbsp;''(+99)'' || No\n|-\n|}\n'''Notes''':\n\n* As they are modeled by sets of 2, shells disappear from the rack only after you fire both shells in the set.\n* Taking 69&nbsp;''(+31)'' rounds will leave only the ammunition racks at the bottom of the hull, decreasing the risk of ammunition detonation if penetrated.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|DT (7.62 mm)}}\n\nThe T-34 (1943) is armed with a 7.62 mm DT machine gun, which is only useful for gunning down unarmoured AAA vehicles.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[DT (7.62 mm)|7.62 mm DT]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 1,890 (63) || 600 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nLike the previous T-34 models, the 1943 model excels at close to medium range fighting, utilizing its outstanding mobility for a medium tank to rapidly close the distance and relocate to attack from unexpected directions. The sloped hull armour has a good chance of ricocheting hastily aimed shots and helps increase the odds of the T-34 surviving when moving in to engage. The lethal BR-350B APHEBC round complements this playstyle, having about enough penetration to deal with the flanks of most enemies likely to be encountered; a single penetrating hit is usually fatal for the target. In close combat, the fast turret traverses and quick reload allow the T-34 to respond quickly towards changing situations, usually helping to ensure it will be the first to get its gun on the target.\n\nConversely, the T-34 fares poorly in long-range combat; both the BR-350B APHEBC and BR-354P APCR rounds have poor penetration at long ranges, and the BP-353A HEAT round is quite underwhelming as well.\n\n=== Against the T-34 (1943) ===\n'''Light tank/SPAA''': lower tier light tanks/SPAA (e.g. [[M5A1]]) will find the waves of T-34 hard to counter. If your penetration is above ~65 mm, target the turret ring as it is only 53 mm. Avoid shooting at the sloped hull armour at all sides as it is very likely to bounce small calibre shells. If the T-34 does not know your presence and is exposing its side to you, target the vertical hull side between the mudguard and the roadwheels, it is only 45 mm and a shot there can disable both turret crew and drivers. These are the only weak spots if your penetration is low, even the rear of a T-34 is heavily sloped.\n\n'''Medium tank''': perhaps the most common medium tanks used around this BR is the [[M4]] series with short 75 mm cannons. When the T-34 is not angling, you can punch straight through the upper front plate and knock it out with a single shot, but do avoid the MG port and driver's hatch as they very much like to absorb shells. The turret ring is also a weak spot. The turret/gun mantlet, however, will be quite tricky to penetrate especially if the T-34 is at a distance or hull down. On the spherical gun mantlet there are small sections where the curve becomes almost vertical, making them a weak spot, but your shell is likely to impact the huge bulge joining the mantlet and the gun barrel before hitting where you aim at. That is the housing for the hydraulic recoil cylinders, if you target that specifically you can disable its gun breech. There are also small corners of the turret around the gun mantlet, but they are spread out and tiny, therefore harder to hit. For an angling T-34, if their angle is a bit too much and too much side profile is exposed, fire at the lower, vertical side between the roadwheels and the upper mudguard.\n\n'''Heavy tank/tank destroyer''': it is fairly easy to destroy a T-34 in a well-protected tank or a tank hunter. Heavy tanks such as [[Pz.Kpfw. Churchill (Germany)|▀Pz.Kpfw. Churchill]] and [[KV-IB (Germany)|▀KV-IB]] will not have a hard time as they are tough enough to easily take some hits from the short 76 mm F-34 of the T-34. Still, target the hull where the T-34 is not angling, or the turret ring. Tank destroyers like the [[M10 (Family)|M10]] will find it even easier to pierce through the armour of a T-34, but play carefully since tank destroyers are not well armoured.\n\n=== Common opponents ===\n\n* [[M4]], [[M4A2]], [[M4A4 (France)]] - The T-34's 76 mm gun cannot penetrate the welded hull M4s reliably from the front, while the 75 mm gun on the M4s can penetrate the T-34's turret and disable or cripple it. They do have very weak lower side hull armour (only 38 mm) that can be overmatched by the 76 mm APHEBC round if exposed, and the flat areas on the turret can also be penetrated fairly reliably if they can be hit. Generally avoid head-on engagements, especially if they are hull-down.\n\n* [[M4A1]], [[Sherman II]]: Similar to the M4/M4A2, except that the cast hull is weaker than the welded hull, and can be penetrated frontally. Otherwise, the same advice applies.\n\n* [[Pz.IV F2]], [[Pz.IV G|G]], [[Pz.IV H|H]], [[Pz.IV J|J]] - The Ausf. F2 variant is the first Panzer IV to mount a long-barreled 75 mm gun. This gun is one of the most dangerous of any tank at the T-34's BR range, and it is easily capable of penetrating the T-34 at most ranges. However, the Ausf. F2 has very weak armour, and is something of a glass cannon. The Ausf. G, H, and J have up-armoured hulls that are quite difficult to penetrate, but their turrets are as weak as the one on the F2. The Ausf. J, in particular, has manual turret traverse and is very vulnerable to being flanked. Avoid long-range duels with them.\n\n* [[Chi-Nu II]] - The Chi-Nu's gun will cut through your entire tank from the front. However, the Chi-Nu has no armour and aiming center mass will most likely knock it out with a single shot.\n\n* [[Churchill III]], [[Pz.Kpfw. Churchill (Germany)|▀Churchill]] - The 6-pounder gun on the Churchill will be hard-pressed to penetrate the sloped T-34 hull, but it can easily penetrate the turret and disable the turret crew. It is difficult to penetrate the frontal armour of the Churchill at long ranges. However, it is a slow, cumbersome heavy tank, and is easy to outflank and dispatch with shots to the side armour.\n\n* [[Churchill VII]] - The Churchill VII is virtually immune to the T-34 from the front, while its 75 mm gun can penetrate the T-34's turret fairly easily. Even from the side, it has 95 mm of armour that cannot be penetrated by the BR-350B APHEBC round except at very close range, and even slight angling will render it all but immune. It is even slower than the Churchill III, however, and thus easy to avoid and outflank.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Excellent post-penetration effect with the BR-350B, easily knocking out most tanks in a single shot\n* The BR-354P APCR can effectively penetrate heavily armoured targets (e.g. [[Churchill III]]) at close range at the cost of post-penetration damage\n* Very fast turret traverse, good for urban combat\n* Sloped hull armour provides good protection against small calibre / low-penetration shells (e.g. 75 mm M3, 50 mm KwK39), and even large calibre guns when angled correctly\n* Nearly impossible to damage the transmission and immobilize it from the front\n* 49 km/h top speed allows it to change position quickly and outrun lots of other medium tanks\n\n'''Cons:'''\n\n* -5 degrees gun depression is below average, making it ineffective to combat in hills comparing to the [[M4]] with -10 degrees depression\n* BR-350A & BR-350B both lack the penetration against more heavily armoured foes like the Churchills\n* Relatively slow reload time compared to similar tanks\n* The 4 crew members are very close together making it easily knocked out by with a single shot by common guns like the German 76 mm, US 75 mm, etc. when penetrated from the front / side hull, or even the turret\n* Large fuel tanks scattered at the sides of the hull, tend to catch fire if being hit\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n{{main|T-34 (1942)#History|l1=History of the Soviet T-34 (1942)}}\nIn Soviet official documents, little difference was made between the T-34 Model 1942 (German designation T-34/76C) and the T-34 Model 1943 (German designations T-34/76D, E and F); most of the differences between the models were because they were produced at different facilities.\n\nDespite its position in the Chinese tech tree, it has to be noted that the T-34 (1943) is not, in fact, a Chinese vehicle. All currently available sources indicate that the PLA never operated the F-34 armed version of the T-34, and the best available documents, compiled by Dr. Martin Andrew, indicate that 1837 T-34s were delivered by the Soviets to the PLA between 1950 and 1954, all of which were the T-34-85 variant.\n\nIt is thought that the PLA indeed obtained a small number of F-34 armed T-34 tanks for training purposes, likely left by the Soviets when they withdrew from China in 1955. Some are still kept as exhibits in the Harbin Tank Academy.\n\nHowever, the T-34 (1943) did see service in North Korea, with deliveries starting in 1949. Following the proclamation of the Democratic People's Republic of Korea on September 9th 1948, North Korea's first armoured unit, the 105th Armored Battalion was established in October of 1948, increasing to regimental strength in May of 1949 before being rebaptised as the 105th Armored Brigade prior to the outbreak of the Korean War in 1950. Due to the lack of official North Korean sources on the subject, it is unclear how many T-34 (1943) saw service with the DPRK; evidence does exist that a number of them were committed to the original June 1950 assault on South Korea, with a number of knocked-out short-barrelled T-34s being photographed on the battlefield.\n\nThe nature of combat in Korea meant that tank losses were high for the DPRK, and out of 120 tanks reported on strength in June of 1950, nearly all had been lost by December that year. Replacements were delivered by the Soviet Union, all of these later deliveries covering the T-34-85 variant.\n\nFollowing the end of the Korean War, a reconstruction program was started to bring the DPRK's army back to strength, with additional deliveries of T-34s arriving from the Soviet Union. Again the lack of reliable North Korean sources makes it impossible to work out what was delivered, but sources indicate that despite the delivery of T-34-85s, which remained the mainstay of the North Korean Army until it first received T-54/55s and Type 59 tanks in 1967, a number of older T-34-76s remained in service, either being rebuilds of recovered vehicles or, more likely, new deliveries from their Soviet allies. Most tellingly, a widely circulated still from a late 1960s North Korean propaganda film shows military manoeuvres involving at least two T-34-76s, both showing signs of modernisation such as T-34-85-type saddle fuel tanks and starfish roadwheels (first introduced 1969). As such, it can be surmised that at least some T-34 (1943)s remained in North Korean service into the 1970s in some sort of reserve or training capacity.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=cn_t_34_1942 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.''\n\n{{TankManufacturer Morozov}}\n{{China medium tanks}}"}}