{"title":"T-34-57 (1943)","pageid":970,"wikitext":{"*":", {{About\n| about = Soviet medium tank '''{{PAGENAME}}'''\n| usage = other versions\n| link = T-34 (Family)\n}}\n{{Specs-Card\n|code=ussr_t_34_57_1943\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium rank {{Specs|rank}} Soviet medium tank {{Battle-rating}}. It was introduced during the Closed Beta Test for Ground Forces before [[Update 1.41]]. It features a 57 mm ZiS-4M cannon, on the body of the [[T-34 (1942)|T-34 1942 variant]].\n\nThe 57 mm ZiS-4M gun can prove to be formidable at its battle rating, providing a noticeable improvement in penetration power, ballistics and rate of fire over the 76 mm calibre T-34s, with a sacrifice in post-penetration damage and a higher chance of ricochet on angled surfaces compared to guns of higher calibre. You will no longer have to worry about not penetrating enemies.\n\nOperational and visual characteristics of the T-34-57 are as similar and as common to previous 76 mm-armed T-34 lineage of tanks as they come, with the exception of a gun of smaller calibre and higher penetration power. Players experienced in operating previous models of the T-34 in rank II should have little difficulty in adjusting to this vehicle. Due to the similarities, however, the tank inevitably inherits both its predecessors' strengths and weaknesses. It is to be noted that armour is ineffective against the occasional rank III guns; usage of speed and agility to move quickly, to avoid enemy fire and moving cover-to-cover will prove advantageous.\n\nThe T-34-57 works very well with other allied tanks (British and American) that it is often paired with in RB and SB. It retains high mobility and an effective main gun, allowing it to quickly reach capture points or tactical firing positions, usually following [[M18 GMC|M18s]] and other T-34 tanks, which are often first at the scene.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\nThere are quite a few differences between the T-34-57 (1943) and the regular tech tree T-34-57. The T-34-57 (1943) has the body of the regular tech tree [[T-34 (1942)|T-34 (1942)]] from a lower battle rating. The T-34-57 (1943) gets 20 mm more armour on the drivers hatch, an extra 30 mm on the hull machine gun port with an angle increase. The T-34-57 (1943)  also gets an extra 8 mm more armour and slightly less of an angle on the front (9° less angled), sides (up to 13° less angled) and rear (11°-12° less angled) of the turret when compared to the regular T-34-57. The gun mantlet also gets a small buff with up to 20° more angle in some places.\n\n'''Armour type:'''\n\n* Rolled homogeneous armour (Hull, Gun mantlet, Roof)\n* Cast homogeneous armour (Turret, Machine gun port, Driver's hatch)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front !! Sides !! Rear !! Roof\n|-\n| Hull || 45 mm (61°) ''Front glacis'' <br> 99 mm (5-35°) ''Welded joint'' <br> 45 mm (52°) ''Lower glacis'' <br> 65 mm (1-73°) ''Machine gun port'' <br> 75 mm (60°) ''Driver port'' || 40 mm (40°) ''Top'' <br> 45 mm (0°) ''Lower'' || 40 mm (47-49°) ''Top'' <br> 40 mm (47°) ''Bottom'' || 16 mm\n|-\n| Turret || 53 mm (3-58°) ''Turret front'' <br> 45 mm (2-78°) ''Gun mantlet'' || 53 mm (21-22°) || 53 mm (18-20°) || 15 mm\n|-\n|}\n'''Notes:'''\n\n* Suspension wheels and tracks are 20 mm thick.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=775|rbMinHp=442}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|ZIS-4M (57 mm)}}\n\nThe T-34-57 (1943) and the regular tech tree T-34-57 both have similar 57 mm cannons. The tech tree T-34-57 has the regular 57 mm ZIS-4 cannon whereas the T-34-57 (1943) uses the modified ZIS-4M cannon which allows it to fire an APCR round with up to 32 mm better penetration at less than 500 m away than the other APHE and APHEBC rounds that also come with the ZIS-4.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[ZIS-4M (57 mm)|57 mm ZIS-4M]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 100 || rowspan=\"2\" | -5°/+28° || rowspan=\"2\" | ±180° || rowspan=\"2\" | N/A || 23.8 || 32.9 || 40.0 || 44.2 || 47.1 || rowspan=\"2\" | 6.50 || rowspan=\"2\" | 5.75 || rowspan=\"2\" | 5.30 || rowspan=\"2\" | 5.00\n|-\n! ''Realistic''\n| 14.9 || 17.5 || 21.3 || 23.5 || 25.0\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | '''Penetration @ 0° Angle of Attack (mm)'''\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| BR-271 || APHEBC || 145 || 143 || 132 || 119 || 108 || 98\n|-\n| BR-271K || APHE || 145 || 143 || 132 || 119 || 108 || 98\n|-\n| O-271 || HE || 5 || 5 || 5 || 5 || 5 || 5\n|-\n| BR-271P || APCR || 177 || 168 || 133 || 99 || 74 || 55\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| BR-271 || APHEBC || 990 || 3.14 || 1.2 || 9 || 21.56 || 48° || 63° || 71°\n|-\n| BR-271K || APHE || 990 || 3.14 || 1.2 || 9 || 27.72 || 47° || 60° || 65°\n|-\n| O-271 || HE || 700 || 3.72 || 0 || 0.1 || 220 || 79° || 80° || 81°\n|-\n| BR-271P || APCR || 1,270 || 1.79 || N/A || N/A || N/A || 66° || 70° || 72°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''100''' || 95&nbsp;''(+5)'' || 89&nbsp;''(+11)'' || 83&nbsp;''(+17)'' || 77&nbsp;''(+23)'' || 1&nbsp;''(+99)'' || Yes\n|-\n|}\n\n''Turret empty:'' 77&nbsp;''(+23)''\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|DT (7.62 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[DT (7.62 mm)|7.62 mm DT]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 1,890 (63) || 600 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\nThis tank is a brawler, suitable to fight in close range combat, especially the urban map. But thanks to the high velocity of 57 mm gun (990 m/s), it is possible to snipe enemy tank easily on long-range maps.\n\n* As a brawler: shoot-and-scoot is its main tactic. Camp in the city, watch for the enemy tank, shoot it then reverse to hiding place. Remember to watch both sides before crossing the street (watch out for snipers in maps like Poland and Eastern Europe), ANGLE THE ARMOUR. If the armour is angled correctly without showing the sides, it could cause a lot of trouble for enemies trying to penetrate the armour.\n* As a sniper: use binocular and range finder (check the Option => tank control => binocular, range finder). If the enemy shows their side or rear, shoot it. Compensate the shell drop for better accuracy.\n\nThe T-34-57 (1943) really shines In open maps, use your good mobility to flank and catch unsuspecting enemies. Moving from cover to cover is essential, as your armour, although well sloped, will not be able to withstand most shells at this battle rating. Don't let the enemy catch you unangled, or you will be killed immediately. In urban maps, look around the streets (press and hold the button \"c\" to look around) before crossing. Your quick reload speed and high penetrating gun will allow you to react to surprise attacks around the corner. Although the 57 mm gun has little post-penetration damage, it makes up for this in high penetration and a quick reload speed. The 57 mm cannon has very good ballistics and penetration, and is good for medium to long range sniping.\n\nPretty much any tank can be penetrated by the 57 mm gun at this tier, but there are a few enemies worth noting.\n\n[[M4A3E2]] Jumbo - This tank is a bane at this BR. Its turret and front plate are almost impossible to penetrate without APCR, and its gun can easily penetrate your armour (especially your turret ring). Avoid engaging a Jumbo from the front and flank it if possible. The side armour is much weaker (in particular the bottom part). If you find yourself backed into a corner, you can try and aim for the machine gun port in the hull. The explosive power of the 57 mm isn't great, but penetrating this point means that you can at least cripple the Jumbo and make your escape.\n\n[[Pz.IV (Family)|Panzer IV]] variants with 75 mm KwK 40 L/43 or L/48  guns - These tanks are common at this tier and they can easily take you out with their powerful 75 mm guns. However, they are easy to take out if you get the jump on them. Your high penetration 57 mm gun can slice through their armour at any range.\n\n[[8,8 cm Flak 37 Sfl.]] - The flak truck can destroy you at seriously long range, whilst its thin armour and large size makes it very hard to effectively damage. Your rounds may simply pass straight through and not cause any damage. The best way to take one out is by aiming for the large ammo box at the back of the vehicle, which will explode when hit. The crew members are also very exposed on the Flak.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* [[T-34 (1942)|1942]] hull and turret, taking away driver's hatch weak spot in first [[T-34-57]]\n* Relatively high penetration for the calibre and rank\n* High gun muzzle velocity (990 m/s), suitable for sniping\n* Unlike its non-premium counterpart, it has APCR ammo with 185 mm of penetration\n* Good mobility and speed, just like all of the previous T-34 series\n\n'''Cons:'''\n\n* Has the same hull armour as previous revisions\n* Small gun calibre may have trouble knocking out enemies with a single shot\n* Turret armour isn't sufficient at Rank III, due to other countries' tank high penetration\n* Poor gun depression of only -5 degrees makes it ineffective in hilly and mountainous terrain\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n===Development===\nAs far back as the summer of 1940, an attempt to improve the anti-tank gun inventory in Soviet service was undertaken. This was due to only having massive stocks of underpowered 45 mm anti-tank cannons available, which were becoming obsolete with the newer armour being used by the Soviet Union's adversaries. When the request for an improved anti-tank cannon was sent out, a design bureau headed by V. G. Grabin was already underway under the name ''57 mm ZiS-2 anti-tank gun''. The 57 mm was a very powerful anti-tank weapon due to its high penetration value with the high-velocity shells. The APCBC round available under the name BR-271 was able to penetrate 93 mm of armour when fired 100 m away at a meet angle of 60 degrees. The first of the prototypes were created in the September of 1940, and it as later approved for production on June 1, 1941. However, this was stopped on December 1 due to beliefs that the high-velocity 57 mm shells would simply penetrate straight through tanks without causing damage or that it was a high-cost weapon. The production lines were then switched to produce the 76.2 mm ZiS-3 guns.\n\nIt was during its production life before being cancelled that the 57 mm gun was attached to a T-34 as a main armament in April 1941. However, the trials on this armament showed a lack of accuracy and short barrel life. Then in July, an improved variant of the 57 mm called the ''ZiS-4'' was installed onto the T-34 and tested again. This variant turned out to be successful and the gun was recommended for installation on certain T-34 units, despite the high cost of the ZiS-4. The T-34 with the 57 mm was redesignated the [[T-34-57]] and had the purpose of being \"tank-hunters\" due to the higher penetration value of the 57 mm compared to the default T-34 76.2 mm armament. The 57 mm ZiS-4 gun was produced at the Artillery Factory #92 and were mounted on various T-34s. However, the stop of all 57 mm production on December 1941 also stopped the 57 mm ZiS-4 production, thus halting the T-34-57 production with only 133 ZiS-4 guns made in the production life.\n\n===Revitalization===\nThe 57 mm guns were revived in 1943 due to urgent needs for much better guns against the newer German tanks. The current 76.2 mm F-34 gun on the normal [[T-34 (1942)|T-34s]] were unable to defeat the newer German [[Tiger H1|Tiger I]] and [[Panther D|Panther]] tanks. In a desperate attempt to upgrade the T-34 to compete against these tanks, the 57 mm was reinstated for production and began being issued in May 1943, these models being the '''T-34-57 mod. 1943''' due to the upgraded armament. The ZiS-4 was upgraded to the ZiS-4M with simplified parts and standardization in parts from current existing artillery pieces such as the F-34 and the ZiS-2. These T-34-57s saw further action against the Axis until they were retired. In total, about less than 324 T-34-57s were made during its production life in 1941 and 1943.\n\n===Combat usage===\nThe T-34-57 made in 1941 saw action during the Battle of Moscow in small quantities. The 21st Tank Brigade has 10 of such tanks in their units and were deployed on October 14. Though the brigade was able to cause massive damage to the German lines around Kalinin but ended with all of the T-34-57 destroyed by November 25. Other units using the T-34-57 were the 8th Tank Brigade on October 19. Afterwards came the deactivation of the 57 mm from the production line at the end of 1941, but the T-34-57s were revitalized again in 1943 to counter the newer German tanks. These tanks were used as \"tank-hunters\" and formed \"Special Tank Company 100\" with three T-34-57 in its first platoon to deal with German tanks. Despite their role, the company would only meet German tanks once in its life, and the first platoon was never used. Thus, the T-34-57 was never really able to prove their efficiency against active German tanks, though the unit would praise the gun's performance in practices against pillboxes, bunkers, and knocked out German tanks. All the T-34-57s were disbanded with the retirement of the 57 mm as a tank gun. This was due to its small HE shell available that made it an inadequate tank armament against softer targets, and also the introduction of the much bigger and better 85 mm tank gun on the newer [[T-34-85 (D-5T)|T-34-85]].\n\n=== In-game description ===\nIn 1943, the new PzKpfw VI Tiger German heavy tank began to see more and more use on the Eastern front. This caused the ZiS-4 cannon with its powerful penetration properties to come under consideration again. It was extremely difficult to destroy a Tiger using a standard 76 mm F-34 tank gun, and the heavy tank's frontal armour was completely impenetrable to it. So before long, the order was given to restart mass production of the T-34-57 tank destroyers.\n\nIn May 1943, the tank was put into service again. This time, the modified ZiS-4M cannon was used, which differed from the ZiS-4 in its unified breech mechanism, simpler semi-automatic mode and modified attachment of the coupling in the weapon's cradle. A more powerful shell was also developed which could penetrate 96 mm thick armour at a range of 1,000 m. However, this shell severely affected the weapon's durability, and several cases were recorded of gun barrels swelling. Soon after a small number of them were produced, they were taken out of service and withdrawn from operational use. The low quality of the 57 mm ZiS-4M tank cannon's fragmentation shells proved to be a serious drawback.\n\nThe modernised T-34-57 tanks were not put into mass production, and after a few vehicles were produced, the decision was taken to stop manufacturing them.\n\nThree T-34-57s built using mass-produced T-34 Mod. 1942 tanks made by the Chelyabinsk factory were sent to the front to serve in the 100th Special Tank Division. The tanks were tested on the front from the 15th of August to the 5th of September, but did not excel in battle, so they were kept in reserve.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=ussr_t_34_57_1943 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n''Paste links to sources and external resources, such as:''\n\n* ''topic on the official game forum;''\n* ''other literature.''\n\n{{TankManufacturer Morozov}}\n{{USSR medium tanks}}\n{{USSR premium ground vehicles}}"}}