{"title":"T29","pageid":785,"wikitext":{"*":"{{Specs-Card\n|code=us_t29\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n|store=5266\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a premium gift rank {{Specs|rank}} American heavy tank {{Battle-rating}}. The {{PAGENAME}} was introduced in the [[Update 1.59 \"Flaming Arrows\"]] as a gift vehicle and was available on the Gaijin store as a [[wt:en/news/3742-shop-pre-order-packs-for-update-1-59-flaming-arrows-with-exclusive-decals-en|pre-order pack]] before the update. The {{PAGENAME}} is a formidable heavy tank that introduces the 105 mm T5 cannon in a rotating turret rather than in the fixed case-mate setting like the [[T95]], with a tougher-than-average gun mantlet, and a sloped, but slightly thin hull.\n\nThe {{PAGENAME}} is perhaps one of the best performing heavy tanks at Rank IV, right up there with the [[IS-2 (Family)|IS-2]] and [[Tiger II (Family)|Tiger II]] tanks. Thanks to the 105 mm cannon, the {{PAGENAME}} can engage most enemies it faces on the battlefield from the front, often destroying an enemy tank with a single shot with the extremely powerful T13 APCBC round. With a frontal armour thick enough to block most incoming shots, The {{PAGENAME}} can act as the \"damage sponge\" of the team by absorbing or shrugging off most of the enemy fire. As its gun has a high muzzle velocity, it can also act as a sniping tank by positioning in the back or sides of the map and fire at any unsuspecting enemy tank. A single T13 APCBC round can destroy even the strongest tank if it penetrates the side armour. Like other heavy tanks, the {{PAGENAME}} has an average mobility but has a lower top speed than its main rivals: the IS-2 mod. 1944 and the Tiger II (H) and only better than the Caernarvon. Nonetheless, it possesses an above-average acceleration, making it more suited for dense environments.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n\n'''Armour type:'''\n\n* Cast homogeneous armour\n* Rolled homogeneous armour (Hull sides, Hull rear)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 102 mm (52-56°) ''Front Glacis'' <br> 70.25 mm (26-59°) ''Bottom Glacis'' <br> 102 mm (6-81°) ''Machine gun port'' || 76.2 mm ''Front'' <br> 51 mm ''Rear'' || 51 mm (9°) ''Upper'' <br> 19 mm (11-66°) ''Lower'' || 38.1 mm\n|-\n| Turret || 158.7 mm (18-31°) ''Turret front'' <br> 203 mm (0-9°) ''Gun mantlet'' <br> 305 mm (1-57°) ''Gun mantlet border'' || 158.7 mm (3-42°) || 102 mm (1-20°) ''Rear'' <br> 50 mm (63-84°) ''Bottom of turret overhang'' || 38.1 mm\n|-\n| Cupola || colspan=\"3\" style=\"text-align:center\" | 152.4 mm || 38.1 mm\n|-\n|}\n'''Notes:'''\n\n* Suspension wheels are 20 mm thick while tracks are 30 mm thick.\n* Front belly armour is 25.4 mm thick while the rear is 13 mm.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp=994|rbMinHp=681}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|T5E2 (105 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[T5E2 (105 mm)|105 mm T5E2]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 63 || rowspan=\"2\" | -10°/+15° || rowspan=\"2\" | ±180° || rowspan=\"2\" | N/A || 14.6 || 20.2 || 24.5 || 27.1 || 28.8 || rowspan=\"2\" | 16.25 || rowspan=\"2\" | 14.38 || rowspan=\"2\" | 13.25 || rowspan=\"2\" | 12.50\n|-\n! ''Realistic''\n| 10.7 || 12.6 || 15.3 || 16.9 || 18.0\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| T32 || APCBC || 256 || 253 || 238 || 221 || 205 || 190\n|-\n| T13 || APCBC || 253 || 250 || 236 || 219 || 204 || 190\n|-\n| T29E3 || APCR || 292 || 287 || 266 || 242 || 220 || 200\n|-\n| T30E1 || HE || 20 || 20 || 20 || 20 || 20 || 20\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| T32 || APCBC || 914 || 17.7 || N/A || N/A || N/A || 48° || 63° || 71°\n|-\n| T13 || APCBC || 899 || 18.59 || 1.2 || 19 || 177.38 || 48° || 63° || 71°\n|-\n| T29E3 || APCR || 1,128 || 11.2 || N/A || N/A || N/A || 66° || 70° || 72°\n|-\n| T30E1 || HE || 945 || 15.2 || 0 || 0.1 || 1,550 || 79° || 80° || 81°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated: 1.101.0.75''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! Ammo<br>type\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''63''' || ''Projectiles''<br>''Propellants'' || 58&nbsp;''(+5)''<br>39&nbsp;''(+24)'' || 50&nbsp;''(+13)''<br>9&nbsp;''(+54)'' || 42&nbsp;''(+21)''<br>7&nbsp;''(+56)'' || 9&nbsp;''(+54)''<br>1&nbsp;''(+62)'' || 1&nbsp;''(+62)''<br>N/A || No\n|-\n|}\nNotes:\n\n* The {{PAGENAME}} uses two-piece ammunition, composed of projectiles (yellow) and propellant bags (orange). Both have separate racks.\n* Projectiles and propellants are modeled individually and disappear after having been shot or loaded.\n* Racks 3*, 4* and 5* are first stage ammo racks. They total 8 projectiles and 8 propellant bags.\n* These racks get filled first when loading up the tank and are also emptied early.\n* The projectiles' depletion order at full capacity is: 5 - 1 - 2 - 3 - 4.\n* The propellants' depletion order at full capacity is: 3 - 4 - 1 - 2.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n{{Specs-Tank-Weapon|3}}\n{{Specs-Tank-Weapon|4}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|M2HB (12.7 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[M2HB (12.7 mm)|12.7 mm M2HB]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial mount #1 || 1,200 (200) || 577 || N/A || N/A\n|-\n| Coaxial mount #2 || 1,200 (200) || 577 || N/A || N/A\n|-\n| Pintle mount || 1,000 (200) || 577 || -10°/+50° || ±120°\n|-\n|}\nOne of the hidden gems of this tank, the three .50cals enable a player to effectively blind enemies, shred lightly armoured vehicles, and engage unsuspecting aircraft. Two of the machineguns are mounted in the turret and are controlled by the gunner. They are locked with the sight of the main gun, thus are also subjected to the limited elevation angles of the turret. The third machinegun is located at the roof of the turret and is pintle mounted. While this top gun is technically able to freely move around, its actual training speed is rather slow. It is best to use this gun to engage slower moving aircraft or those flying in a predictable path.\n\nOne spicy advantage of the .50cal is its ability to de-track enemy vehicles in close-quarters. With three .50cals, immobilizing enemy tanks at close range will take a matter of seconds, and grant you the tactical initiative against whoever's tracks you just shredded.\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\n;Combat tactics\n\n* In an ''offensive role'', the {{PAGENAME}} can be used in 2 main ways. The more common and safer strategy is to team up with another tank, preferably a heavy or medium tank. Move up to the frontline while covering each other, leapfrog each time so one tank snipes an enemy while the other moves to a cover position with an advantageous firing position, then keep advancing at a safe pace. The other method is to get right up in their face, only giving them shots at the {{PAGENAME}}'s tough frontal armour. As aggressive this strategy is, it leaves the {{PAGENAME}} open to attacks from the sides. This is a last-ditch strategy generally. In either offence strategy, the biggest risk is getting too far ahead from the rest of your allies, leaving the {{PAGENAME}} vulnerable and without any supporting fire.\n\n* In a ''defensive role'', the {{PAGENAME}} truly shines in a hull down position. Frontally, its turret is tough and the cheeks are sloped enough to bounce most shots. The only real target available would be the small cupola on the turret roof and the turret ring if it is not covered. While the gun barrel is vulnerable to being broken, a moderate crew can repair it in seconds. Although the gun depression angle isn't as great as other American tanks, it still provides an advantage in hilly terrain. When in the right spot, the player can devastate the enemy team with almost no risk to themselves by exposing only the gun barrel and the top of the mantlet. Be aware that there are certain spots and ports in the mantlet that can be penetrated even by a Wirbelwind using PzGr 40 rounds. Players experienced with American heavies can find a good spot that will provide them with ample cover while they support the team. Wiggling the turret while reloading can make the enemy bounce, same tactics as seen with the IS-2. Some shots to the lower gun mantlet may also bounce downwards and penetrate the thin hull roof.\n\n;Notables enemies\n\n* [[Tiger II (P)]] and [[Tiger II (H)|(H)]]: These are going to be the most common and equal enemy. While most of the {{PAGENAME}}'s front armour can take on the 88 mm APCBC round, APCR can penetrate the front mantlet of the turret. It can also aim for the lower glacis on the hull, which will knock-out the driver and can repeatedly do this until the entire crew gets knocked out. To fight the Tiger II's, aim at the cheeks of the turret with any ammo, preferably the right as that is where the gunner sits. Using the T32 APBC ammo, there is a chance that it can penetrate the Tiger II's front glacis at close range (less than 100 m) and the lower glacis from even further, making the T32 round probably the most preferable round to use against the Tiger II's front. If the {{PAGENAME}} can get the Tiger's side though, a simple T13 APCBC round can turn a Tiger II into a fiery ball of fire.\n* [[Tiger II (10.5 cm Kw.K)]]: Though the same rule applies to the 88 mm Tiger II, take extreme caution as the 10.5 cm cannon can penetrates the {{PAGENAME}}'s mantlet from the front and devastate interior. Rounds aimed at the Tiger II 10.5's rangefinder (bulges on the sides of the turret) may splash inside the turret, knocking out the gunner and likely a loader as well.\n* [[Jagdpanther]]: Equipped with the same 88 mm as on the Tiger II, this tank destroyer can do some damage if it can get a good shot. However, the {{PAGENAME}}'s 105 mm cannon can easily penetrate through its front glacis, just don't shoot too close to the gun or the gun mantlet may bounce it.\n* [[Ferdinand]]: The greater armour on this tank destroyer makes it harder to fight in a long-range engagement. However, if the {{PAGENAME}} can get closer, the flat armour space on the top superstructure and the hull front can prove more vulnerable. Of course, getting to the side of this tank destroyer is a guaranteed point if an APCBC round can be landed into it.\n* [[ISU-152]]: While easily destroyed by one shot of the 105 mm cannon, the 152 mm howitzer still can do unspeakable damage if it hits the {{PAGENAME}}'s vulnerable turret and hull roof.\n\n;Defeating a {{PAGENAME}}\n\n* With 4 crewmen sitting in the turret, any penetrating shot to the turret with a good post-penetration damage means most certainly the destruction of your vehicle.\n* In a frontal encounter, aim for the {{PAGENAME}}'s lower glacis or the hull MG port (small area).\n* When flanking, aim for the hull section under the turret. Make sure to avoid shooting the tracks. Follow up with a shot at the driver's position if it survives.\n* You can also aim at the engine compartment to immobilize the {{PAGENAME}} and then let your teammates finish it.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Armed with an extremely good 105 mm gun that's far superior to the T32's 90 mm gun\n* T13 round has both high penetration power and post-penetration damage potential. Penetrating an enemy's crew compartment is almost always a kill\n* Has a fantastic set of optics with magnification levels of 4x-8x. Great for both quick close range target acquisition and long range sniping\n* Great overall turret armour. Only guns that penetrate more than 200 mm of armour pose a real threat\n* 10 degrees of gun depression coupled with the really strong turret makes the {{PAGENAME}} great at shooting from ridgelines and hull-down fighting\n* Armed with three .50 cal machine guns, allowing the {{PAGENAME}} to easily damage lightly armoured vehicles and tracks\n\n'''Cons:'''\n\n* The lower glacis plate is both long and weakly armoured. Any gun packing over 165 mm of penetration poses a threat if the lower plate is visible\n* While tough, the gun mantlet is not impenetrable. Guns like the Tiger II's 88 mm can punch right through it at ranges exceeding 500 m\n* The T29 is much slower than other heavy tanks at the same BR\n* Tall silhouette like the Tiger II, making it very hard to hide\n* The {{PAGENAME}} has an enormous amount of ammo lining the right turret cheek and rear turret compartment\n* Unlike most tanks at the BR, the sides of the engine compartment are much weaker than the sides of the hull. Coupled with the placement of the turret, this means the {{PAGENAME}} isn't good at side scraping \n* Only one of the .50 cal machine guns can effectively engage aircraft flying higher than coaxial level\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n===Development===\nProjects for a dedicated heavy tank for the U.S. Armed Forces began in March 1944 as a response to the German heavy tanks that have been popping up in Europe. While the T26E3 tank, later known as the [[M26]] Pershing was slated to be the next-generation American tank, it was still considered unsuitable against the even heavier [[Tiger II (H)|Tiger II]]. A project to increase the armour and firepower commenced countering this problem, the project titled '''Heavy Tank T29'''. Using design elements from the T26E3 with thicker armour and lengthened hull, the T29 also was equipped with the [[T5E2 (105 mm)|105 mm Gun T5]], a gun in development alongside the heavy assault tank [[T95]]. Other features included a 770 hp Ford GAC engine, armour thickness up to 279 mm effective, and a coincidence range-finder. The heavy armour and armament made the tank weigh about 64 tons, making it a close match to the Tiger II.\n\nThough the T29 was monstrous itself, side projects involving the T29 crafted the [[T30|T30 Heavy Tank]]. Itself similar to the T29 in terms of armour, but featured a monstrous [[T7 (155 mm)|155 mm Gun T7]] with a more powerful engine and an extra crew member to facilitate loading the gun.\n\n===Effect in World War II===\nThroughout World War II, the T29 and the T30 stayed in development under the priority \"limited procurement\". Eventually, the war in Europe ended in May 1945, but the small ordered stayed in hope it may be useful in the Japan invasion in Operation Downfall. That hope was smashed as well when Japan surrendered in September 1945, ending World War II. Even if an operation commenced that used these vehicles, the Army Ground Forces objected to the use of such heavy equipment due to the lack of adequate transporters. Further production was cancelled in the post-war demilitarization.\n\n===Post World War Effect===\nThe heavy tank concept didn't end with the war and a final attempt was made to remake the T29 into a more modern, lethal weapon system. This produced the [[T34|T34 Heavy Tank]], which mounted a 120 mm gun based on the M1 anti-aircraft gun. The calibre made an adequate balance of firepower and loading ease between the 105 mm and the 155 mm used in the T29 and T30. In fact, the two T34 pilot models made were a converted T29 and T30. However, the demilitarization took down the T34 program as well, but the experience in this project help engineers in the development of the [[M103|M103 Heavy Tank]].\n\nToday, there are a few T29s still in display across the United States, most of them residing in storage at Fort Benning, Georgia where they will be used as a display in the future National Armor and Cavalry Museum.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=us_t29 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|owYlJZ4LgyA|'''The Shooting Range #36''' - ''Pages of History'' section at 02:26 discusses the {{PAGENAME}}.|z_rLi-s7U2k|'''{{PAGENAME}} - Tank Review - Too Awesome : Pay-to-win?''' - ''Napalmratte''|n9KdgbSzla8|'''The Shooting Range #23''' - ''Metal Beasts'' section at 03:26 discusses the {{PAGENAME}}.|NLr2swmOW_w|'''{{PAGENAME}} Tank Review''' - ''NUSensei''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n;Vehicles equipped with the same chassis\n\n* [[T29 Heavy Tank (Family)]]\n\n;Other vehicles of similar configuration and role\n\n* [[Tiger II (10.5 cm Kw.K)]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/3731-development-t29-the-experimental-monster-video-added-en|[Devblog] T29: The Experimental Monster]]\n* [[wikipedia:T29_Heavy_Tank|[Wikipedia] T29 Heavy Tank]]\n* [https://tanks-encyclopedia.com/ww2-usa-heavy-tank-t29/ <nowiki>[Tanks Encyclopedia]</nowiki> Heavy Tank T29]\n* [https://www.militaryfactory.com/armor/detail.asp?armor_id=352 <nowiki>[Military Factory]</nowiki> T29 (Heavy Tank T29)]\n\n{{USA heavy tanks}}\n{{USA premium ground vehicles}}"}}