{"title":"T95","pageid":772,"wikitext":{"*":"{{Specs-Card\n|code=us_t95\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} American tank destroyer {{Battle-rating}}. It was introduced in [[Update 1.49 \"Weapons of Victory\"]].\n\nThe T95 is good at providing support and dragging enemy fire. As of [[Update 1.59 \"Flaming Arrows\"]], the T95 shares the HE-filled APCBC T13 shells, researchable at tier 1 modifications, giving it an incredible punch that puts it on par with the [[Jagdtiger]]. It is very well known for its amazing frontal armour, hard to penetrate for the majority of guns at its rank. Experienced enemy players are aware of the T95's downsides: one hit weak spots, poor top speed, long reload and they will subsequently use it against the ''mighty Doom Turtle''.\n\nThe T95 is a very heavy and slow TD, the main purpose of which is to hold and defend a tactical position or to lead a forward push, thereby giving allied vehicles the the chance to strike at the enemy, most likely distracted by the defying task of taking down the immensely armoured T95.\n\nEven with its great frontal armour, a few enemies can still destroy the T95 frontally by using HEAT ammo (e.g. [[M103]]: 380 mm and [[SU-122-54]]: 400 mm pen), or for any other tank starting with [[:Category:Third_rank_ground_vehicles|rank 3]] by hitting the two obvious weak spots.\n\nTo hide the weak spots, one should try to find a spot where the cupolas are at well hidden from the enemy, either by finding a favourable slope or a high place, thus angling the vehicle to a point where only the front armour plates are in the sights of the enemy. Staying out of range (+600 m) to deny easy hits, alternatively, is a simple yet still quite effective tactic. Whenever an object such as a pillar presents itself in a combat area, the T95 driver should cleverly place the driver's cupola behind it — as with any other vehicle, proper use of the terrain is of utmost importance.\n\nDespite its bad top speed, the T95 has amazing traverse speed, making it quite hard for an enemy (even light tank) to flank. This is further enhanced with good lower side armour and well angled top side armour. The sides are around 210 mm total with spaced armour in the tracks, any shot that hits it using HE-filled rounds will often explode before penetration inside occurs.\n\nThough the T95 is a walking shield (aside from the two weak spots), the tank is very situational due to its slow speed. It has advantages in smaller maps with narrow corridors, such as city-based maps, while it struggles in larger maps with hilly terrain due to its poor climbing ability.\n\nUsing the explosive-filled T13 shell (APCBC), the T95 can dispatch almost any tank it can penetrate in one go, given that the necessary conditions of detonation are present, i.e. the penetration of 20 mm of armour and the total of 1.2 m travelled — a lucky [[ASU-85]] could endure a hit from the side without the customary fate of disastrous explosion, but these rare moments shouldn't be expected by anyone versing the T95. Anyways, the 12.7 mm machine gun does a fine job at disposing of such lightly armoured targets when the necessity arises.\n\nThe .50 calibre machine gun is mounted on the commander's cupola and manned by the very same, this heavy machine gun allows for decent anti-air fire arcs. Fire arcs are ~300° with a small dead spot to the rear and ~80° upwards, or rather for how much the camera allows for. If used freely and without constraint, the ammo will drain quickly. Some moderation is advised, given the lack of a co-axial MG for clearing bushes and fences. Clearing obstacles is the secondary armaments primary usage. Mostly due to the cannons low mounting height. Even small fences can obstruct the sight.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n'''Armour type:'''\n\n* Rolled homogeneous armour\n* Cast homogeneous armour\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 305 mm (0-29°) ''Front'' <br> 133.35 mm (60°) ''Lower Glacis'' || 152 mm bottom <br> 63.5 mm top|| 50.8 mm || 38.1 mm\n|-\n| Cupola || 76.2 mm || 76.2 mm || 76.2 mm || 76.2 mm\n|-\n| Additional armour || 292.1 mm ''Mantlet'' <br> 76.2 mm ''Cupolas'' <br> 76.2 mm ''track guard''|| 76.2 - 101.6 mm ''Lower track guard'' <br> 63.5 mm ''Upper outer track guard'' <br> 25.4 mm ''Upper inner track guard (drawer)''|| N/A || 38.1 mm ''Radiator cover''\n|-\n|}\n'''Notes:'''\n\n* Engine-crew-compartment wall is 25.4 mm.\n* Plenty of attached ''rolled homogeneous'' accessory with 25.4 mm.\n* 25.4 mm of belly armour at quite a big height off the ground. Therefore safe from 122 mm cannons using HE between the tracks.\n* 20 mm of structural steel for suspension and rollers. The track section is riddled with them.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n[[File:T95 firing.jpg|thumbnail|right|In the ruins of the Berlin map this T95 wears the \"Destruction\" decal, unlockable for defeating 700 enemy tanks with US ground forces.]]\n\n{{tankMobility|abMinHp=710|rbMinHp=442}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nAfter Parts and FPE, priority research targets for this tank should be mobility upgrades and the T13 APCBC shell.\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|T5E1 (105 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[T5E1 (105 mm)|105 mm T5E1]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 62 || rowspan=\"2\" | -5°/+19° || rowspan=\"2\" | -10°/+11° || rowspan=\"2\" | N/A ||8.8||12.2||14.8||16.4||17.4|| rowspan=\"2\" |20.0|| rowspan=\"2\" | 17.7 || rowspan=\"2\" | 16.3 || rowspan=\"2\" | 15.4\n|-\n! ''Realistic''\n|5.9||7.0|| 8.5 ||9.4|| 10.0\n|-\n|}\n\n==== Ammunition ====\n'''T32; APBC''' - The stock shell and previously the only one ever needed, unless engaging in combat over 1,000 m distance. It features decent normalization and good penetration even at ~60°, unlike the T29E3 APCR. Only downfall is the 50% ricochet chance against ~60° angled armour plates, like the frontal plate of the [[T-54 (1947)]], which the shell would otherwise easily penetrate up to 1,000 m range ([[T-54 (1949)|mod. 1949]] & [[T-54 (1951)|mod. 1951]]). Post-penetration effects are meagre. No HE filler, therefore only spalling and direct impact cause damage. For ammo racks, the detonation chance is roughly 5-10%. A bit better for starting fires, though. Therefore focus on crew members and vital modules.\n\n'''T29E3; APCR''' - The additional 50 mm penetration at all ranges looks good on paper, but a further check reveals a great disadvantage. With greater armour angles the penetration quickly drops, even past the stock APBC shot! And as angled plates become very common in era IV, this shell can just be ignored. Exemption is on ranges exceeding 1,000 m. Pack extra for expected long-range sniper duels. Additionally, the post-penetration effects are small and angle normalization does not happen upon impact. Direct hits on ammo racks have a small chance to cause an explosion like the APBC. Focus fire on crewmen and important modules!\n\n'''T30E1; HE''' - Despite the calibre the HE is worse than similar calibres found on the [[Tiger II (10.5 cm Kw.K)|King Tiger's]] [[KwK L/68 (105 mm)|105 mm KwK L/68]] and the [[SU-100]]'s [[D-10S (100 mm)|100 mm D-10]] cannons, even less than on the [[M3A1 (90 mm)|90 mm M3A1]] cannon on the [[M46]]. Damage against common [[:Category:Anti-aircraft_vehicles|SPAA]] is therefore unsatisfactory and the roof mounted [[M2HB (12.7 mm)|M2HB Browning]] heavy machine gun is the better weapon of choice.\n\n'''T13; APCBC''' - This should be the go-to ammunition with the T95, at any range. While it sacrifices some penetration (about 40 mm at many ranges when compared to the T32 APBC), it has a HE filler. This allows this shell to one-shot almost anything it penetrates. It has massive post-penetration damage, and this is why the sacrifice of raw penetration is worth it. Despite the lower penetration, with proper aiming, the T13 shot can penetrate any tank it sees. When fighting King Tigers, simply aim for the turret faces (right side preferably) and lower glacis. When fighting T-44s and T-55s, aim for the turret faces, to the left and right of the gun, or the cupola if close enough to consistently hit. When fighting another heavy TD like the Jadgtiger, simply aim for the lower glacis, while it will rarely be a one-shot like this, it will immobilize him, and allow the leisure of finishing it off at an opportune time. Tanks like the IS-3 and T-10 are one of the greatest challenges for this shot, as their pike fronts are usually strong enough to bounce it if they are facing the T95. To defeat them aim for the area right at the top of the pike and below the gun, though this can be challenging. The cupola is again a valid target for pike front soviet heavies if close enough. To destroy an IS-6 frontally, aim for turret front, cupolas, or right under the gun where the shot can bounce down into the hull. While on paper, this shot lacks the penetration to penetrate the front of the Maus turret, it can actually penetrate it due to the armour penalty that the Maus has, which makes its armour weaker. Most other tanks can simply be shot centre of mass.\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| T32 || APCBC || 256 || 253 || 238 || 221 || 205 || 190\n|-\n| T13 || APCBC || 253 || 250 || 236 || 219 || 204 || 190\n|-\n| T29E3 || APCR || 292 || 287 || 266 || 242 || 220 || 200\n|-\n| T30E1 || HE || 20 || 20 || 20 || 20 || 20 || 20\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| T32 || APCBC || 914 || 17.7 || N/A || N/A || N/A || 48° || 63° || 71°\n|-\n| T13 || APCBC || 899 || 18.59 || 1.2 || 19 || 177.38 || 48° || 63° || 71°\n|-\n| T29E3 || APCR || 1,128 || 11.2 || N/A || N/A || N/A || 66° || 70° || 72°\n|-\n| T30E1 || HE || 945 || 15.2 || 0 || 0.1 || 1,550 || 79° || 80° || 81°\n|-\n|}\n\n==== [[Ammo racks]] ====\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! Ammo<br>part\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! 7th<br>rack empty\n! 8th<br>rack empty\n! 9th<br>rack empty\n! 10th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''62''' || ''Projectiles''<br>''Propellants'' || 57&nbsp;''(+5)'' <br> 52&nbsp;''(+10)'' || 47&nbsp;''(+15)'' <br> 41&nbsp;''(+21)'' || 42&nbsp;''(+20)'' <br> 36&nbsp;''(+26)'' || 37&nbsp;''(+25)'' <br> 31&nbsp;''(+31)'' || 31&nbsp;''(+31)'' <br> 25&nbsp;''(+37)'' || 25&nbsp;''(+37)'' <br> 19&nbsp;''(+43)'' || 19&nbsp;''(+43)'' <br> 13&nbsp;''(+49)'' || 13&nbsp;''(+49)'' <br> 7&nbsp;''(+55)'' || 7&nbsp;''(+55)'' <br> 1&nbsp;''(+61)'' || 1&nbsp;''(+61)'' <br> &nbsp; || Yes\n|-\n|}\n[[File:Ammoracks_T28GMC.png|right|thumbnail|Ammo racks of the [[T28]] (identical to the T95).|300px]]\n'''Notes''':\n\n* Visual discrepancy: projectile rack 2 holds 10 shells instead of 11. Right upper rear propellant rack (x) never depletes.\n* 20 rounds are enough for AB and 30 are enough for RB/SB.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|M2HB (12.7 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[M2HB (12.7 mm)|12.7 mm M2HB]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Pintle || 1,000 (200) || 577 || -10°/+70° || ±140°\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nWith this in mind let us talk about the need for speed:\n\nThe Doom Turtle is very slow, the slowest vehicle in-game to be exact.\n\nFor tactics, we must rather think of strategy: It may only reach one specific point through an entire match, so make sure the T95 is actually needed at that point or all that will be spent is digital gasoline.\n\nStudy the map and look for choke points, places of fierce narrow fielded conflict. Points were fighting will always take place.\n\nThere are two main playstyles: Support and Spearhead. Playstyle does not really change with the game modes, they can be universally used.\n\n'''Support'''\n\nThe biggest problem of the Doom Turtle is the weak spots, undermining the trade-off speed for armour. However, if the T95 stays beyond decent accuracy (+500 m), or gain height advantage and use gun depression, then the weak spots are no longer accessible. Do not mistake this with a sniper role! The average range should be 400 to 800 m. Stay with the team, the T95 is their shield. Be a classic tank in RPG sense. If the situation is about to grind down and come to hold, change to the Spearhead strategy (see below).\n\nThe main task is to provide fire assistance since the cannon is not made to take out tanks and features a long reload, disabling enemy tanks with engine hits is the priority. Further, draw the enemies attention to the T95. Force foes into sniper duels. Every shot at the T95 is one away from an ally. To enhance this sit in an exposed position and attack enemies with the machine gun. Make them shoot at the T95. Once using the T13 shell, the disabling shots the T32 made will turn into nasty shots with post-penetration damages.\n\nGood places to go for are where the heavy tanks would rush to fight with their armour. Or spots medium tanks use but do not hide in the cover, leave it open for the allied medium tanks. Their support is essential to enhance the T95's own slow firing rate. Playing driving cover/pillbox is also something to consider under these circumstances.\n\n'''Spearhead'''\n\n[[File:T95 - putting up pressure.jpg|thumbnail|Although going this close is ill-advised, as for enemy tanks can have better reverse speeds than the T95 can drive forwards. Not to mention the cupola weak spots becomes an easy target. The T95 is putting pressure on and places the opponent under stress. Psychological effects should not be underestimated. In this case, the [[Tiger II (10.5 cm Kw.K)]] got stuck on the rubble pile and is further blocking his allied [[IS-4M]] the sight. Reversing now allows for a free shot into the Tigers transmission, locking him in place.]]\nThe following tactic goes against anything one would expect with the above and described the tank's issues. While it sounds easy, there must be put a lot of thought into it to succeed.\n\nPress and hold \"W\" and click \"Mouse button 1\" once in a while. It, in theory, will get the T95 heavily damaged or even destroyed, but in practice, a 86 tonnes vehicle is determined to steamroll everything in its path and everyone gets scared, panicked even. An example can be seen in the screenshot on the right\n\nBut which place to charge through like the Light Brigade? The goal of this attack is to push the team out of camping positions and draw selected enemy fire onto the T95. Long narrow sections with decent cover left and right is good places. Other places would be on the edge of the map and come in from an angle, limiting the foes attack front to only <100°. Having on to worry about only one side armour section allows for good angling opportunities. On Poland, the northern town part in domination is a good example of this. The northern side is usually clear and south are only has got a few spots where fire can hit the side, make sure to turn south at those spots to further improve the south facing side armour via armour angling.\n\nNext step ones close enough is to capture the control point and/or keep advancing into the enemy to dig them out.Now, once the position is secured, the strategy can be changed to a Support role (see above), or go sneaky and hide around a corner.\n\nMain difference to support is the change of module targets: Gun breech and gunner are to priorities, as this close up the T95's weak spots are very easy to hit. Further keep spamming the machine gun, to cloud the foe's sight and make them focus on the T95, helping the allies (who hopefully followed) to take them out.\n\n[[File:T95 EasternEurope.jpg|thumbnail|left|Although a stationary tank destroyer, this does not mean to remain immobile! Keep changing position after some shots and be aware of the surroundings — otherwise, the T95 turns into one of those craters.]]\n\nSitting at an uneasy spot with 7.0 in AB and 6.7 in RB/SB, facing off Rank 5 vehicles and a variety of WW2 vehicles. All vehicles can penetrate the upper side armour and the weak spots. Therefore all medium vehicles are dangerous and their engines should be disabled ASAP.\n\nFoes able to frontally penetrate the T95 are labelled red. As only solid shot ammo is available, specific modules must be a target. Generally: Medium tanks - Engine; Heavy tanks - Cannon breech, crew; TDs - Crew compartment, gunner;\n\n* Tank destroyers/<span style=\"color:red\">&#9760;[[SU-122-54]]</span>: Except for the Jagdtiger all TDs should be shot at their gunner position to disable at least two crewmen.\n*[[IS-3]]: Pike is difficult to get through. Try to disable the cannon, or wait for him to angle the tank wrong to shoot through the pike. Otherwise, with only 4 crewmen keep disabling them one by one.\n*[[IS-4M]]: The drives hatch is hard to get through with the tiny hole behind the additional armour. More favourable is the lower plate. The same as for the IS-3 applies.\n*T-54s & <span style=\"color:red\">&#9760;[[T-54 (1951)|mod.51]]</span>: All can be penetrated through the turret front (left and right of gun mantlet) from closer than 500 m. Except for the [[T-54 (1947)|mod.47]], the glacis plate may also be targeted, if it is straight pointed at the T95. Target either the engine or the ammorack + fuel tank at the front (chance to set if off is slim though).\n*[[T-44]]: Turret can be very trolly, but is the best way to avoid return fire. Engine and crew are again good targets.\n*[[Tiger II (H)]]: Right turret cheek to disable the gunner, alternatively the lower glacis to get the transmission.\n*[[Maus]]: Given its height, the T95's weak spot is very easy to hit. Disable the gunner via a shot in the right turret cheek. If closer than 1,000 m, retreat before he can man the cannon again.\n*[[Jagdtiger]]: A tough nut, plus 250 mm of raw and sloped armour disables APBC and APCR shells. Thankfully the lower plate is a good place to shoot. Make sure to hit at a good flat angle, as the APBC likes to bounce.\n*<span style=\"color:red\">&#9760;[[Leopard I]]</span>: Shoot anywhere at the front, but do so quickly, as a good player can shoot and very quickly destroy the T95. Yet, due to the low armour thickness, the shrapnel damage inflicted is great and may even one shot it.\n*<span style=\"color:red\">&#9760;[[M103]]</span>: Try to shoot into the turret trap (lower gun mantlet) or the turrets cheeks. Try to disable the cannon, breech and crew men.\n*[[Panther F]]/[[M26]]/[[M46]]: Entire front is penetrable. Shooting the upper glacis and into the engine through the fighting compartment will deal decent damage.\n*<span style=\"color:red\">&#9760;[[M47]]</span>: Don't shoot the upper glacis, more preferably the turret. Engine and gun breech are good targets to start with\n*<span style=\"color:red\">&#9760;[[M60]]</span>: Lots of sloped armour. Frontally, the commander's hatch can be hit quite easily, but this fight should be avoided at all costs. Basically an up-armoured Leopard.\n*<span style=\"color:red\">&#9760;[[U-SH 405]]</span>: Easy to destroy with one shot, but extremely fast and armed with 18 rockets with 330 mm of penetration. These rockets will cut right through your armour. Do not miss your shot when engaging one of these tanks.\n\n==== Fighting Against the T95 ====\nWhen facing the T95, it is very important to know the weak spots. A major weak spot is the commander's cupola on the top left (right if facing it) of the T95. This spot can be penetrated by most guns at its BR, and if APHE or HESH is used is likely to result in the death of a few crew members. Another strategy is to disable the tracks, then flank to the side. This is probably the most viable strategy when the T95 is alone. However, if it is accompanied by team members, which it should be, then this strategy will be more difficult to pull off. It is important to disable all of the tracks, as the T95 is still able to turn with only 2 or 3 tracks intact. Once you are at its flank, however, it will be easy to take it out. Like most tanks with formidable frontal armour, it has much less armour at the sides. Also, most of the crew or ammo racks are able to be hit from the side without interference from other modules. Overall, the T95, like other turretless tank destroyers, is very formidable from the front, albeit for the weak spot on the cupola, but suffers when flanked. As stated above, however, due to the 4 tracks the T95 has a very good turning speed, which makes flanking much more risky.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n[[File:T95 vs KingTiger Comparison.jpg|thumbnail|right|T95 and [[Tiger II (H)]] height comparison. The T95 is as tall as the Tiger's chassis and with similar hull length. The Tiger II is one of the taller vehicles.]]\n\n'''Pros:'''\n\n* Extremely tough armour: 300 mm of frontal armour, and very strong sides thanks to the massive tracks.\n* The T95's resilience to bombs, artillery, and large calibre HE shells rivals that of the [[Maus]] and [[E-100]].\n* Massive gun mantlet.\n* Four sets of very strong tracks that are difficult to destroy in a single shot.\n* The four sets of tracks gives this tank incredible hull traverse. The reactive mobility is so good that some light tanks simply aren't fast enough to circle the T95 with out getting shot.\n* Mounts the same impressive 105 mm found on the [[T28]] and [[T29]], firing an extremely powerful APCBC shell.\n* The raw frontal armour thickness coupled with the extremely powerful gun makes this tank one of the best snipers/ breakthrough tanks in the game.\n* Roof-mounted .50 cal machine gun; can actually defend its self against attacking aircraft.\n* Extremely intimidating tank. Many players will simply avoid fighting this tank.\n\n'''Cons:'''\n\n* The single slowest tank in the game, with very little potential of fleeing.\n* Due to the terrible top speed, some large maps force the player to become a sniper since some games will end before you even reach the objective.\n* A prime target for many enemy attackers and bombers thanks to its terrible top speed.\n* The frontal armour still stands no chance against APDS and HEAT shells.\n* Gun mantlet isn't as tough as the [[Jagdtiger]]'s. Most HEAT shells and close-range APDS shots able to go through the mantlet and destroy the breech.\n* Despite having the same gun as the T29, it has much slower rate of fire.\n* The side armour above the tracks is weakly armoured and lined with ammo.\n* The driver can be knocked out if shots enter to the top left cupola, while the commander can die if shots enter the right cupola.\n* The high intimidation factor is a double edged sword. Since a portion of the enemy team will be actively trying to avoid the T95, it's not uncommon to go an entire match without firing the main gun once.\n* Very expensive repair cost. You have to have a very good game to even make a profit.\n* Barrel, and thus gun sight, is very low to the ground. Drivers will need to expose a large amount of the upper tank in order to bring the cannon to bear in a hull down position.\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n=== Development ===\nYears before the invasion of Normandy, there were men among the Allied planners worrying about the heavily-defended fortification lines such as the Siegfried Line blocking the path from France to Germany. One of the proposed methods was to develop extremely heavily armoured vehicles capable of destroying any fortification it comes across and any resistance the German had. Britain and America both worked on this project in order to develop these super-heavy tanks.\n\nThe American solution was a vehicle that would be called the '''T28 Heavy Tank''' and work began on such vehicle in September 1943. The initial vehicle concept called for a casemate design with a [[T5E1_(105_mm)|105 mm T5 gun]], which was evaluated to be \"extremely effective at reducing heavy fortifications\". The only other armament on the vehicle would be a .50 cal machine gun for use by the commander. The armour on the design was 203 mm at first, but in January 1945 the head of Ordnance worried about the effect of German APCR ammunition, and so the already significant armour was upped to an astounding 305 mm thick frontal armour, at the increase of weight to 95 tons. The vehicle's electric drive was a carryover from the [[M6A1]] and T23 tank, with the engine the same from the [[M26]] Pershing (which was the same as the [[M4A3 (76) W]]). The heavyweight with the underpowered engine allowed the T28 to reach a whopping 8 miles per hour speed. To carry this design, the vehicle had four sets of tracks, two on each side, 328 mm wide each in order to lower ground pressure. For transport, the extra set of tracks on the sides can be removed to make the vehicle thinner (4.55 m to 3.15 m) for easier transport, but raising ground pressure (0.82kg/cm<sup>2</sup> to 1.14kg/cm<sup>2</sup>) and reducing armour since the detached track sets comes with 102 mm skirt armour.<ref name=\"EstesHeavyTanks\">Estes Kenneth W. ''Super-heavy Tanks of World War II'' Great Britain: Osprey Publishing Ltd., 2014</ref>\n\nThe T28 heavy tank continued with the development and in March 1944, the U.S. Army gave it the name and also placed an order for five pilot models for testings. In March 1945, Ordnance then renamed the T28 into the '''105 mm Gun Motor Carriage T95''' due to the lack of turret for a \"tank\" and any regular secondary armaments. Then, in June 1946, the vehicle was renamed again to the '''Super Heavy Tank [[T28]]''' due to the United States construction of self-propelled guns being lightly armoured, in order to distinguish it as a radically different design than simply a \"tank destroyer\". Today, the T95 and T28 naming are both used to title this vehicle.<ref name=\"EstesHeavyTanks\" />\n\n[[File:T28 Front Quarter.jpg|thumbnail|right|Front three-quarter view of the T28 at the Patton Museum. T28 Super Heavy Tank - no longer on exhibit as it has been prepared to move to Fort Benning GA.]]\n\n=== Procurement and deployment ===\nThe five pilot models requested by the U.S. Army had Ordnance look for a manufacturer to produce these vehicles. The war effort had made many prominent manufacturers busy with pre-existing orders. The Pacific Car and Foundry Company were then contracted to produce the design, with production starting in March 1945. The complete tank design was finished by August 1945, by this time the war had already ended in Europe three months ago. Efforts continued on the tank until the surrender of Japan in September, ending World War II. The post-war cutbacks led to the request for five tanks lowered to just two. The first T28 prototypes appeared in Aberdeen Proving Grounds on 21 December 1945, with the second arriving on 10 January 1946. These two prototype tanks went through evaluations at Aberdeen and Yuma Proving Grounds, mostly for engineering tests to check the durability of the components used. The second prototype model caught an engine fire in Yuma and had to be scrapped. The T28 project finally ended in October 1947 when development for such heavy vehicles stopped. Records on the sole T28 prototype ended afterwards, many assumed the vehicle was destroyed or scrapped.<ref name=\"EstesHeavyTanks\" />\n\nIn 1974, the sole remaining T28/T95 prototype was found in the fields behind Fort Belvoir, Virginia by a wanderer, rumoured to be a farmer out hunting or a lieutenant conducting inventory inspection. To this day, no one is certain how the T28 tank was left abandoned in the fields or what happened during the years in absence. It was moved to the Fort Knox, Kentucky to be displayed in the Patton Museum of Cavalry and Armor. Today, its resting place is in the National Armor and Cavalry Museum in Fort Benning, Georgia.<ref name=\"EstesHeavyTanks\" />\n\n=== Legacy ===\nIn the end, the super heavy tanks designs made by the Americans (T28) and the British ([[Tortoise]]) only proved that such needs for tanks were unnecessary. The Siegfried Line and other such fortifications were taken out by use of the standard issued medium tanks such as the [[M4]] Shermans, proving that affordable, mass-produced vehicles could dominate the modern battlefield. The super heavy tanks were also a strain on battle operations, as one of the most pressing questions during the development of the super-heavy tanks were on just how to get the tanks across the ocean to Europe and supply them with the fuel and ammo. The only positive note that these heavy tanks provided was that it showed the true extent of American and British industrial capabilities, being able to produce these massive monsters.\n\n=== In-game description ===\nA heavy assault tank developed on the basis of research conducted by the armament department. It was designed to break through well-fortified positions. Two models were built and underwent testing between 1945 and 1947. A new 105 mm gun was attached to the base, allowing the tank to fight against fortifications. However, the project was eventually determined to be unrealistic.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=us_t95 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|3i7pnCRSBME|'''{{PAGENAME}} Tank Review''' - ''NUSensei''|B2woWvJK4ew|'''Top 7 most armoured vehicles'''  discusses the {{PAGENAME}} at 1:04  - ''War Thunder Official Channel''|PosWOnOGkSo|'''Best experimental vehicles''' discusses the {{PAGENAME}} at 6:55 - ''War Thunder Official Channel''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n*[http://forum.warthunder.com/index.php?/topic/243508-tales-of-the-doom-turtle-%E2%80%93-the-blog/ WT Forum T95 Blog: \"''Astonishing and amazing 'Tales of the Doom turtle!' &ndash; The blog''\"]\n*[[wt:en/devblog/current/767/|[Devblog] T28 and T95]]\n\n=== References ===\n<references />\n\n{{USA tank destroyers}}"}}