{"title":"Valentine I","pageid":1025,"wikitext":{"*":"{{About\n| about = British medium tank '''{{PAGENAME}}'''\n| usage = other versions\n| link = Valentine (Family)\n}}\n{{Specs-Card\n|code=uk_valentine_mk_1\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg|ArtImage_{{PAGENAME}}.png}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} British medium tank {{Battle-rating}}. It was introduced in [[Update 1.55 \"Royal Armour\"]] along with the initial British ground tree. Britain's solution for a cheaper infantry tank, the Valentine boasts good armour, decent mobility, and a great gun to use against its foes.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n\nWith flat 60 mm thick armour all around, this vehicle can soak up shots, even flanked, provided the enemy shoots from a distance. Although, make sure to avoid directly facing tank destroyers since they tend to have powerful guns able to easily knock the Valentine out. The crew compartment is rather cramped so the crew can usually get knocked out by a single shot if the armour is penetrated. Angle the hull to increase your survivability: the enemy will even have a harder time to penetrate your armour.\n\n'''Armour type:'''\n\n* Rolled homogeneous armour\n* Cast homogeneous armour (Front turret, Gun mantlet)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front !! Sides !! Rear !! Roof\n|-\n| Hull || 60 mm ''Front plate'' <br> 30 mm (65-67°) ''Front glacis'' <br> 60 mm (18°) ''Lower glacis'' || 30 mm (42°) ''Top'' <br> 60 mm ''Bottom'' || 10 mm (59°) ''Top'' <br> 60 mm ''Joint plate'' <br> 15 mm (65°) ''Bottom'' || 10 mm\n|-\n| Turret || 65 mm (9-50°) ''Turret front'' <br> 65 mm (7-78°) ''Gun mantlet'' || 60 mm || 65 mm (0-2°) || 16-65 mm\n|-\n|}\n'''Notes:'''\n\n* Suspension wheels, bogies, and tracks are 20 mm thick.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\n{{tankMobility|abMinHp= 209|rbMinHp= 119}}\n\nThe Valentine is not a fast tank to say the least. It reaches its max speed pretty fast... and stays there, like an old runner taking its beat. It struggles a bit climbing hills and decelerates a lot when turning. This vehicle's driving is comparable to that of a [[Churchill III]], but it does not turn on the spot. The Valentine series share a common British characteristic: painfully slow reverse speed (-3 km/h). The key with such a tank is to anticipate the paths while moving towards the front lines so as to not need to reverse.\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nSuggested research order:\n# Parts can be researched first as the Valentine will often get shot and damaged without dying too soon, so it is important to repair damaged components and rejoin the fight;\n# Tracks improve the Valentine I's terrible stock hull traverse speed;\n# Mobility modifications can be researched to further increase the subpar manoeuvrability;\n# The Shell Mk.1 AP/T is useful for engaging vehicles with its good post-penetration damage;\n# Others modules such as Horizontal Drive and Adjustment of Fire to improve firepower.\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|QF 2-pounder (40 mm)}}\n\nThe 40 mm QF 2-pounder begins to encounter some difficulties at this rank as the Valentine will face some better-armoured opponents. Still, its fast rate of fire can save the day by plundering the enemy with a shot every 3 seconds, almost twice the average rate of fire of its adversaries. This allows quick follow-up shots if the first shot missed, didn't penetrate or didn't destroy the enemy. The Valentine I also has an awesome gun depression of -15° allowing it to fight in the most uneven terrains. Combined with the shoulder stabiliser it is very comfortable to hull-down and engage enemies while moving/wiggling slowly. Its turret is small, bouncy, and sturdy so use it towards your advantage.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[QF 2-pounder (40 mm)|40 mm QF 2-pounder]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 61 || rowspan=\"2\" | -15°/+20° || rowspan=\"2\" | ±180° || rowspan=\"2\" | {{Annotation|Shoulder|up to 10 km/h}} || 15.23 || 21.08 || 25.60 || 28.31 || 30.12 || rowspan=\"2\" | 3.64 || rowspan=\"2\" | 3.22 || rowspan=\"2\" | 2.97 || rowspan=\"2\" | 2.80\n|-\n! ''Realistic''\n| 9.52 || 11.20 || 13.60 || 15.04 || 16.00\n|-\n|}\n\n==== Ammunition ====\nThe player should be familiar with the ammunition choices, with the most used ones being the Shot Mk.IXB APCBC/T APCBC and the Shell Mk.1 AP/T APHE. Generally it is a good idea to bring both the Shell Mk.1 AP/T and the Shot Mk.IXB APCBC/T.\n\n* '''Shell Mk.1 AP/T; APHE''': due to the uparmoured targets the Valentine I will be facing, the explosive APHE might no longer be the most effective, as its penetration of 66 mm at most will struggle to go through common tanks' frontal armour (e.g. [[M3 Lee]], [[T-80]], [[StuG III A]]). However against lightly armoured tanks (e.g. [[Sd.Kfz.234/2]], [[SU-76M]], [[Pz.IV F1]]) the APHE will still be handy. \n* '''Shot Mk.IXB APCBC/T; APCBC''': this APCBC shell with 89 mm maximum penetration will be more useful, though it loses the ability to hurt/knock out crew that are not in its path. This prepares you for the classic British playstyle though, which is about knocking out crew one by one with high precision and penetration, rather than knocking out everyone with a single shot. \n* '''Shot Mk.1 AP/T; AP''' and Shot '''Mk.1 APHV/T; AP''': the 2 remaining shells are not very useful as they don't offer anything better. Not recommended to bring any once you gain access to the previous 2 shells. \n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| Shot Mk.1 AP/T || AP || 72 || 68 || 52 || 37 || 27 || 19\n|-\n| Shot Mk.IXB APCBC/T || APCBC || 89 || 86 || 77 || 66 || 57 || 50\n|-\n| Shot Mk.1 APHV/T || AP || 80 || 75 || 58 || 41 || 30 || 21\n|-\n| Shell Mk.1 AP/T || APHE || 66 || 62 || 49 || 36 || 26 || 20\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| Shot Mk.1 AP/T || AP || 792 || 1.08 || N/A || N/A || N/A || 47° || 60° || 65°\n|-\n| Shot Mk.IXB APCBC/T || APCBC || 792 || 1.24 || N/A || N/A || N/A || 48° || 63° || 71°\n|-\n| Shot Mk.1 APHV/T || AP || 853 || 1.08 || N/A || N/A || N/A || 47° || 60° || 65°\n|-\n| Shell Mk.1 AP/T || APHE || 792 || 1.08 || 1.2 || 9 || 20.9 || 47° || 60° || 65°\n|-\n|}\n\n==== [[Ammo racks]] ====\n[[File:Ammoracks_ValentineMkI.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]]\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''61''' || 31&nbsp;''(+30)'' || 1&nbsp;''(+60)'' || Yes\n|-\n|}\n'''Notes''':\n\n* Pack 31&nbsp;''(+30)'' shells to remove the large ring of ammunition.\n\n==== [[Optics]] ====\n{| class=\"wikitable\" style=\"text-align:center\"\n! colspan=\"3\" | {{PAGENAME}} Optics\n|-\n!\n! Default magnification\n! Maximum magnification\n|-\n! Main Gun optics\n| x1.8 || x3.5\n|-\n! Comparable optics\n| colspan=\"2\" | [[Pz.III J1]]\n|-\n|}\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|BESA (7.92 mm)}}\nThe Valentine I is equipped with a coaxial 7.92 mm BESA machine gun. It has large ammo capacity of 225 rounds per belt. Its rate of fire of 600 rounds/min is quite fast which is good for wiping out the crew of open vehicles when catching them from their side/rear, like [[ZiS-30]], [[Sd.Kfz. 6/2]], [[Chi-Ha LG]], etc. This can sometimes save you by eliminating their gunner if you encounter them. This MG can also destroy map obstacles like fences to clear a path. But that's about it, its low penetration of only 13 mm cannot go through even sheet metal armour found on vehicles like [[Marder III]] and [[Flakpanzer 38]]. \n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[BESA (7.92 mm)|7.92 mm BESA]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 3,500 (225) || 600 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nThe Valentine Mk.1 is a bit of a hit or miss due to its relatively high BR: when uptiered, it plays like a British heavy tank, using its raw armour value to soak up shots. Having that much armour when matched against low-ranked tanks also means that the Valentine can take its time to aim at the weak spots/vital modules of the enemy. Otherwise, it plays like a pretty slow medium tank and should avoid the front lines since its cannon do so little damage.\n\nThe Valentine I is a team player, relying on its allies to provide damage while dragging attention from the enemy. It is a situational vehicle, its gameplay depends much on what it faces.\n\n'''Heavy tank'''\n\nWhen against Rank I tanks, play it like an heavy tank: follow light and medium tanks and seek attention from the enemies by firing at many of them , preferably the ones with a light weapon (shoot the gunner for a better effect). This way, many enemies will try to shoot the Valentine down and will get outflanked by light tank allies (inexperienced players often suffer from \"tunnel vision\" when shooting at an enemy, the Valentine for instance). Stay at a distance, angle the armour a bit to maximise protection and preferably show only the turret, which is thicker and bouncy. Keep in mind to anticipate a fast exit way so that when an enemy with a good gun shows up, the Valentine could retreat as fast as possible.\n\n'''Close range support'''\n\nOtherwise, facing low Rank II tanks, the Valentine should play as a support role, on the second line, preferably on the sides of the enemy. The main task here will be to distract enemies from stronger allies, making them turn their turret to shoot at the Valentine, only to realise they exposed their weak side armour to the allies. The 40 mm cannon does not allow for easy one-shot knock-outs: prepare to collect assists and support fire medals. Although, good close range penetration and fast firing rate can provide the Valentine with easy scores.\n\n'''Use the terrain'''\n\nUtilizing the great gun depression of the Valentine will increase the firing effectiveness greatly in battle. Find a hill on the battle field and peak the turret over the top. The gun depression should allow for full coverage of the battle field, whilst the hill will keep the hull covered. The turret will be exposed, angled and a very hard target due to its small size and angulation. This can make the Valentine an almost immovable object on the battlefield, allowing it to pick off most targets. If any damage is taken, reverse behind the slope to recover. Be aware of flankers.\n\n=== Enemies worth noting ===\n\n* [[ZiS-30]]: this is a small but deadly Soviet tank destroyer. It carries a long 57 mm cannon with ~140 mm penetration which is more than enough to go through the armour of Valentine I at any range. It is also very narrow and short, making it very hard to spot especially when camouflaged. Its great firepower and concealment will thus be constantly used to its advantage. If it sets up an ambush, then unfortunately there is no way to detect it unless it fires at someone else and exposes its location. When it is revealed, target these 2 main areas: if it's facing you, shoot the right side of the fighting compartment to disable its gunner; if it's facing away, shoot the frontal hull to disable its driver or transmission so it cannot traverse the hull to aim at you. A ZiS-30 on the move is also very vulnerable, because if it wants to stop and shoot you it will experience a ~3-second gun wobbling before being able to fire, as its centre of mass is high, making it shaky. \n* [[Ka-Chi]]: this is an amphibious Japanese medium tank with the option of mounting huge pontoons at the front and back of the hull. With the pontoons attached, it resembles a boat. The pontoons act as effective spaced armour and can absorb plenty of kinetic and chemical ammunition around this BR, including the Valentine I's 40 mm shells, meaning the Ka-Chi's hull is impenetrable. The turret is 50-25 mm which can be penetrated although it is smaller. The turret top has a tall copula that seems like a weak spot but it is not, as there is nothing inside. Without the pontoons, the hull front is 50 mm and is penetrable when not angling. The Ka-Chi's 47 mm cannon will penetrate Valentine I's armour perpendicularly, but not when you are angling. Though it can still go through your gun mantlet. \n\n=== Against the Valentine I ===\n\n* '''Light tanks & SPAAs''': against the Valentine I, light vehicles must utilise their superior manoeuvrability to get as close as possible, and be in an appropriate location to target certain areas on the Valentine. Most light tanks have over 65 mm of penetration at 10 m, thus a good tactic is to manoeuvre to point blank range or at least within 100 m from the Valentine. Then, either wait until the Valentine turns its hull or turret so that an area is perpendicular to you, or reposition to a spot that counters its angling. Its hull and turret armour are ~60 mm, mostly unsloped, making it very easy for the majority of light vehicles (e.g. [[M5A1]], [[BT-7]], [[AS 42]], [[Flakpanzer 38]]) to penetrate. Do not shoot if it's angling though, its effective thickness can go way beyond the capacities of conventional firepower at this BR. If your vehicle has low penetration (e.g. [[H.35]], [[M16 MGMC]]), try breaking the Valentine's tracks or gun barrel if it is safe to do so, then pin it out on the minimap or drop an artillery strike on it. \n* '''Medium tanks''': most common medium tanks at this BR such as [[Chi-Ha Kai]], [[M3 Lee]], [[T-28]], etc have way better speed and agility than the Valentine I so flanking like a light tank can work too. But thanks to the increased armour and firepower you can now engage the Valentine I frontally with some more confidence. Angle yourself, the Valentine I's 40 mm shells are quite likely to bounce off most medium tanks like [[M3 Lee]] and [[Chi-He (Family)|Chi-He]]. Medium tanks with worse armour (e.g. [[T-28 (Family)|T-28]], [[Chi-Ha Kai]]), however, need to either angle more or remain passive. Target the Valentine's unangled armour like gun mantlet and driver's port. There is a great chance to knock out most if not all of its closely packed crew.\n* '''Heavy tanks & tank destroyers''': for heavy tank players, you can usually take hits from the Valentine especially when you are angling, hull down, far away, or using a combination of these. Its maximum penetration of 89 mm does not work well when hitting distant and/or sloped armour. Do note that if you have any weak spots (e.g. [[B1 bis|B1]]'s turret ring) you may need to be more careful as the Valentine I has a very quick reload of ~3 seconds which might hit your weak spot while you peek out thinking it is reloading. Tank destroyers can usually one-shot the Valentine I from any angle, but do avoid the Valentine's gun or even MG if you are thinly armoured. Avoid shooting at the Valentine's upper glacis and the sloped parts besides its driver's port since these areas are more likely to bounce shells.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Very good armour for its battle rating\n* Gun has a good penetration for its BR\n* Very short reload time, even with an incapacitated crew member\n* Good turret rotation speed\n* While it is a medium tank, it plays like a heavy tank and can call in artillery strikes which can be useful in certain situations\n* Has smoke launchers\n* Low profile\n* Very small weak spots\n* Can act as a distraction for teammates to flank around\n\n'''Cons:'''\n\n* Very slow due to underpowered engine\n* Handling is poor especially on rough terrain\n* It is incredibly slow when navigating over hills\n* Gun is inaccurate at longer ranges\n* Only 3-man crew\n* 40 mm AP shells may require multiple shots to down enemy tank\n* Ammo rack is directly under the turret and easily set off if hit\n* No access to HE shells\n* Though small, the driver's port is a weak spot\n* Large part of the rear armour is only 17 mm thick despite being sloped\n* Terrible reverse speed\n* Weak to HEAT and APCR shells\n* Its poor speed makes it a perfect target for bombers as it can't escape quickly enough.\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n===Development===\nThe experiences taken from the development of the A9, A10 cruiser tanks and the A11 infantry tank prompted Vickers-Armstrongs to begin development of a new tank. As a private venture, the design did not receive any designations from the British General Staff during its creation. The designing of the tank focused on the tank having the weight of a cruiser, but with the armour comparable to the infantry tanks. The basis was to have the vehicle with 60 mm of frontal armour and a 2-pounder gun in a two-man turret. To make it as light as possible, it was small and featured a cramped interior. The design used features taken from the A9 and A10 tanks so the design was easier to produce and cheaper to make. Vickers unveiled the design to War Office at February 10, 1938. While they initially viewed it unfavourably for its tiny two-man turret, they took it in April 1939 due to the growing tense situation in Europe with Nazi Germany, with the first order coming in May 1940 after the losses suffered by the British Expeditionary Forces in the Battle of France. The name '''Valentine''' was given to the tank sometime between its introduction to War Office and its adoption. The origin of the name is disputed, some say it was due to its introduction on February 14 in 1938 or 1940, other say it was the middle name of Sir John V. Carden, who helped design the Valentine's predecessors. Other sources say it is a name from the Vickers' company full name (Vickers-Armstrong Ltd Elswick & [Newcastle-upon] Tyne), and David Fletcher from Bovington Tank Museum says that \"Valentine\" was a code name used by the company for its development.\n\nThe Valentine was put into service as quickly as possible under the designation \"Tank, Infantry, Mk.III\". Vickers, Metropolitan-Cammell Carriage & Wagon, and Birmingham Railway Carriage & Wagon Company were all involved in the construction of this vehicle. During World War II, Canada was also contracted to build the Valentine to build up their own tank forces. The United Kingdom produced a total of 6,855 Valentines during the war between the three company while Canada built 1,420 Valentine tanks in their factories, for a total of 8,275 tanks produced, making the Valentine the most produced British tank in the entire war.\n\n===Variants===\nThe Valentine is one of the most modified British tank in World War II, up to eleven variants were made during its entire production life.\n\n* [[Valentine Mk I|Mark I]]: The first one, it was built with a rivet construction, a 135 hp petrol engine, and a 2-pounder, but was not sent to combat due to mechanical problems.\n* Mark II: Uses a 131 hp diesel engine and has an auxiliary fuel tank added to the left hull.\n* Mark III: Has a slightly thinner side armour (60 mm to 50 mm) and a modified turret design, giving room for a loader in the tank, freeing the commander to do his job.\n* Mark IV A modified Mk.II using an American 138 hp GMC diesel engine and an American-produced transmission, making the tank more reliable.\n* Mark V: The same as Mk.IV, except using the Mk.III as the basis.\n* Mark VI: A Canadian built Valentine, using Canadian and American parts and a GMC diesel engine, plus later switching the BESA machine gun into a Browning machine gun.\n* Mark VII: A Canadian Mk.VI with a new radio set and a modified interior. Another Mk.VII named the Mark VIIA has jettisonable fuel tanks and new tracks, oil cooler, and headlights.\n* Mark VIII: Uses a British AEC diesel engine and a modified turret to use the 6-pounder. The modification eliminated the coaxial machine gun from the design.\n* [[Valentine Mk IX|Mark IX]]: A Mk.V modified to take the 6-pounder as well, but with an armour reduction. Later version also had a stronger 165 hp GMC diesel engine installed.\n* Mark X: Features another modified turret design using the 6-pounder, but made it able to use a coaxial machine gun again and still uses the 165 hp diesel engine. Uses a welded construction\n* [[Valentine Mk XI|Mark XI]]: The Mk.X using the QF 75 mm gun instead of a 6-pounder, with the 210 hp diesel engine. However, these tanks only served as a command tank in the battlefield. Uses a welded construction\n\n===Combat usage===\nThe Valentine mostly saw service in the North African Campaign, where the crew reported on it very favourable as a reliable and well-protected tank. The first unit who saw action with the Valentine was the 8th Royal Tank Regiment in Operation Crusader, where it was in the process of replacing the [[Matilda III]]. The reliability is expressed when some Valentine were reported to have travelled a distance of 4,800 km by the time the British reached Tunisia. The Valentine tanks soon saw wide-spread use by mid-1941 when they were issued out widely to armoured regiments due to the lack of cruiser tanks available to fill in the ranks.\n\nHowever, the biggest weakness of the Valentine tank is the lack of high-explosive rounds for the 2-pounder, a weakness suffered by every other tank using the 2-pounder. This and the 2-pounder's growing deficiency against tank armour was remedied by the usage of the 6-pounder on the Valentine after the Mark VIII version, and then the QF 75 mm gun. However, these larger guns were harder to mount on the small Valentine turret and made for a cramped interior, even removing the established loader's position made in an enlarge turret for the 2-pounder. By the time these larger guns were introduced for the tank, better tanks were being introduced, such as the [[Churchill Mk III|Churchill heavy tanks]] from Britain and the [[M4|M4 Shermans]] from the Americans. Despite the better tanks, the Valentine's low height is able to exploit small cover on the battlefield and take up a good hull-down position behind hills.\n\nSome Valentines were sent to the Soviet Union as part of the Lend-Lease program, most of the Valentines came from Canada's production lines. The Valentines saw use from the time of Battle of Moscow in 1941 all the way until the end of the war, though the Valentines saw use more as a second-line tank due to its relative weakness. It was criticized for its slow speed and weak gun, but was liked for its small size, reliability, and armour protection and thus the Soviet Supreme Command continue asking for it and its production to continue until the end of the war.\n\nBy 1944, the Valentine is mostly taken out from the front-line services and replaced by the newer tanks. A few were retained for special purposes and command vehicles for [[Archer]] units, which is a tank destroyer based off the Valentine chassis. The tank continue to see use in the Pacific in limited numbers until May 1945 in the 3rd New Zealand Division, some had their armaments changed to the larger 3-inch howitzer to use it stronger high-explosive ammunition against the Japanese. New Zealand kept the normal and modified Valentines all the way until 1955. The last known combat usage of the Valentine was on Cyprus in early 1960s when a turret-less Valentine was used by the Greek militia, added with a make-shift armour and a machine gunner position with a Bren gun.\n\n===Survivors===\nAbout forty Valentines and vehicles based off the Valentine chassis exist in various conditions in the world. Valentines in running condition exist in the Bovington Tank Museum and in private hands in New Zealand and United Kingdom. The Valentines survivors can be seen in UK, Canada, Belgium, France, Russia, Australia, and New Zealand.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=uk_valentine_mk_1 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|4_cJ1CpEatw|'''Best gun depression''' discusses the {{PAGENAME}} at 2:01 - ''War Thunder Official Channel''|k_PBJS8OPLo|'''Valentine Mk. I Tank Review''' - ''NUSensei''|xIrVVhdC9ac|'''Tank Chats #11 Valentine''' - ''The Tank Museum''}}\n\n== See also ==\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/3566-profile-small-slow-and-tough-valentine-mk-i-en|[Vehicle Profile] Small, Slow and Tough: Valentine Mk.I]]\n\n{{Manufacturer Vickers-Armstrongs}}\n{{Britain medium tanks}}"}}