{"title":"ZT3A2","pageid":14588,"wikitext":{"*":"{{Specs-Card\n|code=uk_ratel_zt3\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' is a rank {{Specs|rank}} British tank destroyer {{Battle-rating}}. It was introduced in [[Update \"Ixwa Strike\"]].\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\n[[File:ZT3A2 fragility example.jpg|thumb|right|Even a single lucky hit of a 35 mm KDA cannon can obliterate the ZT3A2, avoid fighting SPAA at any cost]]\nArmour of this vehicle is irrelevant as its launcher is barely protected. The launcher ammunition counts as an active ammo rack, so any ATGM or HE shell detonating next to it will detonate it as well, taking the vehicle out in process. Even hitting the missiles with any MG can cause them to detonate. Even worse, the ammo rack sometimes does not disappear after firing and definitely reappears in the middle of the reload, even though the vehicle cannot fire yet, so the operator must turn the launcher away when attacked. If the launcher is destroyed past that point, the ammo rack will not disappear but reload progress is still reset.\n\nFrontal hull armour might sustain some MG fire from 500 m away, but it has way too many weak spots with 10 mm or even 8 mm RHA protection to be of any use. Unfortunately, the commander of the {{PAGENAME}} cannot take control of the weapon to fire, meaning that literally anything and anyone can disarm the {{PAGENAME}} with a well-placed shot.\n\nBoth commander and gunner are located in the turret, which must be exposed to fire in most cases, which makes this tank very easy to disable if not destroy outright. Sometimes, one of them will survive if tank took a glancing hit of APFSDS, and ammunition is being stored along the sides of the carrier, so with some luck such shells will pass through the entire vehicle without doing any more damage.\n\nOne might argue that the {{PAGENAME}}'s long hull might confuse enemies, but overpressure damage and missile ammo racks placed along the entirety of it make the spaced armour argument irrelevant in most scenarios. Any ATGM landing next to it will instantly destroy it, particularly the ones with 4 kg explosive mass. Missiles with wide splash radius can do fatal damage even by hitting the top of the tree 20 m away from {{PAGENAME}}.\n\nAircraft strafing the {{PAGENAME}} often prefer to fire at it from the top and focus fire in the middle of it, so cannon based airstrike might fail to destroy the {{PAGENAME}}, but any rockets will obliterate the entire hull due to overpressure damage.\n\nArtillery will obliterate this tank even with a 20 m miss and any artillery warning should be a cue to leave for anyone using the {{PAGENAME}}. Sometimes the shells land far enough to only cause minor overpressure damage, but crew will only endure 4 hits at best.\n\nThe {{PAGENAME}} has smoke grenades, but these are outdated old smoke grenades and there is only one group of them. Smoke grenades are launched very high up in turret direction, so it takes 4 seconds for them to hit the ground and then 5 seconds to set in. The smoke screen has holes in it and usually is not enough to provide proper detection protection in AB, unless you park inside of it.\n\nTherefore, the smoke must be used long before the enemy reached your position, not when it is already too late, and should not be relied on in AB. Another way to use them is to launch them at the same time with the ATGM salvo - by the time the carrier runs out of ATGMs, the smoke grenades connect with the ground, concealing the vehicle.\n\n'''Armour type:''' <!-- The types of armour present on the vehicle and their general locations -->\n<!-- Example: * Rolled homogeneous armour (Front, Side, Rear, Hull roof)\n* Cast homogeneous armour (Turret, Transmission area) -->\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || ___ mm || ___ mm ''Top'' <br> ___ mm ''Bottom'' || ___ mm || ___ - ___ mm\n|-\n| Turret || ___ - ___ mm ''Turret front'' <br> ___ mm ''Gun mantlet'' || ___ - ___ mm || ___ - ___ mm || ___ - ___ mm\n|-\n| Cupola || ___ mm || ___ mm || ___ mm || ___ mm\n|-\n|}\n\n'''Notes:''' <!-- Any additional notes which the user needs to be aware of -->\n<!-- Example: * Suspension wheels are 20 mm thick, tracks are 30 mm thick, and torsion bars are 60 mm thick. -->\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\n\nIn arcade battles, the stock {{PAGENAME}} drives at 30-40 km/h offroad and 60-77 km/h on dirt roads. When using paved road, it will accelerate towards 100 km/h instead. An upgraded {{PAGENAME}} does not drive much faster due to the engine only working at 1,700-2,000 RPM almost all the time, but it will reach 40 km/h almost as fast as it reached 30 km/h before and will reach its top speed on paved roads far more reliably. The maximum speed limits do not really change at all.\n[[File:ZT3A2 Climbed impossible spot and sniped.jpg|thumb|right|Arcade mode: a ZT3A2 climbed an impossible mountain spot in order to deny enemy access to C point.]]\nThe {{PAGENAME}} tends to have a lot of momentum in its movement and will keep its speed for some time after going offroad, but also should be driven carefully to avoid losing speed by accidentally ramming something. Its mass is also not enough to plow through thick trees, so they must be avoided. When reaching maximum possible speed, the engine starts whining really loudly and the vehicle will start to shake, so turning becomes risky.\n\nThis tank also has an uncanny ability to drive uphill at very sharp angles, which may slow it to 5 km/h but won't stop it entirely. This, combined with \"Tires\" upgrade, allows it to climb even certain mountains. The tank can also easily climb rocks and other objects, which tend to be impossible for regular tanks to get over. Unfortunately, this ability is rarely of any use in RB due to its low camera depression, so it is mostly used in AB to sneak shots into players not expecting a missile tank firing from weird positions.\n\n{{tankMobility|abMinHp=401|rbMinHp=249}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\nResearching \"Horizontal Drive\" might make controlling missiles in RB slightly easier and will allow the user to respond to sudden flank attacks, but \"Parts\" should be researched first. Research \"Brakes\" instead of FPE to improve the {{PAGENAME}}s ability to fire fast. \"Elevation mechanism\" in theory could help, but isn't necessary and can be skipped. Research \"Tandem missile\" as soon as possible, as it will help fight tanks of higher BR. Mobility upgrades might make the {{PAGENAME}} faster, but their usefulness is very limited, with \"Tires\" and \"Engine\" bringing the most noticeable benefit. \"Smoke grenades\" might help the {{PAGENAME}} to survive in between reloads or if it got caught in a crossfire, so it might be a good idea to research them first instead. \"Laser rangefinder\" is only really useful to see if the enemy is within the missile attack range, but it will also trigger laser warnings and is useless in AB, so it can be researched last.\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|ZT3}}\n\nThere are two main missiles on the {{PAGENAME}}, The ZT3A1 and ZT3A2. Both missiles are laser-guided, which makes them immune to jamming by IRCM and allows the carrier to guide them all at once. Both missiles have reasonably strong vertical drive and rather sluggish horizontal drive, allowing operator to quickly shift them around, as long as they do not try to change their flight direction entirely. These missiles also can cause overpressure damage through more RHA than would be expected from a normal HEAT warhead, meaning they can destroy many medium tanks by hitting their turret's rooftop.\n\nThe missiles are loaded in magazines of 3 missiles with 4 magazines or 12 missiles total. They aren't reloaded if the launcher is damaged. Each shot forces a 0.6s reload. Missiles fire off in order from the right to the left. Missiles struggle to take off and initially take vertical stance, sometimes even obscuring the gunner vision, so attempts to launch them downward while having the launcher peek over an object is likely to make them explode on launch.\n\nIn AB/RB the guiding \"camera\" is located in the launcher, which means that it can fire and guide straight after exposing the launcher. In SB, missiles are guided by gunner's optics under the launcher, which means that the hull must also be exposed.\n\nThe ZT3A1 can be treated like a [[MILAN 2]] with 40 more km/h speed on it. It often fails to break through light tanks and will only destroy ERA screens, but not break through them in most cases. Regardless, they are still very strong and there are 3 of them at once, so it is possible to destroy an entire tank squad if they are not paying attention to their surroundings. They can cause overpressure through 20 mm RHA, which means it can destroy [[Leopard_1_(Family)|Leopard]] by hitting the top of its roof. \n\nThe ZT3A2 has a tandem warhead, which allows it to penetrate one obstacle (primarily, ERA of Soviet or French tanks) without wasting the HEAT payload, and it in general has more penetration than all of the rank VI ATGMs, easily breaching and obliterating any tanks they land on. Unfortunately, some light tanks like the [[TAM]] can still somehow survive a direct hit, so aiming at weak spots is still recommended. This missile can cause overpressure through 30 mm RHA, so even many Soviet tank roofs aren't safe from it, so even if they hide the hull they are still an easy target.\n\nBoth missiles are easier to aim by using sniper scope, even in arcade mode and at point blank range, as sniper scope makes it easier to see missile position via light it emits onto ground and thus easier to force them to fall into enemy cover.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[ZT3]] missile || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity (Belt) !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 12 (3) || rowspan=\"2\" | -5°/+15° || rowspan=\"2\" | ±180° || rowspan=\"2\" | Two-plane || 35.2 || 48.8 || 59.2 || 65.5 || 69.7 || rowspan=\"2\" | 19.50 || rowspan=\"2\" | 17.25 || rowspan=\"2\" | 15.90 || rowspan=\"2\" | 15.00\n|-\n! ''Realistic''\n| 23.8 || 28.0 || 34.0 || 37.6 || 40.0\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| ZT3A1 || ATGM || 650 || 650 || 650 || 650 || 650 || 650\n|-\n| ZT3A2 || ATGM (tandem) || 1,000 || 1,000 || 1,000 || 1,000 || 1,000 || 1,000\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"11\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Range<br>(m)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| ZT3A1 || ATGM || 240 || 4,000 || 26 || 0 || 0.01 || 3,580 || 80° || 82° || 90°\n|-\n| ZT3A2 || ATGM (tandem) || 220 || 5,000 || 28.5 || 0.4 || 0.01 || 3,580 || 80° || 82° || 90°\n|-\n|}\n\n==== [[Ammo racks]] ====\n<!-- [[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]] -->\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''4''' || __&nbsp;''(+__)'' || __&nbsp;''(+__)'' || __&nbsp;''(+__)'' || __&nbsp;''(+__)'' || __&nbsp;''(+__)'' || __&nbsp;''(+__)'' || __\n|-\n|}\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|Browning MG4 (7.62 mm)}}\n\nThis MG fires way too slowly to be of any combat use, but if the {{PAGENAME}} is attacked by a hostile ATGM carrier, it should be fired at the incoming missiles with an about 5% chance of shooting them down mid-air.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[Browning MG4 (7.62 mm)|7.62 mm Browning MG4]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Pintle || 2,000 (250) || 500 || -10°/+20° || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\n\n'''Arcade mode'''\n\nIt can be used on a map with a road leading off your spawn towards capture point to quickly take over a strong defensive position. Do note, that it will only reach maximum speed if uses asphalt road and it might need a head start for that anyway. Any position that enemy has to attack into and cannot attack indirectly is worth taking over like this. For example, on the map \"[[Middle East (Ground Forces)|Middle east]]\" it can rush into north capture point and fall down into cover of a bunker or change direction to drive behind a building to avoid being sniped. This position is well protected, and also allows it to abuse simplified AB ATGM controls to deny any access to the capture point for the enemy team, as it has strong vertical missile control and can snipe attacking enemy tanks by just pointing sniper scope at them after firing out and over cover.\n[[File:ZT3A2 lean on a mountain to land a shot.jpg|thumb|right|If it's difficult to aim from the low ground due to the LOS limitations, or there are roadblocks in the way, remember to use the carrier's climbing abilities. This might even make some shots possible in RB.]]\nIt can also be used to drive to the side of attacking enemy to sneak shots into them. You can also do this in more provocative manner by hiding behind buildings next to them, but be aware that you then have to rely on your team to act as a distraction and you should avoid being seen and especially avoid or destroy light tanks to not get unnecessary attention. While sneaking in AB is difficult, it is still rather easy to sneak upon Soviet players and heavy tanks in general as long as you understand the game mechanics. Do note, that in AB the {{PAGENAME}} does not have the constraints of \"gun depression\" and is able to fire off any kind of ground spikes, therefore it might be a good idea to climb any weird ground formation or rocks if it allows you to fire over buildings or other enemy cover, or at least give you a second before the enemy can process what is going on and react. In case enemy light tanks with chemical weapons did spot you, it's often possible to still beat them by hiding behind destructible building, waiting for them to pull out of cover to stare at you, then unloading the entire magazine onto them through your own cover, instead of going around it. This kind of move is considered pure insanity for the tanks with just one or two weapons, but not for 3-shot magazine of the ZT3A2, since even after your cover is gone, you still have one or two shots to destroy any opponent jumping in for a free kill.\n\nThere is also a possibility of using the {{PAGENAME}}'s tall profile to fire over or through the openings of indestructible buildings at the tanks standing on the other side, for example big tall windows of churches, which can allow you to capture a point with minimal effort. It is also possible to fire through some street corners, as many of them have little openings and cracks which are often overlooked, such as ones on south side of [[Port Novorossiysk]] domination mode, when there can be at least 6 tanks waiting for you to rush them, but not noticing a very little window next to them which you can fire through. This tactic is usually successful, as at close range it is impossible for regular tanks to fire back, and at long range your launcher is such a small target, only a specialist will be able to notice and hit you back. Be careful with the missile launching pattern, as to not hit your own cover. Do not forget that the ZT3A2 can destroy many medium tanks by hitting their commander cupola, so it's not necessary to even engage them directly most of the time.\n\nIt can be easily used as a sniper tank, with main advantage of it being able to destroy an entire tank group almost simultaneously or obliterate enemy cover with first missile, which is immediately followed by another two hitting their turret and hull. Multiple missiles can be sent over cover if target managed to survive the first hit as well. Likewise, it is possible to just send all 3 missiles through forest in hopes that they will be able to brute force the foliage and hit enemy tanks anyway. It is also possible to drive missiles into enemy ATGM tanks over hills when they are reloading, but it might be too difficult to time correctly, unless missile is guided next to the ground and you keep its position by tracking the light it emits onto the ground. Remember to immediately hide after such attacks and in general fire into enemy tank sides to avoid being countersniped.\n\nIn any case be very wary of your reload timings - locate targets, gain as much of unfair advantage over them, like tall cover you can fire over and they cannot, as possible, then fully commit to your attack when they seem to lose focus. Each shot forces a 0.6 second \"reload\" and in that time you must point missile on your first target and decide who needs to be destroyed next, then fire next missile. If the enemy group is very spread out, guide each missile till the very end and focus on enemies which clearly noticed that they are being attacked and start turning towards you. After firing three shots, back off into cover before anyone decided to fire back. If enemy managed to destroy the launcher, turn around and make a complete retreat, especially if it was already empty, as repair will take at least 5 seconds and reload after this will take from 15 to 20 seconds, making you unable to recover from that kind of damage fast enough.\n\nOverall, in AB the {{PAGENAME}}'s efficiency depends on a lot of factors outside of players control - if everyone will focus on it, you will not be able to do much, especially from long range, as it takes just one or two good hits of virtually any weapon to destroy the {{PAGENAME}}, but you should be already used to play around enemy with aim assist at this point.\n\n'''Notable enemies'''\n\n* Proximity missile carriers: avoid gaining attention of the [[M3A3 Bradley]], [[CM25]] and the [[Dardo]] since their missiles can explode in proximity of enemy tanks and the {{PAGENAME}}'s armour is too thin to survive overpressure damage. Locate and destroy them immediately, if you can, or run very far away, as simple cover of a hill or a wall won't save against them. If forced to fight them head-on (preferable in AB only): ensure that your launcher is fully loaded, position yourself as far away from them as possible and put the hull low behind cover to avoid being obliterated by a gun, but high enough to be visible. Natural reaction to this for most such light tanks is to start spamming ATGMs at you, this is where the 3-shot magazine of the ZT3A2 comes into play. Since proximity missiles have the tendency to react to anything they fly next to, your answer should be firing a missile of your own. Once they are out of ammo, drop the third shot straight into their turret or run.\n\n* Wheeled light tanks: the ZT3A2 is on average two times slower than light tanks on wheels at the same rank due to its negligible offroad speed, as it averages at a speed of a fast medium tank or slower light tanks even with the best player effort. It is too likely to meet a player, that can and will fire their guns while driving at a full 90+ km/h, but maybe you will be able to do an emergency stop and destroy them (or at least destroy eachother). It is even more likely to meet 4 of such tanks already standing next to a capture point that you were intending to attack, so don't be overconfident and be careful with rushing attacks into capture points with lots of low cover (which the ZT3A2 can't use as it's too tall). Do not act as if you are the only person who can rush, as otherwise the ZT3A2 will get gunned down before even doing anything, since it can't fire on the move.\n\n* [[XM-1 (GM)]]: this tank has NERA screen in the turret, and is as fast as a light tank. Try to hit it in the hull or at least angle the missile down before it lands on the turret, if you use the default missile. Tandem missile should be able to penetrate it regardless. Avoid engaging it directly, as it has way too many machine guns.\n\n* [[IT-1]]: This tank is more dangerous than it seems, as it can fire on the move and is difficult to hit. Try to not park next to trees or walls when fighting it to avoid being overpressured. Fortunately, due to the insane overpressure damage of the ZT3A2, it is possible to destroy IT-1 by hitting its missile or the fake panel on the turret's front that allows it to reload, as it's only 25 mm thick. Therefore, it's best to attack when IT-1 is about to reload - since their missile rack does not explode from damage, they are often very arrogant and are unlikely to try and dodge your shot, instead they will move in to fire. Another opportunity to hit them is to fight them over a hill and abuse strong vertical drives of your missiles to hit them as they retreat, but it's less feasible in RB/SB.\n\n*[[T-55AMD-1]]: this tank is a real headache, as if it is looking in your direction, this means that it can shoot down 8 of your ATGMs with its active protection system. There are at least 2 guns with 2 shots each covering each 20 degrees in front of the turret, which means that you cannot simply overload it in a single attack. Fortunately, the protection arc is quite narrow, its reaction time is not great, and it seems to have blind spots. Generally, the system shoots down missiles high in the sky, but sometimes fails to hit missiles that go along the ground, and it will fail to stop any missiles suddenly appearing from behind an obstacle. Because of that, avoid fighting the tank over long range frontally, especially if its user is not afraid of you and doesn't duck into cover, because it will just drain all of your ammunition for free. Instead, make them fall into a false sense of security and bait the tank out of cover then bombard its side with slingshots or wait until it gets closer to hit it into hull as it tries to assault you. If forced to fight head-on, attempt to hit its turret exactly when it leaves cover. Even if its commander will suspect foul play and always turn the turret towards you, the active protection should not be able to shoot down the missile it only saw for a fraction of a second.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Is able to use tandem missiles, which penetrate ERA at almost any angle of attack and also have a chance of penetrating the [[IPM1]]'s turret frontally if user controls them well\n* Missiles can cause overpressure damage through more armour than normal HEAT ATGM, meaning it's possible to destroy tanks by hitting their cupolas, even if they try to avoid fighting you \n* Has a three-shot launcher, which is a step down from the [[Striker]], but it can guide all three missiles simultaniously\n* Missiles are immune to jammers\n* Can relocate fast on maps with a lot of paved roads after having researched mobility upgrades and often can get to the advantageous position in the beginning of the match before being sniped\n* Missiles have reasonable vertical mobility, though this is often irrelevant in RB due to mediocre camera depression\n* While clumsy, the {{PAGENAME}}'s chassis are able to climb at very sharp angles (60-70 degree inclination even when stock in AB) and it can get on top of certain objects the [[Striker]] or other ATGM tanks would not be able to climb\n* Tall profile allows it to fire directly over certain cover which other tanks normally see as a full cover or an indestructible wall, for example, destroyed building debris, cargo containers or a church, potentially surprising some enemies\n\n'''Cons:'''\n\n* Missiles do not turn well in horizontal plane and are especially unresponsive in RB\n* Vertical depression is not too great on the launcher, and missiles tend to crash into the carrier's own cover, which can limit launch options from high ground in RB or at point blank range in any mode (not as much of an issue in AB)\n* In SB, the hull must be exposed to make a direct shot and almost any responding shot to the top of the hull will destroy weapon, ammo rack, or enough crew to count as crew knockout, even a single glancing hit from [[ZSU-57-2]] may be enough. In AB/RB it still have to be careful, as any direct hit to the missiles will make them explode the carrier\n* Slow when drives offroad and in general drives more like a bus rather than a tank or a regular armoured car\n* Must make a complete stop to fire, which makes it incapable of fighting any kind of light tanks or SPAA directly\n* Missiles are only 20-40 m/s faster than MILAN and hostile ATGM tanks generally use missiles that are 2 to 5 times faster, SAM tanks can even make a very late response and still win the duel\n* Reloads only after spending all three shots (but reloads all three at once), does not automatically reload during rearm like the [[Striker]]\n* Has obsolete smoke grenades and only has one group of them\n* Too tall to drive under bridges on most maps (on some maps, cannot attack a capture point with others)\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\n\n=== [[wt:en/news/7059-development-ratel-zt3-a2-the-sharpshooting-honey-badger-en|Devblog]] ===\nIn the early 1960s, the South African military already identified the need for anti-tank missile capabilities. Subsequently, this led to South Africa procuring the MILAN ATGM in the early to mid 1970s. However, early use experience with the MILAN highlighted the weapon's unsuitability for the African tropical conditions.\n\nBeing a wire-guided missile, the MILAN's control wire had a tendency to get caught up in the thick African bush and get severed, causing the missile to go off target and making engaging moving targets even more challenging. As a result, the decision was made to procure a laser-guided missile. However, as international arms embargoes were imposed on South Africa, simply acquiring an existing weapon off the export market wasn't possible. Therefore, South African engineers at the Kentron company went about designing their own laser-guided ATGM in the late 1970s.\n\nThe result of this undertaking was the creation of the ZT3 missile system. By the time the ZT3 system had been ready for production in 1986, plans were being drawn up for a modified Ratel 20 housing the newly developed ZT3 missile launcher in a modified  Ratel 60 turret. The modified Ratel with the ZT3 missile system was developed in order to supplement the Ratel 90s in anti-tank operations as the latter often struggled to engage heavy armour in direct combat.\n\nThe Ratel ZT3-A1 entered production in 1987 and around 90vehicles of the type had been built by 1993. The ZT3-A2 was introduced in 2008 and continues its successful operation with SANDF units till the present day.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=uk_ratel_zt3 Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Images\n<gallery mode=\"packed\" heights=\"150\">\nFile:Ratel ZT3-A2 WTWallpaper 01.jpg|\nFile:Ratel ZT3-A2 WTWallpaper 02.jpg|\nFile:Ratel ZT3-A2 WTWallpaper 03.jpg|\nFile:Ratel ZT3-A2 WTWallpaper 04.jpg|\nFile:Ratel ZT3-A2 WTWallpaper 05.jpg|\nFile:Ratel ZT3-A2 WTWallpaper 06.jpg|\nFile:Ratel ZT3-A2 WTWallpaper 07.jpg|\n</gallery>\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n* [[Ratel (Family)]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/7059-development-ratel-zt3-a2-the-sharpshooting-honey-badger-en|[Devblog] Ratel ZT3-A2 - The Sharpshooting Honey Badger]]\n\n{{TankManufacturer Sandock-Austral}}\n{{Britain tank destroyers}}\n\n[[Category:Wheeled ground vehicles]]"}}