{"title":"ZTZ99-III","pageid":16490,"wikitext":{"*":"{{About\n| about = Chinese MBT '''{{PAGENAME}}'''\n| usage = other versions\n| link = ZTZ99 (Family)\n}}\n{{Specs-Card\n|code=cn_ztz_99_w\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' The text within these arrows are not to be deleted -->\nThe '''{{Specs|name}}''' (WZ123B) is a rank {{Specs|rank}} Chinese medium tank {{Battle-rating}}. It was introduced in [[Update \"Direct Hit\"]].\n\nAn overhaul upgrade of the older [[ZTZ99-II]], the ZTZ99-III (Stage 3) retained the same firepower, sufficient mobility and tough frontal armour while eliminating some of the design flaws in the previous design. It might not be the top-notch MBT to be utilized, but the ZTZ99-III still provides a reliable top-tier lineup for the Chinese tech tree and a valuable upgrade for its older brother.\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' The text within these arrows are not to be deleted -->\nThe major difference between the ZTZ99-II and III is the placement of ERA blocks up the front and side of the turret, where a wave board is presented on Stage III's UFP to deflect water waves in case for river crossing operations; the turret is also redesigned into a welded one, eliminating the bulged part of the turret and thus increasing the survivability of the turret crew. But unfortunately, some flaws still existed in Stage III.\n\nLike the [[T-80U]], the ZTZ99-III continues to use both composite armour and advanced ERA with kinetic protection. Composite armour is present on the turret cheeks and on the upper glacis; it is unremarkable by itself, but the areas with full coverage of both composite armour and FY-4 ERA are even capable of resisting the [[Leopard 2A6]]'s DM53 APFSDS. Unfortunately, these areas are limited to the turret cheeks and lower portion of the upper glacis. Interestingly, the ERA is resistant to tandem-charge warheads, which allows it to withstand ATGMs that other ERA equipped vehicles can't.\n\nThere are plenty of weak spots on the hull. First, the lower glacis has no composite armour or ERA whatsoever and can be penetrated by practically anything, and it also is proportionally larger than on Soviet MBTs. Penetrating shots there have a large chance of detonating the ammo in the autoloader and destroying the tank. The upper glacis composite armour is modeled with a large cutout for the driver's optics, as on the Soviet T-64/72 series, and even the FY-4 ERA there is not enough to save it from powerful APFSDS. Some small portions of the upper glacis are not covered by ERA either.\n\nThe turret has its fair share of weak spots as well. The gun mantlet area has no composite armour and penetrating shots will usually take out the gun breech and possibly a crew member. There is a cutout in the ERA array on the left cheek to allow the driver to enter and exit the tank that reduces the protection there. Thanks for the redesign of the new turret, the ZTZ99-III eliminated the bulged, cast part of the turret and thus increasing the survivability of the turret crew; it might still be penetrated by some shells but those are in rare cases.\n\nThe ZTZ99-III does not have any ERA on the hull sides and the base hull side armour of 50 mm is thinner than Soviet MBTs, so be careful of IFVs with autocannons. Successful hits to the side will usually total the tank, either detonating the ammo racks or knocking out the turret crew.\n\nThe ZTZ99-III's armour protection has enough gaps that it can be considered \"trolly\" as opposed to \"well-protected\", but the areas that are well-protected are very strong. It's best to stay at long range and utilize the ZTZ99-III's low profile in conjunction with cover to make it difficult for enemies to hit the weak spots. Putting some bushes near the driver's hatch or gun mantlet might help. Remember that ERA is destroyed upon absorbing fire and the composite armour alone does not have sufficient protection for a top-tier vehicle.\n\nAs a last note, the GL-7 laser dazzler is physically modeled on the left side of the turret roof as a laser rangefinder, but its countermeasuring capabilities are not implemented.\n\n'''Armour type:'''\n\n* Rolled homogeneous armour (hull, turret cheeks, turret roof, cupolas)\n* Cast homogeneous armour (turret, gun mantlet)\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || 20+80 mm (70°) ''Upper front'' <br> 80 mm (60°) ''Lower front'' || 80 mm ''Top'' <br> 20 mm (21°) ''Bottom'' || 45 mm (10°) ''Upper plate'' <br> 45 mm (45°) ''Lower glacis'' <br> 20 mm ''Engine vent'' || 20+80 (20°) ''Front glacis'' <br> 30 mm ''Driving compartment'' <br> 20 mm ''Engine compartment'' <br> 5 mm ''Engine vents''\n|-\n| Turret || 220 mm ''Turret front'' <br> 310 mm ''Gun mantlet'' || 80 mm (volumetric) || 35 mm || 30-50 mm\n|-\n| Cupola || colspan=\"3\" | 45 mm (cylindrical) || 35 mm\n|-\n|}\n{| class=\"wikitable\"\n! Composite armour !! Frontal effective protection\n|-\n| Hull || '''Upper glacis:''' <br> mm ''Kinetic'' / mm ''Chemical''\n|-\n| Turret || '''Turret front:''' <br> mm ''Kinetic'' / mm ''Chemical''\n|}\n{| class=\"wikitable\"\n! FY-4 Explosive reactive armour !! Front (Slope angle) !! Sides\n|-\n| Hull ||'''Upper glacis:''' <br> 140 mm ''Kinetic''/ 450 mm ''Chemical''\n!\n|-\n| Turret || 140 mm ''Kinetic''/ 450 mm ''Chemical'' || 50 mm ''Kinetic'' / 350 mm ''Chemical''\n|-\n|}\n'''Notes:'''\n\n* Suspension wheels, tracks, and torsion bars are 20 mm thick.\n* Side skirts are 8 mm thick.\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' The text within these arrows are not to be deleted -->\nThe ZTZ99-III's mobility is still below average for a top rank vehicle. Although it has a sizeable 1,200 horsepower NORINCO Shaanxi Diesel 12V150HB diesel engine, which is comparable to the [[T-80U]]'s 1,250 hp gas turbine engine and among the most powerful Eastern Blog diesel engines. The tank itself also weighs more than 50 tons, which approaches the weight of the [[Leopard 2A4]] and [[M1 Abrams]]. Among contemporaries, the power-to-weight ratio is better than the [[Challenger 2]] and comparable to the [[Ariete PSO]] or [[T-72B3]]. Though it is quite fast in a straight line, it does need a considerably long time to pick up speed especially when stock or across rough terrain. It also does not have neutral steering due to the design of transmission, and the reverse speed of -5 km/h is truly abysmal. The ZTZ99-III can get into battle reasonably quickly but does not excel at flanking and will struggle to retreat from sticky situations.\n\n{{tankMobility|abMinHp=1860|rbMinHp=1061}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' The text within these arrows are not to be deleted -->\n{{main|ZPT98 (125 mm)}}\n\nThe ZPT98 cannon is a 125 mm smoothbore cannon with an autoloader, much like the 2A46 cannon used by the T-72 or the Type 88C cannon used by the ZTZ96, but it is 50 calibres long instead of 48. The reload speed of 7.1 seconds is the slowest of any top-rank vehicle, so destroying or crippling enemies in one shot is important. The gun handling is the same as the ZTZ96 series, being slightly better than most Soviet MBTs barring the [[T-72B3]] but still lower than most Western MBTs.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[ZPT98 (125 mm)|125 mm ZPT98]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 39 || rowspan=\"2\" | -5°/+13° || rowspan=\"2\" | ±180° || rowspan=\"2\" | Two-plane || 28.6 || 39.5 || 48.0 || 53.1 || 56.5 || rowspan=\"2\" | 7.10 || rowspan=\"2\" | 7.10 || rowspan=\"2\" | 7.10 || rowspan=\"2\" | 7.10\n|-\n! ''Realistic''\n| 17.9 || 21.0 || 25.5 || 28.2 || 30.0\n|-\n|}\n\n==== Ammunition ====\nSince the ZTZ99-III is an upgraded ZTZ99-II with some redesigned appearance but not in terms of firepower, both share the same ammunition.\n\nThe stock DTP-125 HEATFS round has the typical penetration of 480 mm shared by Western MBTs with 120 mm guns, but this is not enough to deal with tanks with composite armour, which are the norm at the ZTZ99's battle rating. The post-penetration damage is also disappointing. Only use it as an interim shell before APFSDS is unlocked. With 2.19 kg of explosive mass, it is sometimes capable of knocking out light targets like SPAAs and light tanks with overpressure damage, so keep an eye out for those.\n\nThe stock DTB-125 HE shell is one of the strongest of any top-rank MBT. It can actually cause more damage to MBTs than the HEATFS round if fired at turret rings, hull roofs, and turret cupolas, especially with overpressure damage. Well-placed impacts have a good chance of transmitting the shockwave into the crew compartment and knocking the target out instantly, even against the toughest MBTs like the [[Leopard 2A6]]. It helps to keep a few HE rounds around even after APFSDS is unlocked as they excel at causing pressure damage to light targets.\n\nThe ZTZ99-III also has access to the GP125 tandem ATGM, which performs identically to its Soviet counterpart. If players find their darts are not effective against well-armoured targets, the sufficient velocity and penetration can ruin the day of such vehicles, as well as helicopters if they don't evade the incoming missile.\n\nThe 125-I APFSDS round is a Tier 1 modification. Though it first appeared on the [[ZTZ96]], it is still a decent option for the ZTZ99 and eases the stock grind considerably. It has very similar flat penetration and superior angled penetration to the 3BM42 \"Mango\" round used by Soviet tanks and can penetrate most contemporary opponents through at least the lower front plate and gun breech.\n\nWaiting as a tier 4 modification is the DTC10-125 APFSDS round, a high mass and high velocity shell with only slightly worse performance compared to 3BM60 on the [[T-80BVM]]. This will be the go-to round for the ZTZ99-II and most targets at the rank are unlikely to withstand a penetrating shot from this shell.\n\nDTB12-125 is also available as a tier 4 modification; this is one of the few HE-VT shells available for a top-tier MBT. This shell turns ZTZ99-II into a 125 mm anti-aircraft gun thanks to its generous explosive filler, any aircraft that are within its 7 m trigger radius will not have a good day. Although it has lesser explosive content, the VT fuse is not triggered by ground vehicles so it can serve as an alternative to the stock HE-FS as well.\n\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| DTP-125 || HEATFS || 480 || 480 || 480 || 480 || 480 || 480\n|-\n| DTB-125 || HE || 45 || 45 || 45 || 45 || 45 || 45\n|-\n| 125-I || APFSDS || 466 || 464 || 458 || 450 || 442 || 434\n|-\n| DTC10-125 || APFSDS || 577 || 575 || 566 || 555 || 544 || 533\n|-\n| GP125 || ATGM (tandem) || 850 || 850 || 850 || 850 || 850 || 850\n|-\n| DTB12-125 || HE-VT* || 43 || 43 || 43 || 43 || 43 || 43\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| DTP-125 || HEATFS || 905 || 18 || 0.05 || 0.1 || 2,190 || 65° || 72° || 77°\n|-\n| DTB-125 || HE || 850 || 23 || 0 || 0.1 || 5,460 || 79° || 80° || 81°\n|-\n| 125-I || APFSDS || 1,730 || 4.02 || N/A || N/A || N/A || 78° || 80° || 81°\n|-\n| DTC10-125 || APFSDS || 1,770 || 4.85 || N/A || N/A || N/A || 78° || 80° || 81°\n|-\n| DTB12-125 || HE-VT* || 850 || 23.2 || 0 || 0.1 || 5,300 || 79° || 80° || 81°\n|-\n| GP125 || ATGM (tandem) || 400 || 17.2 || 0.4 || 0.01 || 4,720 || 80° || 82° || 90°\n|-\n|}\n\n==== [[Ammo racks]] ====\n<!-- [[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]] -->\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! Ammo<br>part\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! 7th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''39''' || ''Projectiles<br>Propellants'' || 37 ''(+2)''<br>39 ''(+0)'' || 34 ''(+5)''<br>38 ''(+1)'' || 31 ''(+8)''<br>37 ''(+2)'' || 27 ''(+12)''<br>28 ''(+11)'' || 23 ''(+16)''<br>26 ''(+13)'' || N/A<br>23 ''(+16)'' || 1 ''(+38)''<br>1 ''(+38)'' || No\n|-\n|}\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n{{Specs-Tank-Weapon|3}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' The text within these arrows are not to be deleted -->\n{{main|QJC88A (12.7 mm)|Type 86 (7.62 mm)}}\n\nSame as the ZTZ99-II, Stage III has both a turret HMG and coaxial LMG; the HMG can be used in case of any potential low-flyers and helicopters which are too close to your proximity, it can do short work of them, this also applies to any poorly armoured light vehicles in higher ranks as these ceramic core shots can shatter them with relative ease.\n\nWhile the coaxial gun is only good for range-finding and disturbing enemies, it can also do short work of any exposed crew or sometimes even surprise kill on helicopters.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[QJC88A (12.7 mm)|12.7 mm QJC88A]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Pintle || 500 (150) || 700 || -5°/+60° || ±180°\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[Type 86 (7.62 mm)|7.62 mm Type 86]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 2,500 (250) || 700 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' The text within these arrows are not to be deleted -->\nSince there weren't any firepower improvements between ZTZ99 Stage II and Stage III, the playstyle of ZTZ99-III is very similar to its predecessor.\n\nThe ZTZ99's main weaknesses are poor mobility characteristics and inconsistent protection, so to mitigate these, it is best used as a sniper or midfielder. Carefully move up to positions that offer cover and a good view. Once in position, the ZTZ99's strengths can be put to good use. The laser warning system and high-quality thermal sights for the commander give the ZTZ99 a large degree of situational awareness, allowing enemies to be spotted and engaged quickly. Try to attack enemies from a distance and while they are in the open, the variable 6x-11x gun sight will help in searching for targets at longer ranges; in this situation they will have difficulty targeting the weak points of the ZTZ99 while the ZTZ99 typically only needs to shoot their hull when using the top DTC10-125 APFSDS. The DTB12-125 HE-VT and GP125 tandem ATGM are also at your disposal in case of any incoming aircraft or more sturdy targets. Be aware of the slow reload, which is up to 50% slower than other top MBTs. If a target is still capable of returning fire after being hit (e.g. gunner, gun breech, turret drive are intact), it might be better to move to cover and wait for teammates to distract or attack them. Although the ZTZ99 has a sufficient top speed, it is not among the top-notch at top rank; it might struggle especially in urban environments when changing position or flanking enemies. Move up when the coast is clear but do not overextend, it is difficult to back out from a bad position due to the bad reverse speed.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' The text within these arrows are not to be deleted -->\n\n'''Pros:'''\n\n* Sturdy frontal armour on turret cheeks and upper glacis, can withstand most APFSDS shells\n* The new welded turret eliminated the previously bulged weak spot on the turret and further enhanced its protection over [[ZTZ99-II]]\n* Gunner and commander thermals with sufficient resolution are very useful to spot targets\n* Variety of shells ranging from high-penetration darts, devastating HE(-VT) shells and gun-launched ATGM\n* Silhouette is quite low, allowing it to conceal itself behind cover or vegetations\n* Has laser warning receiver which can inform the player that they are being targeted\n\n'''Cons:'''\n\n* Weak spots in the armour: driver's port, lower glacis, and gun mantlet. Can be penetrated by lower-ranked tanks\n* Extremely slow reverse speed of -5 km/h won't get it out of danger quickly\n* Thin side armour, can be penetrated by IFVs (e.g. Type 89) and aircraft\n* Frontal turret ERA are in large pieces, which will leave larger holes once destroyed\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nAfter the commission of [[ZTZ99-II]] (WZ123 or ZTZ99 Mod. 2003, 99一期改, ZTZ99 \"二类定型状态\" in game; erroneously known as 99G), Factory 617 kept on revising the design and eliminated some of its design flaws, such as replacing the bulged cast turret with a brand new welded turret, as well as re-positioning the existing applique armour of turret front and lengthening the side ones; the UFP was also redesigned to fit FY-4 in a more reasonable positioning. It was then finalized just a year later and in the 60th Anniversary of the Establishment of PRC in 2009, the new ZTZ99-III (WZ123B or ZTZ99 Mod. 2004, 99二期改, ZTZ99 \"三类定型状态\" in game; erroneously known as 99A1) showed up as the leading column of vehicle phalanx (numbered 01-01 to 01-18 from 334th Regiment, 112th Mechanized Infantry Brigade, 38th Army Corps), serving as the new spearhead of PLAGF elite armoured brigades.\n\nEventually, just a year later; a titular successor of ZTZ99-III - the completely redesigned ZTZ99A (WZ1001; erroneously known as 99A2), passed state certification and in mid-2010s, it started to replace ZTZ99-III as the most advanced vehicle of PLAGF and served in elite armoured brigades in Northeastern China.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n\n* [https://live.warthunder.com/feed/camouflages/?vehicle=cn_ztz_99_w Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|rjFVRzWnvh8|'''The Beast Becomes Balanced - ZT99-III''' - ''JustinPlaysYT''}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n\n; Other vehicles of similar configuration and role\n\n* [[T-72B3]]\n* [[T-80U]]\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/7284-development-new-top-tier-ztz99-iii-and-pre-order-for-a-5c-en|[Devblog] New top-tier ZTZ99-III and pre-order for A-5C]]\n\n{{TankManufacturer Norinco}}\n{{China medium tanks}}\n[[Category:ATGM vehicles]]"}}