{"title":"ZTZ99A","pageid":18681,"wikitext":{"*":"{{About\n| about = Chinese MBT '''{{PAGENAME}}'''\n| usage = other versions\n| link = ZTZ99 (Family)\n}}\n{{Specs-Card\n|code=cn_ztz_99a\n|images={{Specs-Card-Image|GarageImage_{{PAGENAME}}.jpg}}\n}}\n\n== Description ==\n<!-- ''In the description, the first part should be about the history of the creation and combat usage of the vehicle, as well as its key features. In the second part, tell the reader about the ground vehicle in the game. Insert a screenshot of the vehicle, so that if the novice player does not remember the vehicle by name, he will immediately understand what kind of vehicle the article is talking about.'' -->\nThe '''{{Specs|name}}''' (ZTZ99A式主战坦克; coded WZ1001) is a rank {{Specs|rank}} Chinese medium tank {{Battle-rating}}. It was introduced in [[Update \"Danger Zone\"]].\n\nEnd-of-the-line PLAGF MBT and the second-newest PLAGF tank in service, the ZTZ99A ditched the Warsaw Pact-style low profile design and opted for a larger turret and a new powerpack, while retaining similar protection to the preceding [[ZTZ99-III]]. With all the new features found on ZTZ99A, players can finally make good use of the latest Chinese technologies on tanks to take out enemies with its surprisingly good mobility.\n\nThe ZTZ99A (WZ1001) has very little technological connection to the ZTZ99-II & -III (WZ123).\n\n== General info ==\n=== Survivability and armour ===\n{{Specs-Tank-Armour}}\n<!-- ''Describe armour protection. Note the most well protected and key weak areas. Appreciate the layout of modules as well as the number and location of crew members. Is the level of armour protection sufficient, is the placement of modules helpful for survival in combat? If necessary use a visual template to indicate the most secure and weak zones of the armour.'' -->\nThough it shares the number 99 in its name, the ZTZ99A in fact has very little technological relationship to previous ZTZ99s. The ZTZ99A has a completely new design with a higher overall profile to previous tanks comparable to NATO tanks. It features an arrow-shaped composite armour block and new FY-5 ERA with up to 250 mm KE protection covering the turret. In case of top-down missiles, the new FY-1D1 ERA covering the top of turret can mitigate some of the damage. But as for the hull, since the design requirement was for equivalent protection to previous ZTZ99s, aside from the UFP armour itself, there's only FY-4 covering the UFP as well as the sides of the turret.\n\nAnother major difference is that the driver is moved to the right side of the hull (from the enemy's perspective), if opponents aren't able differentiate between the 99A and other 99s, it is very likely that shots hitting the UFP will prove fruitless. To say at least, aside from the headlights on the UFP, LFP and the mantlet, the ZTZ99A will have a better protection at its frontal arc than its predecessors.\n\n'''Armour type:''' <!-- The types of armour present on the vehicle and their general locations -->\n<!-- Example: * Rolled homogeneous armour (Front, Side, Rear, Hull roof)\n* Cast homogeneous armour (Turret, Transmission area) -->\n\n{| class=\"wikitable\"\n|-\n! Armour !! Front (Slope angle) !! Sides !! Rear !! Roof\n|-\n| Hull || ___ mm || ___ mm ''Top'' <br> ___ mm ''Bottom'' || ___ mm || ___ - ___ mm\n|-\n| Turret || ___ - ___ mm ''Turret front'' <br> ___ mm ''Gun mantlet'' || ___ - ___ mm || ___ - ___ mm || ___ - ___ mm\n|-\n| Cupola || ___ mm || ___ mm || ___ mm || ___ mm\n|-\n|}\n\n'''Notes:''' <!-- Any additional notes which the user needs to be aware of -->\n<!-- Example: * Suspension wheels are 20 mm thick, tracks are 30 mm thick, and torsion bars are 60 mm thick. -->\n\n=== Mobility ===\n{{Specs-Tank-Mobility}}\n<!-- ''Write about the mobility of the ground vehicle. Estimate the specific power and manoeuvrability, as well as the maximum speed forwards and backwards.'' -->\nThe efforts of Chinese armoured vehicle designers in the first decade of 21st century have finally ripened - ZTZ99A sports a new powerpack consists of the NORINCO Shaanxi 12V150HB-1 diesel engine and CH1000 transmission. With 1500 hp power output when spaded and having a DCT transmission, it is the fastest MBT in the game at 75 km/h and has a -34 km/h reverse; unprecedented for any Warsaw Pact or Chinese tank. The new transmission also makes ZTZ99A a huge but nimble tank in terms of its turning radius, and vastly improves its reaction time to enemies or in case of a quick retreat.\n\n{{tankMobility|abMinHp=2,325|rbMinHp=1,327}}\n\n=== Modifications and economy ===\n{{Specs-Economy}}\n\n== Armaments ==\n{{Specs-Tank-Armaments}}\n=== Main armament ===\n{{Specs-Tank-Weapon|1}}\n<!-- ''Give the reader information about the characteristics of the main gun. Assess its effectiveness in a battle based on the reloading speed, ballistics and the power of shells. Do not forget about the flexibility of the fire, that is how quickly the cannon can be aimed at the target, open fire on it and aim at another enemy. Add a link to the main article on the gun: <code><nowiki>{{main|Name of the weapon}}</nowiki></code>. Describe in general terms the ammunition available for the main gun. Give advice on how to use them and how to fill the ammunition storage.'' -->\n{{main|Type 99A (125 mm)}}\n\nThe new ZPT99A gun on ZTZ99A is similar to previous ZPT98 gun, both gun share very similar characteristics with high muzzle velocity, straight ballistics, and feature an autoloader. Although the turret traverse speed hinders some of its combat capabilities, it is certainly an improvement to previous tanks.\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"100%\"\n|-\n! colspan=\"5\" | [[Type 99A (125 mm)|125 mm Type 99A]] || colspan=\"5\" | Turret rotation speed (°/s) || colspan=\"4\" | Reloading rate (seconds)\n|-\n! Mode !! Capacity !! Vertical !! Horizontal !! Stabilizer\n! Stock !! Upgraded !! Full !! Expert !! Aced\n! Stock !! Full !! Expert !! Aced\n|-\n! ''Arcade''\n| rowspan=\"2\" | 39 || rowspan=\"2\" | -5°/+13° || rowspan=\"2\" | ±180° || rowspan=\"2\" | Two-plane || __._ || __._ || __._ || __._ || __._ || rowspan=\"2\" | 7.1 || rowspan=\"2\" | 7.1 || rowspan=\"2\" |7.1\n| rowspan=\"2\" |7.1\n|-\n! ''Realistic''\n| __._ || __._ || __._ || __._ || __._\n|-\n|}\n\n==== Ammunition ====\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"8\" | Penetration statistics\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! colspan=\"6\" | Penetration @ 0° Angle of Attack (mm)\n|-\n! 10 m !! 100 m !! 500 m !! 1,000 m !! 1,500 m !! 2,000 m\n|-\n| DTP-125 || HEATFS || 480 || 480 || 480 || 480 || 480 || 480\n|-\n| DTB-125 || HE || 45 || 45 || 45 || 45 || 45 || 45\n|-\n| 125-I || APFSDS || 466 || 464 || 458 || 450 || 442 || 434\n|-\n| DTC10-125 || APFSDS || 577 || 575 || 566 || 555 || 544 || 533\n|-\n| GP125 || ATGM (tandem) || 850 || 850 || 850 || 850 || 850 || 850\n|-\n| DTB12-125 || HE-VT* || 43 || 43 || 43 || 43 || 43 || 43\n|-\n|}\n{| class=\"wikitable sortable\" style=\"text-align:center\" width=\"100%\"\n! colspan=\"10\" | Shell details\n|-\n! rowspan=\"2\" data-sort-type=\"text\" | Ammunition\n! rowspan=\"2\" | Type of<br>warhead\n! rowspan=\"2\" | Velocity<br>(m/s)\n! rowspan=\"2\" | Projectile<br>Mass (kg)\n! rowspan=\"2\" | Fuse delay<br>(m)\n! rowspan=\"2\" | Fuse sensitivity<br>(mm)\n! rowspan=\"2\" | Explosive Mass<br>(TNT equivalent) (g)\n! colspan=\"3\" | Ricochet\n|-\n! 0% !! 50% !! 100%\n|-\n| DTP-125 || HEATFS || 905 || 18 || 0.05 || 0.1 || 2,190 || 65° || 72° || 77°\n|-\n| DTB-125 || HE || 850 || 23 || 0 || 0.1 || 5,460 || 79° || 80° || 81°\n|-\n| 125-I || APFSDS || 1,730 || 4.02 || N/A || N/A || N/A || 78° || 80° || 81°\n|-\n| DTC10-125 || APFSDS || 1,770 || 4.85 || N/A || N/A || N/A || 78° || 80° || 81°\n|-\n| DTB12-125 || HE-VT* || 850 || 23.2 || 0 || 0.1 || 5,300 || 79° || 80° || 81°\n|-\n| GP125 || ATGM (tandem) || 400 || 17.2 || 0.4 || 0.01 || 4,720 || 80° || 82° || 90°\n|-\n|}\n\n'''DTP-125 HEATFS'''\n\nThe stock DTP-125 HEAT-FS round has the typical penetration of 480 mm shared by Western MBTs with 120 mm guns, but this is not enough to deal with tanks with composite armour, which are the norm at top tiers. The post-penetration damage is also disappointing. Only use it as an interim shell before APFSDS is unlocked. With 2.19 kg of explosive mass, it is sometimes capable of knocking out light targets like SPAAs and light tanks with overpressure damage, so keep an eye out for those.\n\n'''DTB-125 HE-FS'''\n\nThe stock DTB-125 HE shell is one of the strongest of any top-rank MBT. It can actually cause more damage to MBTs than the HEAT-FS round if fired at turret rings, hull roofs, and turret cupolas, due to overpressure damage. Well placed impacts have a good chance of transmitting the shockwave into the crew compartment and knocking the target out instantly, even against the toughest MBTs like the [[Strv 122A]]. It helps to keep a few HE rounds around even after APFSDS is unlocked as they excel at causing pressure damage to light targets.\n\n'''DTB12-125 HE-VT'''\n\nDTB12-125 is also available as a tier 4 modification; this is one of the few HE-VT shells available for a top-tier MBT. This shell turns ZTZ99A into a 125 mm anti-aircraft gun thanks to its generous explosive filler, any aircraft that are within its 7 m trigger radius will not have a good day. Although it has lesser explosive content, the VT fuse is not triggered by ground vehicles so it can serve as an alternative for the stock HE-FS as well\n\n'''125-I APFSDS'''\n\nThe 125-I APFSDS round is a tier 1 modification. Though it first appeared on the [[ZTZ96]], it is still used by the latest ZTZ99A and eases the stock grind considerably. It has very similar flat penetration and superior angled penetration to the 3BM42 \"Mango\" round used by Soviet tanks and can penetrate most contemporary opponents through at least the lower front plate and gun breech.\n\n'''DTC10-125 APFSDS'''\n\nWaiting as a tier 4 modification is the DTC10-125 APFSDS round, a high mass and high velocity shell with only slightly worse performance compared to 3BM60 on the [[T-80BVM]]. This will be the go-to round for the ZTZ99A and most targets at the rank are unlikely to withstand a penetrating shot from this shell.\n\n'''GP125 tandem ATGM'''\n\nThe ZTZ99A also has access to the GP125 tandem ATGM, which performs identically to its Soviet counterpart. If players find their darts are not effective against well-armoured targets, the sufficient velocity and penetration can ruin the day of such vehicles, as well as helicopters if they don't evade the incoming missile.\n\n==== [[Ammo racks]] ====\n<!-- [[File:Ammoracks_{{PAGENAME}}.png|right|thumb|x250px|[[Ammo racks]] of the {{PAGENAME}}]] -->\n<!-- '''Last updated:''' -->\n{| class=\"wikitable\" style=\"text-align:center\"\n|-\n! Full<br>ammo\n! Ammo<br>type\n! 1st<br>rack empty\n! 2nd<br>rack empty\n! 3rd<br>rack empty\n! 4th<br>rack empty\n! 5th<br>rack empty\n! 6th<br>rack empty\n! 7th<br>rack empty\n! Visual<br>discrepancy\n|-\n| '''39''' || ''Projectiles<br>Propellants'' || 37 ''(+2)''<br>39 ''(+0)'' || 34 ''(+5)''<br>38 ''(+1)'' || 31 ''(+8)''<br>37 ''(+2)'' || 27 ''(+12)''<br>28 ''(+11)'' || 23 ''(+16)''<br>26 ''(+13)'' || 1 ''(+38)''<br>23 ''(+16)'' || N/A<br>1 ''(+38)'' || No\n|-\n|}\n\nLike its predecessors, to ensure the best survivability, only bring 23 shells at your disposal (22 in autoloader and 1 preloaded shell); any more shells will have to be moved into the autoloader before being able to fire and significantly increase the risk of ammunition cook-off in case of any penetrating shots.\n\n=== Machine guns ===\n{{Specs-Tank-Weapon|2}}\n{{Specs-Tank-Weapon|3}}\n<!-- ''Offensive and anti-aircraft machine guns not only allow you to fight some aircraft but also are effective against lightly armoured vehicles. Evaluate machine guns and give recommendations on its use.'' -->\n{{main|QJC88A (12.7 mm)|QJT (5.8 mm)}}\n\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[QJC88A (12.7 mm)|12.7 mm QJC88A]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Pintle || 500 (150) || 700 || -5°/+60° || ±180°\n|-\n|}\n{| class=\"wikitable\" style=\"text-align:center\" width=\"50%\"\n|-\n! colspan=\"5\" | [[QJT (5.8 mm)|5.8 mm QJT]]\n|-\n! Mount !! Capacity (Belt) !! Fire rate !! Vertical !! Horizontal\n|-\n| Coaxial || 2,500 (200) || 801 || N/A || N/A\n|-\n|}\n\n== Usage in battles ==\n<!-- ''Describe the tactics of playing in the vehicle, the features of using vehicles in the team and advice on tactics. Refrain from creating a \"guide\" - do not impose a single point of view but instead give the reader food for thought. Describe the most dangerous enemies and give recommendations on fighting them. If necessary, note the specifics of the game in different modes (AB, RB, SB).'' -->\nAs the spearhead of the current PLAGF armoured corps, thanks to the vastly improved mobility compared to its predecessors and new technologies intergrated onto ZTZ99A, it has better handling than its predecessors and is comparable to NATO vehicles in terms of its power-to-weight ratio and top speed. The newly designed tank also has very similar protection to its predecessors while parts of its turrets are replaced by brand new FY-5 ERA blocks and the top is covered by FY-1DA ERA blocks, improving its survivability against top-down attacks. However, the mantlet is still lightly protected compared to other MBTs at its rank, a penetrating shot is now even more likely to cause a breech knockout or even lethal damage to the gun crews. In terms of the hull, although it was remarked to have the protection of a ZTZ99 and the driver has been moved to the left side, the age-old problem of a huge LPF and less protected area over the driver can certainly ruin a player's day at top tier. So it is better to keep the ZTZ99A away from heated battlefields or make sure to cover the LFP and mantlet as much as possible. In case of complicated terrains, either avoid them or quickly dig for cover with the dozer blade modification.\n\nIn the firepower department, ZTZ99A also comes with a wide variety of shells; the darts, although having somewhat below average penetration, are overall still sufficient enough to knock-out most western vehicles aside from Strv 122; when facing Russians though, in case players are not confident in the darts, the GP125 tandem ATGM is an alternative to melt through Russian MBTs. While both HE shells seemed similar, the stock DTB-125 is still among the most hard-hitting HE shell at top tier while the new DTB12-125 is a VT shell, meaning that any aircraft that comes close to its 7 m triggering range will have a very bad day thanks to its explosive content. So bringing a variety of shells is viable to make the ZTZ99A more versatile or sometimes have the capability to deliver a last-ditch strike back.\n\n=== Pros and cons ===\n<!-- ''Summarise and briefly evaluate the vehicle in terms of its characteristics and combat effectiveness. Mark its pros and cons in a bulleted list. Try not to use more than 6 points for each of the characteristics. Avoid using categorical definitions such as \"bad\", \"good\" and the like - use substitutions with softer forms such as \"inadequate\" and \"effective\".'' -->\n\n'''Pros:'''\n\n* Great manoeuvrability\n** Very high top speed for an MBT\n** -34 km/h reverse speed, vastly improving its odds to retreat\n** Dual-flow transmission and shorter chassis enables a tighter turning radius\n* Powerful guns with variety of shells ranging from darts up to ATGM\n* Very similar sturdy protection to its predecessors\n* Faster horizontal traverse speed for the gun\n\n'''Cons:'''\n\n* Still suffers from a huge LFP and insufficient mantlet protection\n* Has the infamous \"NATO hump\" that hinders firing arc at rear angles\n* Insufficient vertical traverse speed in case of a sudden strike\n* Thin side armour, can be penetrated by IFVs and aircraft\n* Relatively large profile compared to previous PLAGF tanks\n* DTC10-125 has somewhat low penetration for a top tier shell\n\n== History ==\n<!-- ''Describe the history of the creation and combat usage of the vehicle in more detail than in the introduction. If the historical reference turns out to be too long, take it to a separate article, taking a link to the article about the vehicle and adding a block \"/History\" (example: <nowiki>https://wiki.warthunder.com/(Vehicle-name)/History</nowiki>) and add a link to it here using the <code>main</code> template. Be sure to reference text and sources by using <code><nowiki><ref></ref></nowiki></code>, as well as adding them at the end of the article with <code><nowiki><references /></nowiki></code>. This section may also include the vehicle's dev blog entry (if applicable) and the in-game encyclopedia description (under <code><nowiki>=== In-game description ===</nowiki></code>, also if applicable).'' -->\nAs the previous WZ123/ZTZ99 program had been certified, the Central Military Commission only deemed ZTZ99s as the placeholder before their ultimate aim - a 3rd generation MBT - was achieved. Soon after the first batches of ZTZ99-III rolled off the production line, the new designer, Mao Ming (毛明) of Institute 201 took over from his mentor Zhu Yusheng (祝榆生) and started on his new design of MBT - WZ1001.\n\nThe earliest known prototypes consisted of 3 WZ1001s which had different designs: the first was based on a ZTZ99, installing a brand new turret and reworking the rear side of the chassis to fit a new power pack; the second one looked similar to what the certified WZ1001 would be; while the third installed an experimental 125 mm L/54 gun based on the former. These prototypes were first spotted in 2006 and their efforts for a new tank were then certified in 2010, thus named ZTZ10 then ZTZ99A due to unknown reasons.\n\nThe earliest batches of the pre-production run ZTZ99As were spotted in the early 2010s equipping an experimental millimeter-wave IFF radar, known simply as New MBT (新型主战坦克) or by the erroneous name ZTZ99A2 (or 99大改) to observers. The debate of the name settled down when it was first shown during the 70th V-J Day Parade in Beijing as the TJ1XX column during the parade; as later batches started to be manufactured in 2016, those in 90th PLA Day Parade at Zhurihe Base (朱日和基地; a Fort Owen-like exercise ground for PLA troops) and during the 70th National Day Parade had slightly different designs with the removal of the aforementioned MMW radar.\n\n=== [[wt:en/news/7722-development-ztz99a-roaring-tiger-en|Devblog]] ===\nThe ZTZ99A is a further development of the ZTZ99 MBT, already familiar to seasoned War Thunder tankers and fans of Chinese ground vehicles in the game. However, despite sharing a common chassis, the ZTZ99A can be considered a completely new vehicle thanks to a near complete overhaul of its design, particularly concerning its turret. Unlike previous variants, the ZTZ99A features a new arrow-shaped turret, fitted with state-of-the-art ERA and composite armour, capable of defeating even tandem charge chemical rounds.\n\nWhile the protection upgrade did result in the vehicle gaining roughly 4 tons in weight over its immediate predecessor, this drawback is amply compensated by the ZTZ99A receiving a new 1,500 horsepower diesel engine. As a result, the vehicle's power-to-weight ratio increases to an impressive 27.7 hp/t despite the weight increase! As a result, the ZTZ99A actually outmatches its predecessors in terms of mobility, being able to attain a top speed of 75 km/h on paved roads. Furthermore, a new transmission eliminates the poor reverse speed of the older modifications with the ZTZ99A now being capable of reaching up to 34 km/h while going in reverse. Quite a handy upgrade for intense gun fights, eh?\n\nUnlike its protection and mobility, the ZTZ99A's firepower however remains virtually unchanged from previous versions. The vehicle still features the familiar ZPT-98 125 mm smoothbore cannon as well as a coaxial 7.62 mm machine gun and a top-mounted high-caliber commander's machine gun. Therefore, the ZTZ99A inherits its predecessors' excellent firepower and combines it with its own upgrades to result in a potent new fighting vehicle, worthy of the top spot in the Chinese ground forces tree.\n\n== Media ==\n<!-- ''Excellent additions to the article would be video guides, screenshots from the game, and photos.'' -->\n\n;Skins\n* [https://live.warthunder.com/feed/camouflages/?vehicle=cn_ztz_99a Skins and camouflages for the {{PAGENAME}} from live.warthunder.com.]\n\n;Videos\n{{Youtube-gallery|hb-P5hQN6K0|'''The Shooting Range #308''' - ''Metal Beasts'' section at 00:24 discusses the {{PAGENAME}}.}}\n\n== See also ==\n<!-- ''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.'' -->\n''Links to the articles on the War Thunder Wiki that you think will be useful for the reader, for example:''\n\n* ''reference to the series of the vehicles;''\n* ''links to approximate analogues of other nations and research trees.''\n\n== External links ==\n<!-- ''Paste links to sources and external resources, such as:''\n* ''topic on the official game forum;''\n* ''other literature.'' -->\n\n* [[wt:en/news/7722-development-ztz99a-roaring-tiger-en|[Devblog] ZTZ99A: Roaring Tiger]]\n\n{{TankManufacturer Norinco}}\n{{China medium tanks}}\n[[Category:ATGM vehicles]]"}}